-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/u01/bhps/final_log.log
  log type:  text
 opened on:  12 Feb 2015, 13:40:34

. 
. 
. 
. 
. **append waves
. 
. global chars a b c d e f g h i j k l m n o p q r

. 
. foreach w of newlist $chars {
  2.  di "`w'1" 
  3.  use `w'indresp.dta, clear
  4.   di "`w'2" 
  5. 
.  global vars `w'frn* `w'op* `w'bwt* `w'hls* `w'jbisco* `w'jlisco*
>  `w'mrj* `w'paiscon `w'maiscon `w'j1* `w'movjb* `w'edfee* `w'trfe
> e* `w'trq* `w'coh* `w'vote* `w'lac* `w'nfh* `w'edql* `w'edoql* `w
> 'trql* `w'net* `w'wem* `w'ln*
  6.  **drop variables
.    di "`w'3" 
  7. 
.  foreach v of global vars {
  8.   capture drop `v'
  9.  }
 10.    di "`w'4" 
 11.  rename `w'* *
 12.  save `w'bhps.dta, replace
 13. }
a1
a2
a3
a4
file abhps.dta saved
b1
b2
b3
b4
file bbhps.dta saved
c1
c2
c3
c4
file cbhps.dta saved
d1
d2
d3
d4
file dbhps.dta saved
e1
e2
e3
e4
file ebhps.dta saved
f1
f2
f3
f4
file fbhps.dta saved
g1
g2
g3
g4
file gbhps.dta saved
h1
h2
h3
h4
file hbhps.dta saved
i1
i2
i3
i4
file ibhps.dta saved
j1
j2
j3
j4
file jbhps.dta saved
k1
k2
k3
k4
file kbhps.dta saved
l1
l2
l3
l4
file lbhps.dta saved
m1
m2
m3
m4
file mbhps.dta saved
n1
n2
n3
n4
file nbhps.dta saved
o1
o2
o3
o4
file obhps.dta saved
p1
p2
p3
p4
file pbhps.dta saved
q1
q2
q3
q4
file qbhps.dta saved
r1
r2
r3
r4
file rbhps.dta saved

. 
. global bhps

. foreach w of newlist $chars  {
  2.  global bhps $bhps `w'bhps.dta
  3. }

. append using $bhps, gen(srcwave)
(note: variable plbornd was byte, now int to accommodate using
       data's values)
(note: variable payly was int, now long to accommodate using
       data's values)
(note: variable pahgs was byte, now double to accommodate using
       data's values)
(note: variable mahgs was byte, now double to accommodate using
       data's values)
(note: variable jbhgs was byte, now double to accommodate using
       data's values)
(note: variable jlhgs was byte, now double to accommodate using
       data's values)
(note: variable ftexcv was byte, now int to accommodate using
       data's values)
(note: variable ftexcw was byte, now double to accommodate using
       data's values)
(note: variable cjsten was int, now long to accommodate using
       data's values)
(note: variable edendy was byte, now int to accommodate using
       data's values)
(note: variable windfgy was int, now long to accommodate using
       data's values)
(note: variable maage was byte, now int to accommodate using
       data's values)
(label rregion2 already defined)
(label rdistmov already defined)
(label rcasmin already defined)
(label risced already defined)
(label rjsbgly already defined)
(label rjsbgy4 already defined)
(label rjsbgm already defined)
(label rjsbgd already defined)
(label rjbbgly already defined)
(label rjbbgy4 already defined)
(label rjbbgm already defined)
(label rjbbgd already defined)
(label rfimnsel already defined)
(label rmasec already defined)
(label rmahgs already defined)
(label rmacssf already defined)
(label rmacssm already defined)
(label rmargsc already defined)
(label rmagold already defined)
(label rmaseg already defined)
(label rpasec already defined)
(label rpahgs already defined)
(label rpacssf already defined)
(label rpacssm already defined)
(label rpargsc already defined)
(label rpagold already defined)
(label rpaseg already defined)
(label rfihhmni already defined)
(label rsppaygi already defined)
(label rfiyeari already defined)
(label rfiyrii already defined)
(label rfiyrti already defined)
(label rfiyrbi already defined)
(label rfiyrpi already defined)
(label rfiyrnli already defined)
(label rfiyrli already defined)
(label rfimnthi already defined)
(label rfimnli already defined)
(label rfimnnli already defined)
(label rfimnti already defined)
(label rfimnii already defined)
(label rfimnbi already defined)
(label rfimnpi already defined)
(label rjspaygi already defined)
(label rjsprofi already defined)
(label rpaynli already defined)
(label rpaynti already defined)
(label rpaygli already defined)
(label rpaygti already defined)
(label rpaynui already defined)
(label rpaygui already defined)
(label rprfitbi already defined)
(label rprearni already defined)
(label rfiyrdii already defined)
(label rj2payi already defined)
(label rspjbyr already defined)
(label rsppayg already defined)
(label rspjbot already defined)
(label rspjbhr already defined)
(label rspsoc already defined)
(label rspjb already defined)
(label rhlghq2 already defined)
(label rhlghq1 already defined)
(label rfihhmn already defined)
(label rfiyr already defined)
(label rfiyri already defined)
(label rfiyrt already defined)
(label rfiyrb already defined)
(label rfiyrp already defined)
(label rfiyrnl already defined)
(label rfiyrl already defined)
(label rfimn already defined)
(label rfimnnl already defined)
(label rfimnl already defined)
(label rfimnt already defined)
(label rfimni already defined)
(label rfimnb already defined)
(label rfimnp already defined)
(label rfiyrdic already defined)
(label rjlsec already defined)
(label rjlhgs already defined)
(label rjlcssf already defined)
(label rjlcssm already defined)
(label rjlrgsc already defined)
(label rjlgold already defined)
(label rjlseg already defined)
(label rjbsocly already defined)
(label rjbstatt already defined)
(label rjbstatl already defined)
(label rnjisp already defined)
(label rnjusp already defined)
(label rnjbsp already defined)
(label rnjbnew already defined)
(label rnjiwks already defined)
(label rnjuwks already defined)
(label rnjbwks already defined)
(label rjbsec already defined)
(label rjbhgs already defined)
(label rjbcssf already defined)
(label rjbcssm already defined)
(label rjbrgsc already defined)
(label rjbgold already defined)
(label rjbseg already defined)
(label rjtyid already defined)
(label rjlyid already defined)
(label rjlid already defined)
(label rcjswk9 already defined)
(label rcjsten already defined)
(label rjspayg already defined)
(label rjsloss already defined)
(label rjsprof already defined)
(label rpaynly already defined)
(label rpaynty already defined)
(label rpaygly already defined)
(label rpaygty already defined)
(label rpaynu already defined)
(label rpaygu already defined)
(label rpayn already defined)
(label rpayg already defined)
(label rjbft already defined)
(label rqfachi already defined)
(label rqfvoc already defined)
(label rqfedhi already defined)
(label rtenure already defined)
(label rhhtype already defined)
(label rhhsize already defined)
(label rregion already defined)
(label rmovest already defined)
(label rsampst already defined)
(label rrach16 already defined)
(label rhoh already defined)
(label rnchild already defined)
(label rbuno already defined)
(label rbutype already defined)
(label rage12 already defined)
(label rage already defined)
(label rhgra already defined)
(label rhgmno already defined)
(label rhgfno already defined)
(label rhgemp already defined)
(label rhgspn already defined)
(label rmastat already defined)
(label rhgby already defined)
(label rhgbm already defined)
(label rhgsex already defined)
(label rhgr2r already defined)
(label rmemorig already defined)
(label riodc already defined)
(label rivfio already defined)
(label rneyrjn4 already defined)
(label rnemnjn already defined)
(label rnewhy already defined)
(label rhhmem already defined)
(label riviolw already defined)
(label rtropay already defined)
(label rtrben2 already defined)
(label rtrben1 already defined)
(label rtrpen already defined)
(label rtelhtq already defined)
(label rtelqal already defined)
(label rtlhqly already defined)
(label rtelqly already defined)
(label rthhrpw already defined)
(label rthrpop already defined)
(label rivpe already defined)
(label rivpd already defined)
(label rivpc already defined)
(label rivpb already defined)
(label rivpa already defined)
(label rprfitb already defined)
(label rprfirn already defined)
(label rprf107 already defined)
(label rprf143 already defined)
(label rprf141 already defined)
(label rprf125 already defined)
(label rprf139 already defined)
(label rprf137 already defined)
(label rprf135 already defined)
(label rprf131 already defined)
(label rprf116 already defined)
(label rprf102 already defined)
(label rprf101 already defined)
(label rprearn already defined)
(label rprjbly already defined)
(label rprjbby4 already defined)
(label rprjbbgm already defined)
(label rprjbft already defined)
(label rprsehq already defined)
(label rprfehq already defined)
(label rpresly already defined)
(label rpresby4 already defined)
(label rpresbgm already defined)
(label rpplevr already defined)
(label rprwhy already defined)
(label rpripn already defined)
(label rprrs2i already defined)
(label rriskb already defined)
(label rriska already defined)
(label rtrust already defined)
(label rlfsatl already defined)
(label rlfsato already defined)
(label rlfsat8 already defined)
(label rlfsat7 already defined)
(label rlfsat6 already defined)
(label rlfsat5 already defined)
(label rlfsat4 already defined)
(label rlfsat3 already defined)
(label rlfsat2 already defined)
(label rlfsat1 already defined)
(label rghql already defined)
(label rghqk already defined)
(label rghqj already defined)
(label rghqi already defined)
(label rghqh already defined)
(label rghqg already defined)
(label rghqf already defined)
(label rghqe already defined)
(label rghqd already defined)
(label rghqc already defined)
(label rghqb already defined)
(label rghqa already defined)
(label riv10l already defined)
(label riv10k already defined)
(label riv10j already defined)
(label riv10i already defined)
(label riv10h already defined)
(label riv10g already defined)
(label riv10f already defined)
(label riv10e already defined)
(label riv10d already defined)
(label riv10c already defined)
(label riv10b already defined)
(label riv10a already defined)
(label riv10no already defined)
(label riv9 already defined)
(label riv7 already defined)
(label riv6f already defined)
(label riv6e already defined)
(label riv6d already defined)
(label riv6c already defined)
(label riv6b already defined)
(label riv6a already defined)
(label riv5ac already defined)
(label riv5ab already defined)
(label riv5aa already defined)
(label riv5 already defined)
(label riv4 already defined)
(label riv2 already defined)
(label riv1 already defined)
(label rivsc already defined)
(label rivfoim already defined)
(label rivfoih already defined)
(label rivfe already defined)
(label rivfd already defined)
(label rivfc already defined)
(label rivfb already defined)
(label rivfa already defined)
(label rcosb already defined)
(label rcose already defined)
(label rcoshf already defined)
(label rcosh already defined)
(label rneigh4 already defined)
(label rneigh3 already defined)
(label rneigh2 already defined)
(label rneigh1 already defined)
(label rneigh already defined)
(label rmobuse already defined)
(label rcaruse already defined)
(label rhowlng already defined)
(label rhusits already defined)
(label rhhch12 already defined)
(label rhuiron already defined)
(label rhumops already defined)
(label rhufrys already defined)
(label rhubuys already defined)
(label rftexcw already defined)
(label rftexcv already defined)
(label rftexc6 already defined)
(label rftexc5 already defined)
(label rftexc4 already defined)
(label rftexc3 already defined)
(label rftexc2 already defined)
(label rftexc1 already defined)
(label rftexc already defined)
(label rftexbw already defined)
(label rftexbv already defined)
(label rftexb6 already defined)
(label rftexb5 already defined)
(label rftexb4 already defined)
(label rftexb3 already defined)
(label rftexb2 already defined)
(label rftexb1 already defined)
(label rftexb already defined)
(label rftexaw already defined)
(label rftexav already defined)
(label rftexa6 already defined)
(label rftexa5 already defined)
(label rftexa4 already defined)
(label rftexa3 already defined)
(label rftexa2 already defined)
(label rftexa1 already defined)
(label rftexa already defined)
(label rftexhh already defined)
(label rxpleis already defined)
(label rxpmeal already defined)
(label rwindfhy already defined)
(label rwindfh already defined)
(label rwindfgy already defined)
(label rwindfg already defined)
(label rwindffy already defined)
(label rwindff already defined)
(label rwindfdy already defined)
(label rwindfd already defined)
(label rwindfcy already defined)
(label rwindfc already defined)
(label rwindfby already defined)
(label rwindfb already defined)
(label rwindfay already defined)
(label rwindfa already defined)
(label rwindf already defined)
(label rpenadw already defined)
(label rpenadv already defined)
(label rpenadd already defined)
(label rpenyr4 already defined)
(label rpenb4w already defined)
(label rpenb4v already defined)
(label rpenb4y4 already defined)
(label rpenb4 already defined)
(label rpck2 already defined)
(label rpenvrf already defined)
(label rpck1 already defined)
(label rpppen already defined)
(label rsavlt already defined)
(label rsavreg already defined)
(label rsavey2 already defined)
(label rsavey1 already defined)
(label rsaved already defined)
(label rsave already defined)
(label rfiyrdb6 already defined)
(label rfiyrdb5 already defined)
(label rfiyrdb4 already defined)
(label rfiyrdb3 already defined)
(label rfiyrdb2 already defined)
(label rfiyrdb1 already defined)
(label rfiyrdia already defined)
(label rfisitx already defined)
(label rfisity already defined)
(label rfisitc already defined)
(label rfisit already defined)
(label rniserps already defined)
(label rnipens already defined)
(label rnf1 already defined)
(label rrhben already defined)
(label rrchben already defined)
(label rmach18 already defined)
(label rnisjsa already defined)
(label rrjsa already defined)
(label rris already defined)
(label rrdsbn28 already defined)
(label rrdsbn27 already defined)
(label rrdsbn26 already defined)
(label rrdsbn25 already defined)
(label rrdsbn22 already defined)
(label rrdsbn21 already defined)
(label rrdsbn19 already defined)
(label rrdsbn18 already defined)
(label rrdsbn16 already defined)
(label rrdsben already defined)
(label rrpencr already defined)
(label rrsrpen already defined)
(label rf159 already defined)
(label rf158 already defined)
(label rf157 already defined)
(label rf156 already defined)
(label rf155 already defined)
(label rf154 already defined)
(label rf153 already defined)
(label rf152 already defined)
(label rf151 already defined)
(label rf144 already defined)
(label rf143 already defined)
(label rf142 already defined)
(label rf141 already defined)
(label rf140 already defined)
(label rf139 already defined)
(label rf138 already defined)
(label rf137 already defined)
(label rf135 already defined)
(label rf132 already defined)
(label rf128 already defined)
(label rf127 already defined)
(label rf126 already defined)
(label rf125 already defined)
(label rf122 already defined)
(label rf121 already defined)
(label rf119 already defined)
(label rf118 already defined)
(label rf116 already defined)
(label rf107 already defined)
(label rf106 already defined)
(label rf105 already defined)
(label rf104 already defined)
(label rf103 already defined)
(label rf102 already defined)
(label rf101 already defined)
(label rpf0m already defined)
(label rpf0h already defined)
(label rivve already defined)
(label rivvd already defined)
(label rivvc already defined)
(label rivvb already defined)
(label rivva already defined)
(label rnflyos already defined)
(label rnflyeu already defined)
(label rnflyin already defined)
(label rflyes4 already defined)
(label rflyes3 already defined)
(label rflyes2 already defined)
(label rflyes1 already defined)
(label rgrnlfh already defined)
(label rgrnlfg already defined)
(label rgrnlff already defined)
(label rgrnlfe already defined)
(label rgrnlfd already defined)
(label rgrnlfc already defined)
(label rgrnlfb already defined)
(label rgrnlfa already defined)
(label rlocchd already defined)
(label rlocsere already defined)
(label rlocserd already defined)
(label rlocserc already defined)
(label rlocserb already defined)
(label rlocsera already defined)
(label rlfimph already defined)
(label rlfimpg already defined)
(label rlfimpf already defined)
(label rlfimpe already defined)
(label rlfimpd already defined)
(label rlfimpc already defined)
(label rlfimpb already defined)
(label rlfimpa already defined)
(label rnipop5 already defined)
(label rpv0m already defined)
(label rpv0h already defined)
(label rivje already defined)
(label rivjd already defined)
(label rivjc already defined)
(label rivjb already defined)
(label rivja already defined)
(label rjlsize already defined)
(label rjlmngr already defined)
(label rjlboss already defined)
(label rjlsemp already defined)
(label rjlsic92 already defined)
(label rjlsoc00 already defined)
(label rjlsoc already defined)
(label rjlend4 already defined)
(label rjbhad already defined)
(label rjhstpy already defined)
(label rcjsck4 already defined)
(label rcjscjs already defined)
(label rcjsey4 already defined)
(label rcjsem already defined)
(label rcjsed already defined)
(label rcjsstly already defined)
(label rcjsck3 already defined)
(label rcjsck2 already defined)
(label rcjsbly already defined)
(label rcjsbgy4 already defined)
(label rcjsbgm already defined)
(label rcjsbgd already defined)
(label rcjsck1 already defined)
(label rivee already defined)
(label rived already defined)
(label rivec already defined)
(label riveb already defined)
(label rivea already defined)
(label rj2pay already defined)
(label rj2hrs already defined)
(label rj2semp already defined)
(label rj2soc00 already defined)
(label rj2soc already defined)
(label rj2has already defined)
(label rjbuby already defined)
(label rjbub already defined)
(label reaage already defined)
(label reprosh already defined)
(label rjuhrsl already defined)
(label rjupayl already defined)
(label rjupayx already defined)
(label rjuhrsx already defined)
(label rjusoc00 already defined)
(label rjusoc already defined)
(label rjuspec already defined)
(label rjubgn already defined)
(label rjulkjb already defined)
(label rjulke already defined)
(label rjulkd already defined)
(label rjulkc already defined)
(label rjulkb already defined)
(label rjulka already defined)
(label rjulk4 already defined)
(label rjulk1 already defined)
(label rhunurs already defined)
(label rhuxpch already defined)
(label rxpchc already defined)
(label rxpchcf already defined)
(label rjbchc3 already defined)
(label rjbchc2 already defined)
(label rjbchc1 already defined)
(label rrach12 already defined)
(label rjbxpche already defined)
(label rjblkche already defined)
(label rjbxpchd already defined)
(label rjblkchd already defined)
(label rjbxpchc already defined)
(label rjblkchc already defined)
(label rjbxpchb already defined)
(label rjblkchb already defined)
(label rjbxpcha already defined)
(label rjblkcha already defined)
(label rjsbgly1 already defined)
(label rjsbgy41 already defined)
(label rjsbgm1 already defined)
(label rjsbgd1 already defined)
(label rjssame already defined)
(label rjsck1 already defined)
(label rjssat already defined)
(label rjssat5 already defined)
(label rjssat4 already defined)
(label rjssat2 already defined)
(label rjssat1 already defined)
(label rjsttwm already defined)
(label rjsttwt already defined)
(label rjspl already defined)
(label rjspyni already defined)
(label rjspytx already defined)
(label rjspayw already defined)
(label rjspayu already defined)
(label rjsprni already defined)
(label rjsprtx already defined)
(label rjsprls already defined)
(label rjsprf already defined)
(label rjsprey4 already defined)
(label rjsprem already defined)
(label rjsprby4 already defined)
(label rjsprbm already defined)
(label rjspart already defined)
(label rjsaccs already defined)
(label rjstypeb already defined)
(label rjstime already defined)
(label rjshrlk already defined)
(label rjshrs already defined)
(label rjssize already defined)
(label rjsboss already defined)
(label rpaylyg already defined)
(label rpaylyw already defined)
(label rpayly already defined)
(label rjbbgly1 already defined)
(label rjbbgy41 already defined)
(label rjbbgm1 already defined)
(label rjbbgd1 already defined)
(label rpaysg already defined)
(label rpaysw already defined)
(label rpays already defined)
(label rpayck1 already defined)
(label rjbwkhrh already defined)
(label rjbwkhrg already defined)
(label rjbwkhrf already defined)
(label rjbwkhre already defined)
(label rjbwkhrd already defined)
(label rjbwkhrc already defined)
(label rjbwkhrb already defined)
(label rjbwkhra already defined)
(label rjbtime already defined)
(label rjbpenm already defined)
(label rjbpen already defined)
(label rjbopps already defined)
(label rtuin1 already defined)
(label rtujbpl already defined)
(label rjbrise already defined)
(label rjbong already defined)
(label rjbonam already defined)
(label rjbonus already defined)
(label rjbperfp already defined)
(label rovtrest already defined)
(label rovtrate already defined)
(label rbasrest already defined)
(label rbasrate already defined)
(label rextrest already defined)
(label rextrate already defined)
(label rovtpay already defined)
(label rpaytyp already defined)
(label rpaydf8 already defined)
(label rpaydf9 already defined)
(label rpaydf7 already defined)
(label rpaydf6 already defined)
(label rpaydf5 already defined)
(label rpaydf4 already defined)
(label rpaydf3 already defined)
(label rpaydf2 already defined)
(label rpaydf1 already defined)
(label rpayug already defined)
(label rpayuw already defined)
(label rpayu already defined)
(label rpayusl already defined)
(label rpayslp already defined)
(label rpywftcw already defined)
(label rpywftc already defined)
(label rpytc already defined)
(label rpaynw already defined)
(label rpaynl already defined)
(label rpaygw already defined)
(label rpaygl already defined)
(label rjbsat already defined)
(label rjbsat7 already defined)
(label rjbsat6 already defined)
(label rjbsat4 already defined)
(label rjbsat2 already defined)
(label rjbttwm already defined)
(label rjbttwt already defined)
(label rjbpl already defined)
(label rjbhrlk already defined)
(label rjbotpd already defined)
(label rjbot already defined)
(label rjbhrs already defined)
(label rjbsize already defined)
(label rjbsizep already defined)
(label rjbck11 already defined)
(label rjbsect already defined)
(label rjbsectp already defined)
(label rjbck10 already defined)
(label rjbmngr already defined)
(label rjbmngp already defined)
(label rjbck9 already defined)
(label rjbcspl already defined)
(label rjbchgly already defined)
(label rjbchgy4 already defined)
(label rjbchgm already defined)
(label rjbchgd already defined)
(label rjbprom already defined)
(label rjbck8 already defined)
(label rjbsemp already defined)
(label rjbsempr already defined)
(label rjbsempp already defined)
(label rjbck7 already defined)
(label rjbempr already defined)
(label rjbck6 already defined)
(label rjbempp already defined)
(label rjbck5 already defined)
(label rjbsicr already defined)
(label rjbck4 already defined)
(label rjbsic92 already defined)
(label rjbsicp already defined)
(label rjbck3 already defined)
(label rjbsocr already defined)
(label rjbck2 already defined)
(label rjbsoc00 already defined)
(label rjbsoc already defined)
(label rjbsocp already defined)
(label rjbck1 already defined)
(label rjbterm2 already defined)
(label rjbterm1 already defined)
(label rjboffy already defined)
(label rjboff already defined)
(label rjbhas already defined)
(label rpe0m already defined)
(label rpe0h already defined)
(label rivme already defined)
(label rivmd already defined)
(label rivmc already defined)
(label rivmb already defined)
(label rivma already defined)
(label raidhrs already defined)
(label raidhu2 already defined)
(label raidhu1 already defined)
(label rnaidxhh already defined)
(label raidxhh already defined)
(label raidhuc already defined)
(label raidhub already defined)
(label raidhua already defined)
(label raidhh already defined)
(label rspinhh already defined)
(label rncigs already defined)
(label rsmoker already defined)
(label rhlckhn already defined)
(label rhlckh already defined)
(label rhlckgn already defined)
(label rhlckg already defined)
(label rhlckfn already defined)
(label rhlckf already defined)
(label rhlckin already defined)
(label rhlcki already defined)
(label rhlcken already defined)
(label rhlcke already defined)
(label rhlckdn already defined)
(label rhlckd already defined)
(label rhlckcn already defined)
(label rhlckc already defined)
(label rhlckbn already defined)
(label rhlckb already defined)
(label rhlckan already defined)
(label rhlcka already defined)
(label rhlck already defined)
(label rhlcvrl already defined)
(label rhlcvrh already defined)
(label rhlcvr already defined)
(label rhospnhs already defined)
(label rhospch already defined)
(label rhospd already defined)
(label rhosp already defined)
(label rnxdts already defined)
(label rxdts already defined)
(label rhl2hop already defined)
(label rhl2gp already defined)
(label radlfd already defined)
(label radlf already defined)
(label radled already defined)
(label radle already defined)
(label radldd already defined)
(label radld already defined)
(label radlcd already defined)
(label radlc already defined)
(label radlbd already defined)
(label radlb already defined)
(label radlad already defined)
(label radla already defined)
(label rhliv65 already defined)
(label rhlltwa already defined)
(label rhlendw already defined)
(label rhlltw already defined)
(label rhllte already defined)
(label rhlltd already defined)
(label rhlltc already defined)
(label rhlltb already defined)
(label rhllta already defined)
(label rhllt already defined)
(label rhlprbm already defined)
(label rhlprbo already defined)
(label rhlprbn already defined)
(label rhlprbl already defined)
(label rhlprbk already defined)
(label rhlprbj already defined)
(label rhlprbi already defined)
(label rhlprbh already defined)
(label rhlprbg already defined)
(label rhlprbf already defined)
(label rhlprbe already defined)
(label rhlprbd already defined)
(label rhlprbc already defined)
(label rhlprbb already defined)
(label rhlprba already defined)
(label rhlprb already defined)
(label rhldsbl1 already defined)
(label rpm0m already defined)
(label rpm0h already defined)
(label rivde already defined)
(label rivdd already defined)
(label rivdc already defined)
(label rivdb already defined)
(label rivda already defined)
(label rmamabrn already defined)
(label rmapabrn already defined)
(label rpamabrn already defined)
(label rpapabrn already defined)
(label rmabrn already defined)
(label rpabrn already defined)
(label rocfut90 already defined)
(label rocfut00 already defined)
(label rfednt2 already defined)
(label rfednt1 already defined)
(label rfedlik already defined)
(label rfedtyp already defined)
(label rfedasp already defined)
(label redasp already defined)
(label rinfted already defined)
(label rscnow2 already defined)
(label raglt20 already defined)
(label rwlshue already defined)
(label rwlshud already defined)
(label rwlshuc already defined)
(label rwlshub already defined)
(label rwlshua already defined)
(label rwlshe already defined)
(label rwlshd already defined)
(label rwlshc already defined)
(label rwlshb already defined)
(label rwlsha already defined)
(label rmabwnly already defined)
(label rmabwly already defined)
(label rbirhh already defined)
(label rnrpxpm2 already defined)
(label rnrpxpm1 already defined)
(label rnrptim already defined)
(label rnrpart already defined)
(label rivlpar already defined)
(label rqfxn already defined)
(label rqfxm already defined)
(label rqfxl already defined)
(label rqfxk already defined)
(label rqfxr already defined)
(label rqfxq already defined)
(label rqfxp already defined)
(label rqfxo already defined)
(label rqfxh already defined)
(label rqfxg already defined)
(label rqfxf already defined)
(label rqfxe already defined)
(label rqfxd already defined)
(label rqfxc already defined)
(label rqfx already defined)
(label rnqfexi already defined)
(label rqfedxi already defined)
(label rnqfexh already defined)
(label rqfedxh already defined)
(label rnqfexg already defined)
(label rqfedxg already defined)
(label rnqfexo already defined)
(label rqfedxo already defined)
(label rnqfexn already defined)
(label rqfedxn already defined)
(label rnqfexm already defined)
(label rqfedxm already defined)
(label rnqfexl already defined)
(label rqfedxl already defined)
(label rnqfexb already defined)
(label rqfedxb already defined)
(label rnqfexa already defined)
(label rqfedxa already defined)
(label rqfedx already defined)
(label rqfrec already defined)
(label rtru3 already defined)
(label rtrwhye3 already defined)
(label rtrwhyd3 already defined)
(label rtrwhyc3 already defined)
(label rtrwhyb3 already defined)
(label rtrwhya3 already defined)
(label rtrplce3 already defined)
(label rtrmore2 already defined)
(label rtru2 already defined)
(label rtrwhye2 already defined)
(label rtrwhyd2 already defined)
(label rtrwhyc2 already defined)
(label rtrwhyb2 already defined)
(label rtrwhya2 already defined)
(label rtrplce2 already defined)
(label rtrmore1 already defined)
(label rtru1 already defined)
(label rtrwhye1 already defined)
(label rtrwhyd1 already defined)
(label rtrwhyc1 already defined)
(label rtrwhyb1 already defined)
(label rtrwhya1 already defined)
(label rtrplce1 already defined)
(label rntrain already defined)
(label rtrain already defined)
(label rnqfeds already defined)
(label rqfeds already defined)
(label rnqfedr already defined)
(label rqfedr already defined)
(label rnqfedq already defined)
(label rqfedq already defined)
(label rnqfedp already defined)
(label rqfedp already defined)
(label rnqfedo already defined)
(label rqfedo already defined)
(label rnqfedn already defined)
(label rqfedn already defined)
(label rnqfedm already defined)
(label rqfedm already defined)
(label rnqfedl already defined)
(label rqfedl already defined)
(label rnqfedk already defined)
(label rqfedk already defined)
(label rnqfedu already defined)
(label rqfedu already defined)
(label rnqfedt already defined)
(label rqfedt already defined)
(label rnqfedj already defined)
(label rqfedj already defined)
(label rnqfedi already defined)
(label rqfedi already defined)
(label rnqfedh already defined)
(label rqfedh already defined)
(label rnqfedg already defined)
(label rqfedg already defined)
(label rnqfedf already defined)
(label rqfedf already defined)
(label rnqfede already defined)
(label rqfede already defined)
(label rnqfedd already defined)
(label rqfedd already defined)
(label rnqfedc already defined)
(label rqfedc already defined)
(label rnqfedb already defined)
(label rqfedb already defined)
(label rnqfeda already defined)
(label rqfeda already defined)
(label rqfed already defined)
(label rqfn already defined)
(label rqfm already defined)
(label rqfl already defined)
(label rqfk already defined)
(label rqfj already defined)
(label rqfi already defined)
(label rqfh already defined)
(label rqfg already defined)
(label rqff already defined)
(label rqfe already defined)
(label rqfd already defined)
(label rqfc already defined)
(label rqfb already defined)
(label rqfa already defined)
(label rqfhas already defined)
(label rfeend already defined)
(label rfenow already defined)
(label rfetype already defined)
(label rscnow already defined)
(label rsctype already defined)
(label rscend already defined)
(label rschool already defined)
(label rch1by already defined)
(label rch1bm already defined)
(label rlprnt already defined)
(label rlmar1y already defined)
(label rlmar1m already defined)
(label rnmar already defined)
(label rlcoh already defined)
(label rmamngr already defined)
(label rmaboss already defined)
(label rmasemp already defined)
(label rmasoc00 already defined)
(label rmasoc already defined)
(label rmaju already defined)
(label rpamngr already defined)
(label rpaboss already defined)
(label rpasemp already defined)
(label rpasoc00 already defined)
(label rpasoc already defined)
(label rpaju already defined)
(label rracel already defined)
(label rnatidh already defined)
(label rnatida already defined)
(label rnatide already defined)
(label rnatidg already defined)
(label rnatidf already defined)
(label rnatidb already defined)
(label rcitzn2 already defined)
(label rcitzn1 already defined)
(label ryr2uk4 already defined)
(label rplbornc already defined)
(label rplbornd already defined)
(label redenne3 already defined)
(label redeny3 already defined)
(label redenm3 already defined)
(label redbgy3 already defined)
(label redbgm3 already defined)
(label redblyr3 already defined)
(label redtype3 already defined)
(label redmore2 already defined)
(label redenne2 already defined)
(label redeny2 already defined)
(label redenm2 already defined)
(label redbgy2 already defined)
(label redbgm2 already defined)
(label redblyr2 already defined)
(label redtype2 already defined)
(label redmore1 already defined)
(label redenne1 already defined)
(label redeny1 already defined)
(label redenm1 already defined)
(label redbgy1 already defined)
(label redbgm1 already defined)
(label redblyr1 already defined)
(label redtype1 already defined)
(label redlyr already defined)
(label rjbstat already defined)
(label rmlchy4 already defined)
(label rmlchm already defined)
(label rmlchng already defined)
(label rmlstat already defined)
(label rsex already defined)
(label rdoby already defined)
(label rdobm already defined)
(label rmovy2 already defined)
(label rmovy1 already defined)
(label rplnowy4 already defined)
(label rplnowm already defined)
(label rplnew already defined)
(label rxpmove already defined)
(label rlkmovy already defined)
(label rlkmove already defined)
(label rlknbrd already defined)
(label rivsoim already defined)
(label rivsoih already defined)
(label rivstat2 already defined)
(label rivlyr already defined)
(label rdoiy4 already defined)
(label rdoim already defined)
(label rdoid already defined)

. 

. /*DATA CLEAN UP AND PREPARATION FOR ANALYSIS*/
. 
. drop ocim* fut* ql* nati* ed* fthh* fimn*i  fimnsel prf1* prfirn prfitb rtfnd* rdsbn16-rdsbn25 iv* nqf* hlp* adl* jbst1* jben* satinv ptrt5* svack* trwhy* aid* lwsen* lwss* jss* jsen*
>  lwst* lwen* lwsd* lwdn* rtrly* rtlat* rtpro* rtcon*

. 
. ***set up
. gen year = srcwave + 1990

. gen cpiyear = year

. replace pid = id if year == 2006
(15392 real changes made)

. sort pid year

. drop if year == 1990
(14419 observations deleted)

. 
. ***Demographics
. *age
. drop if age < 21
(20927 observations deleted)

. *gender
. mvdecode sex, mv(-7)
         sex: 1944 missing values generated

. gen female = (sex == 2) if sex != .
(1944 missing values generated)

. drop sex hgsex ssup1

. *marital status
. mvdecode mlstat, mv(-9/-1)
      mlstat: 228 missing values generated

. gen married = (mlstat == 1 | mlstat == 6) if mlstat != .
(228 missing values generated)

. drop mastat

. *ethnicity
. mvdecode race, mv(-9/-2)
        race: 111401 missing values generated

. gen black = inrange(race, 2, 4) if race != .
(195588 missing values generated)

. gen asian = inrange(race, 5, 8) if race != .
(195588 missing values generated)

. mvdecode racel, mv(-9/-1)
       racel: 68901 missing values generated

. replace black = inrange(racel, 14, 16) if racel != .
(15286 real changes made)

. replace asian = inrange(racel, 10, 13) if racel != .
(15286 real changes made)

. /*race coded only for the first time person was interviewed*/
. by pid: replace black = black[1] if black == .
(156365 real changes made)

. by pid: replace asian = asian[1] if asian == .
(156365 real changes made)

. drop race racel

. *number of dependent children
. gen nokids = (nchild == 0) if nchild != .

. *where they live
. mvdecode region region2, mv(-9)
      region: 1150 missing values generated
     region2: 1370 missing values generated

. mvdecode region2, mv(13) //remove channel islands
     region2: 12 missing values generated

. decode region2, gen(regname)

. gen London = inrange(region, 1, 2) if region != .
(1150 missing values generated)

. gen Wales = region == 17 if region != .
(1150 missing values generated)

. gen Scotland = region == 18 if region != .
(1150 missing values generated)

. gen NIrl = region == 19 if region != .
(1150 missing values generated)

. global regions London Wales Scotland NIrl

. *place of birth
. mvdecode plbornc, mv(-9,-7)
     plbornc: 8125 missing values generated

. gen bornAway = plbornc != -8 if plbornc != .
(8125 missing values generated)

. mvdecode plbornd, mv(-9/0)
     plbornd: 196161 missing values generated

. sort pid year

. by pid: replace bornAway = bornAway[1] if bornAway[1] != .
(13335 real changes made)

. 
. ***education
. mvdecode isced, mv(-7,0)
       isced: 12142 missing values generated

. gen uni = isced > 5 if isced != .
(12142 missing values generated)

. tab isced, gen(educ)

      isced levels |      Freq.     Percent        Cum.
-------------------+-----------------------------------
           primary |     57,390       27.87       27.87
     low secondary |      3,686        1.79       29.66
    3c:low sec-voc |     58,879       28.59       58.25
    3a:hisec-mivoc |     21,320       10.35       68.60
     5b:higher voc |     38,494       18.69       87.30
   5a:first degree |     20,881       10.14       97.44
   6:higher degree |      5,277        2.56      100.00
-------------------+-----------------------------------
             Total |    205,927      100.00

. recode isced (1 = 6) (6 = 16) (7 = 19) (5 = 15) (4 = 13) (3 = 11) (2 = 10), gen(edyears)
(205927 differences between isced and edyears)

. 
. 
. ***labor force status and employment
. drop nemst

. mvdecode jbstat, mv(-9/-1)
      jbstat: 411 missing values generated

. gen inLF = inrange(jbstat, 1, 3) | jbstat == 9 if jbstat != .
(411 missing values generated)

. gen employee = jbstat == 2 if jbstat != . & inLF == 1
(81576 missing values generated)

. gen selfemp = jbstat == 1 if jbstat != . & inLF == 1
(81576 missing values generated)

. gen unemp = jbstat == 3 if jbstat != . & inLF == 1
(81576 missing values generated)

. gen retired = jbstat == 4 if jbstat != . 
(411 missing values generated)

. by pid: gen newSelfemp = (selfemp == 1 & selfemp[_n-2] == 0) if selfemp != . & selfemp[_n-2] != .
(121990 missing values generated)

. by pid: gen selfPersist = (selfemp == 1 & newSelfemp[_n-1] == 1) if selfemp != . & newSelfemp[_n-1] != .
(137684 missing values generated)

. by pid: gen selfDrop = (selfemp == 0 & newSelfemp[_n-1] == 1) if selfemp != . & newSelfemp[_n-1] != .
(137684 missing values generated)

. by pid: gen selfPersist2 = (selfemp == 1 & newSelfemp[_n-2] == 1) if selfemp != . & newSelfemp[_n-2] != .
(149617 missing values generated)

. by pid: gen selfDrop2 = (selfemp == 0 & newSelfemp[_n-2] == 1) if selfemp != . & newSelfemp[_n-2] != .
(149617 missing values generated)

. sort year

. by year: egen urate = mean(unemp)

. *self employment type
. mvdecode jsboss, mv(-9/-1)
      jsboss: 200489 missing values generated

. gen employer = jsboss == 1 if jsboss != . & selfemp == 1
(202284 missing values generated)

. gen ownaccount = jsboss == 2 if jsboss != . & selfemp == 1
(202284 missing values generated)

. sort pid year

. by pid: gen newBoss = (employer == 1 & employer[_n-2] == 0) if employer != . & employer[_n-2] != .
(208920 missing values generated)

. by pid: gen newOwn = (ownaccount == 1 & selfemp[_n-2] == 0) if ownaccount != . & selfemp[_n-2] != .
(206236 missing values generated)

. by pid: gen newFirm = (employer == 1 & selfemp[_n-2] == 0) if employer != . & selfemp[_n-2] != .
(206236 missing values generated)

. 
. *categorical variable (0, 1, 2, 3)
. gen workstat = 1 if unemp == 1
(210738 missing values generated)

. replace workstat = 2 if employee == 1
(112444 real changes made)

. replace workstat = 3 if selfemp == 1
(16516 real changes made)

. replace workstat = 4 if retired == 1
(48083 real changes made)

. *tenure
. sort pid year

. by pid: egen tenure_emp = sum(employee)

. by pid: egen tenure_self = sum(selfemp)

. mvdecode jbbgy, mv(-9/-1)
       jbbgy: 26506 missing values generated

. replace jbbgy = jbbgy + 1900
jbbgy was byte now int
(26193 real changes made)

. gen jobtenure = year - jbbgy
(191876 missing values generated)

. by pid: replace tenure_emp = tenure_emp + jobtenure[1] if employee[1] == 1
(101637 real changes made, 46610 to missing)

. by pid: replace tenure_self = tenure_self + jobtenure[1] if selfemp[1] == 1
(16163 real changes made, 16006 to missing)

. *industry
. mvdecode jbsic jbsic92, mv(-9/0)
       jbsic: 49850 missing values generated
     jbsic92: 50763 missing values generated

. gen industry = jbsic if jbsic != .
(149246 missing values generated)

. replace industry = jbsic92 if jbsic92 != .
(81387 real changes made)

. replace industry = floor(industry/1000)
(132031 real changes made)

. tab industry if industry != ., gen(ind)

   industry |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,784        2.11        2.11
          1 |      3,628        2.75        4.86
          2 |      7,636        5.78       10.64
          3 |      7,834        5.93       16.57
          4 |     10,444        7.91       24.48
          5 |     16,736       12.68       37.16
          6 |     17,250       13.07       50.22
          7 |     18,358       13.90       64.13
          8 |     25,119       19.03       83.15
          9 |     22,242       16.85      100.00
------------+-----------------------------------
      Total |    132,031      100.00

. 
. *parental history of employment
. mvdecode pasemp, mv(-9/-1)
      pasemp: 144800 missing values generated

. mvdecode masemp, mv(-9/-1)
      masemp: 154588 missing values generated

. gen f_selfemp = pasemp == 2 if pasemp != .
(198344 missing values generated)

. gen m_selfemp = masemp == 2 if masemp != .
(208132 missing values generated)

. sort pid year

. /*coded only for first responders*/
. by pid: replace f_selfemp = f_selfemp[1] if f_selfemp == .
(135676 real changes made)

. by pid: replace m_selfemp = m_selfemp[1] if m_selfemp == .
(66693 real changes made)

. *hours worked
. mvdecode jbhrs, mv(-9/-1)
       jbhrs: 102993 missing values generated

. gen hrs_emp = jbhrs if employee == 1
(107831 missing values generated)

. mvdecode jshrs, mv(-9/-1)
       jshrs: 202311 missing values generated

. gen hrs_self = jshrs if selfemp == 1
(203879 missing values generated)

. 
. gen hrs_wrkd = hrs_emp
(107831 missing values generated)

. replace hrs_wrkd = hrs_self if selfemp == 1
(14190 real changes made)

. 
. ***income
. *load CPI index from ONS
. merge m:1 cpiyear using uk_cpi

    Result                           # of obs.
    -----------------------------------------
    not matched                             8
        from master                         0  (_merge==1)
        from using                          8  (_merge==2)

    matched                           218,069  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(8 observations deleted)

. drop _merge

. 
. *correct for inflation
. global monetary fiyr* fimn* paygu paygl paygyr paynl pywftc payu payug extrate basrate ovtrate jbonam jsprf jsprof jspayu jspayg xpchc jupayx jupayl j2pay saved windf*y xpmeal xpleis 
>  windfy

. 
. foreach var of varlist $monetary {
  2.         mvdecode `var', mv(-9/-1)
  3.         replace `var' = `var' / (cpi/100)
  4. }
     fiyrdia: 29520 missing values generated
fiyrdia was long now double
(27841 real changes made)
     fiyrdb1: 131912 missing values generated
fiyrdb1 was byte now float
(11828 real changes made)
     fiyrdb2: 141293 missing values generated
fiyrdb2 was byte now float
(3420 real changes made)
     fiyrdb3: 143382 missing values generated
fiyrdb3 was byte now float
(1551 real changes made)
     fiyrdb4: 143926 missing values generated
fiyrdb4 was byte now float
(1068 real changes made)
     fiyrdb5: 144703 missing values generated
fiyrdb5 was byte now float
(371 real changes made)
     fiyrdb6: 136278 missing values generated
fiyrdb6 was byte now float
(7938 real changes made)
     fiyrdic: 7675 missing values generated
fiyrdic was long now double
(44623 real changes made)
       fiyrl: 10983 missing values generated
(121922 real changes made)
      fiyrnl: 8027 missing values generated
(152768 real changes made)
       fiyrp: 8027 missing values generated
(33910 real changes made)
       fiyrb: 8027 missing values generated
(106021 real changes made)
       fiyrt: 8027 missing values generated
(8590 real changes made)
       fiyri: 8027 missing values generated
(86693 real changes made)
        fiyr: 10983 missing values generated
(191108 real changes made)
     fiyrdii: 19215 missing values generated
fiyrdii was byte now float
(4138 real changes made)
fiyrli was byte now float
(24380 real changes made)
fiyrnli was byte now float
(31700 real changes made)
fiyrpi was byte now float
(3680 real changes made)
fiyrbi was byte now float
(19637 real changes made)
fiyrti was byte now float
(1242 real changes made)
fiyrii was byte now float
(13295 real changes made)
      fiyrdi: 2912 missing values generated
fiyrdi was byte now float
(70031 real changes made)
     fiyrdiu: 51419 missing values generated
fiyrdiu was byte now float
(3165 real changes made)
       fimnp: 8027 missing values generated
(33919 real changes made)
       fimnb: 8027 missing values generated
(103783 real changes made)
       fimnt: 8027 missing values generated
(6762 real changes made)
       fimnl: 5313 missing values generated
(118081 real changes made)
      fimnnl: 8027 missing values generated
(151438 real changes made)
        fimn: 5175 missing values generated
(195375 real changes made)
       paygu: 109030 missing values generated
(101956 real changes made)
       paygl: 119715 missing values generated
paygl was long now double
(91798 real changes made)
      paygyr: 11130 missing values generated
paygyr was long now double
(7219 real changes made)
       paynl: 121126 missing values generated
paynl was long now double
(90261 real changes made)
      pywftc: 129576 missing values generated
pywftc was int now float
(1078 real changes made)
        payu: 205786 missing values generated
payu was long now double
(11714 real changes made)
       payug: 205822 missing values generated
payug was byte now float
(11679 real changes made)
     extrate: 136676 missing values generated
(7689 real changes made)
     basrate: 119965 missing values generated
(22742 real changes made)
     ovtrate: 130950 missing values generated
(12862 real changes made)
      jbonam: 144037 missing values generated
jbonam was long now double
(19589 real changes made)
       jsprf: 211004 missing values generated
jsprf was long now double
(5867 real changes made)
      jsprof: 204181 missing values generated
(11843 real changes made)
      jspayu: 163731 missing values generated
jspayu was long now double
(1396 real changes made)
      jspayg: 214745 missing values generated
(3111 real changes made)
       xpchc: 212431 missing values generated
xpchc was int now float
(5231 real changes made)
      jupayx: 205972 missing values generated
jupayx was int now float
(11537 real changes made)
      jupayl: 204703 missing values generated
jupayl was int now float
(12739 real changes made)
       j2pay: 204550 missing values generated
j2pay was int now float
(11064 real changes made)
       saved: 143379 missing values generated
saved was int now float
(69605 real changes made)
     windfay: 162436 missing values generated
windfay was long now double
(2769 real changes made)
     windfby: 164001 missing values generated
windfby was long now double
(1250 real changes made)
     windfcy: 164408 missing values generated
windfcy was long now double
(876 real changes made)
     windfdy: 163855 missing values generated
windfdy was long now double
(1395 real changes made)
     windffy: 162420 missing values generated
windffy was long now double
(2718 real changes made)
     windfgy: 149887 missing values generated
windfgy was long now double
(14456 real changes made)
     windfhy: 161835 missing values generated
windfhy was long now double
(3278 real changes made)
      windfy: 5356 missing values generated
windfy was long now double
(3054 real changes made)
     windfiy: 7979 missing values generated
windfiy was int now float
(2257 real changes made)
      xpmeal: 8989 missing values generated
xpmeal was byte now float
(119976 real changes made)
      xpleis: 9252 missing values generated
xpleis was byte now float
(115589 real changes made)
(3054 real changes made)

. 
. **income from employment, self employment, unemployment
. *self employment
. 
. //jsprf for profit share, jspayg for usual self employed pay monthly
. replace jsprf = 0 if jsprf == . & selfemp == 1 & jspayg != .
(2577 real changes made)

. replace jspayg = 0 if jsprf != . & selfemp == 1 & jspayg == .
(6625 real changes made)

. gen hwage_self = ((jsprf/52) + (jspayg/4.3))/hrs_self
(209096 missing values generated)

. gen inc_self = jsprf + jspayg*12 //annual income
(208867 missing values generated)

. gen inc_employer = inc_self if employer == 1
(215615 missing values generated)

. gen inc_own = inc_self if ownaccount == 1
(211331 missing values generated)

. 
. *employment
. 
. //paygu for gross pay per month
. gen hwage_emp = paygu/4.3/hrs_emp
(114232 missing values generated)

. gen inc_emp = paygu*12
(109030 missing values generated)

. 
. ***retirement
. *health
. mvdecode hllt, mv(-9/-1)
        hllt: 74 missing values generated

. gen health_limit = (hllt == 1) if hllt != .
(28851 missing values generated)

. *age of retirement
. mvdecode agexrt, mv(-9/-1)
      agexrt: 26144 missing values generated

. *pensions are fiyrp fimnp (annual/monthly)
. sort pid year

. by pid: gen pensionUp = 0

. by pid: replace pensionUp = 1 if fiyrp[_n-1] == 0 & fiyrp[_n] > 0 & fiyrp != .
(3684 real changes made)

. by pid: replace pensionUp = 1 if fiyrp[1] > 0 & fiyrp[1] != . & _n == 1
(3144 real changes made)

. by pid: egen pensionCheck = sum(pensionUp)

. gen willPensionUp = pensionCheck > 0 if pensionCheck != .

. gen retirYear = year if pensionUp == 1
(211241 missing values generated)

. by pid: egen firstRetired = min(retirYear)
(160636 missing values generated)

. gen hasRetired = 0

. replace hasRetired = 1 if year >= firstRetired & firstRetired != .
(41296 real changes made)

. 
. gen newretir = 0

. by pid: replace newretir = 1 if retired == 1 & retired[_n-1] == 0
(5034 real changes made)

. 
. gen newretirB = 0

. by pid: replace newretirB = 1 if hasRetired == 1 & hasRetired[_n-1] == 0
(2516 real changes made)

. 
. *use past industry
. foreach var of varlist ind* {
  2.         by pid: replace `var' = `var'[_n-1] if retired == 1 & `var' == .
  3. }
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)
(9696 real changes made)

. 
. 
. ***windfall income
. 
. mvdecode windf, mv(-9/-1)
       windf: 9809 missing values generated

. gen hadWindfall = (windf == 1) if windf != .
(54097 missing values generated)

. global windY windf*y

. 
. /*want to turn missing values to zero to allow summations*/
. mvencode $windY, mv(-1)
     windfay: 215135 missing values recoded
     windfby: 216700 missing values recoded
     windfcy: 217107 missing values recoded
     windfdy: 216554 missing values recoded
     windffy: 215119 missing values recoded
     windfgy: 202586 missing values recoded
     windfhy: 214534 missing values recoded
      windfy: 215014 missing values recoded
     windfiy: 215812 missing values recoded

. foreach var of varlist $windY {
  2.         replace `var' = 0 if `var' == -1
  3.         gen has_`var' = `var' > 0
  4. }
(215135 real changes made)
(216700 real changes made)
(217107 real changes made)
(216554 real changes made)
(215119 real changes made)
(202586 real changes made)
(214534 real changes made)
(215014 real changes made)
(215812 real changes made)

. gen windfall = windfay + windfby + windfcy + windfdy + windffy + windfgy + windfhy + windfiy + windfy

. /*correcting for years where no windfall data was collected*/
. replace windfall = . if inrange(year, 1992,1995) | year == 1997
(44977 real changes made, 44977 to missing)

. 
. 
. *log incomess
. foreach var of varlist inc_* windfall {
  2.         cap gen ln_`var' = ln(`var'+1) if `var' != .
  3. }

. 
. foreach var of varlist windf*y {
  2.         gen ln_`var' = ln(`var'+1)
  3.         gen k_`var' = `var'/1000
  4.         gen `var'5 = (`var' > 5000) if `var' != .
  5. }

. 
. 
. global personal L.married black asian female ind2-ind10 L.London L.Wales L.Scotland L.NIrl L.m_selfemp L.f_selfemp L.health_limit bornAway L.nokids

. 
. ***logs and other variables needed
. gen ln_schooling = ln(edyears)
(12142 missing values generated)

. gen ln_tenure_emp = ln(tenure_emp)
(109974 missing values generated)

. gen ln_tenure_self = ln(tenure_self)
(195796 missing values generated)

. gen ln_tenure_diff = ln_tenure_self - ln_tenure_emp
(201912 missing values generated)

. gen ln_hrs = ln(hrs_wrkd)
(94920 missing values generated)

. gen ln_age = ln(age)

. gen ln_pension = ln(fiyrp)
(181704 missing values generated)

. gen k_windfall = windfall/1000
(44977 missing values generated)

. gen k_pension = fiyrp/1000
(8027 missing values generated)

. gen windfall5 = (windfall > 5000) if windfall != .
(44977 missing values generated)

. gen windfall0 = (windfall <= 1000) if windfall != .
(44977 missing values generated)

. sort pid year

. by pid: egen k_avgpension = mean(k_pension) if year >= firstRetired
(176773 missing values generated)

. by pid: replace k_avgpension = 0 if year < firstRetired
(176773 real changes made)

. 
. save bhps_clean.dta, replace
(note: file bhps_clean.dta not found)
file bhps_clean.dta saved

. 
. /*DATASET IS NOW READY FOR ANALYSIS*/
. 
. xtset pid year 
       panel variable:  pid (unbalanced)
        time variable:  year, 1991 to 2008, but with gaps
                delta:  1 unit

. 
. /*DESCRIPTIVE STATS*/
. 
. sum age married black asian female edyears nchild bornAway

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |    218069    47.90686    17.37119         21        101
     married |    217841     .587814    .4922294          0          1
       black |    194132    .0068459    .0824562          0          1
       asian |    194132    .0119146     .108502          0          1
      female |    216125    .5400254    .4983965          0          1
-------------+--------------------------------------------------------
     edyears |    205927    11.25544    3.807893          6         19
      nchild |    218069    .5561176    .9627929          0          9
    bornAway |    214777    .0486179    .2150683          0          1

. sum age married black asian female edyears nchild bornAway if employee == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |    112444    39.98377    11.54904         21         95
     married |    112322    .6079575    .4882083          0          1
       black |     97034     .007183    .0844484          0          1
       asian |     97034    .0116454    .1072842          0          1
      female |    111351    .5097215    .4999077          0          1
-------------+--------------------------------------------------------
     edyears |    106456    12.30395    3.458229          6         19
      nchild |    112444     .658719    .9625667          0          9
    bornAway |    110945    .0446888    .2066207          0          1

. sum age married black asian female edyears nchild bornAway if unemp == 1 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |      7331    37.91979     12.4527         21         87
     married |      7319    .3702692    .4829097          0          1
       black |      6026    .0177564    .1320757          0          1
       asian |      6026    .0272154     .162724          0          1
      female |      7287    .3607795    .4802596          0          1
-------------+--------------------------------------------------------
     edyears |      6936     10.4073    3.764065          6         19
      nchild |      7331    .6831264      1.1085          0          8
    bornAway |      7234    .0608239    .2390235          0          1

. sum age married black asian female edyears nchild bornAway if selfemp == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |     16516    44.90524    11.80181         21         91
     married |     16493    .6922331    .4615835          0          1
       black |     14952    .0078919    .0884882          0          1
       asian |     14952    .0177234    .1319486          0          1
      female |     16335    .2637282    .4406671          0          1
-------------+--------------------------------------------------------
     edyears |     15191    12.05911    3.496701          6         19
      nchild |     16516    .7460644    1.078819          0          8
    bornAway |     16062    .0664301    .2490401          0          1

. sum age married black asian female edyears nchild bornAway if retired == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |     48083    71.67643    8.495988         26        101
     married |     48055    .5592758    .4964791          0          1
       black |     47154    .0027993    .0528352          0          1
       asian |     47154    .0031387    .0559363          0          1
      female |     47705    .5768578    .4940627          0          1
-------------+--------------------------------------------------------
     edyears |     45906    9.431926    3.838301          6         19
      nchild |     48083    .0070711    .1116704          0          4
    bornAway |     47676    .0412157    .1987908          0          1

. sum age married black asian female edyears nchild bornAway if newSelfemp == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |      2827    41.88645    11.10623         23         84
     married |      2825     .640354    .4799816          0          1
       black |      2474    .0125303    .1112579          0          1
       asian |      2474    .0210186    .1434752          0          1
      female |      2777    .3154483    .4647779          0          1
-------------+--------------------------------------------------------
     edyears |      2621    12.62381      3.3955          6         19
      nchild |      2827    .7806862    1.082255          0          7
    bornAway |      2797    .0750804    .2635682          0          1

. 
. sum fiyr health_limit *_selfemp London Scotland

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        fiyr |    207086     14145.6    14232.18          0    1231751
health_limit |    189218    .1818062    .3856857          0          1
   f_selfemp |    155401    .1761829    .3809769          0          1
   m_selfemp |     76630    .0969203    .2958511          0          1
      London |    216919    .0664672    .2490976          0          1
-------------+--------------------------------------------------------
    Scotland |    216919    .1552792    .3621714          0          1

. sum fiyr health_limit *_selfemp London Scotland if employee == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        fiyr |    106921     18340.6    14404.63          0    1231751
health_limit |     97509    .0691116    .2536451          0          1
   f_selfemp |     78157    .1614443    .3679426          0          1
   m_selfemp |     46638    .0752605    .2638141          0          1
      London |    111683    .0704136    .2558439          0          1
-------------+--------------------------------------------------------
    Scotland |    111683    .1579291    .3646762          0          1

. sum fiyr health_limit *_selfemp London Scotland if unemp == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        fiyr |      7017    7981.178    8840.813          0     218805
health_limit |      6451    .1810572    .3850954          0          1
   f_selfemp |      4265    .1444314    .3515679          0          1
   m_selfemp |      2280    .0815789    .2737822          0          1
      London |      7315    .0880383    .2833699          0          1
-------------+--------------------------------------------------------
    Scotland |      7315    .1639098     .370219          0          1

. sum fiyr health_limit *_selfemp London Scotland if selfemp == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        fiyr |     15180    18925.72    24193.25          0   754377.7
health_limit |     14440    .0765928    .2659535          0          1
   f_selfemp |     12443    .2893997     .453502          0          1
   m_selfemp |      6499    .1558701    .3627601          0          1
      London |     16433    .0805696    .2721813          0          1
-------------+--------------------------------------------------------
    Scotland |     16433    .1395972    .3465791          0          1

. sum fiyr health_limit *_selfemp London Scotland if retired == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        fiyr |     46294    9026.172      8258.7          0   546493.9
health_limit |     41437     .335811    .4722789          0          1
   f_selfemp |     38521    .1682719    .3741124          0          1
   m_selfemp |     10355    .1681313    .3740009          0          1
      London |     47969    .0522629    .2225591          0          1
-------------+--------------------------------------------------------
    Scotland |     47969    .1579353    .3646842          0          1

. sum fiyr health_limit *_selfemp London Scotland if newSelfemp == 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        fiyr |      2597    18054.78    19552.91          0   310459.7
health_limit |      2448    .0620915     .241371          0          1
   f_selfemp |      2035    .2181818     .413113          0          1
   m_selfemp |      1140    .1184211    .3232478          0          1
      London |      2807    .0979694    .2973262          0          1
-------------+--------------------------------------------------------
    Scotland |      2807    .1442822    .3514382          0          1

. 
. gen workstat2 = L2.workstat
(79594 missing values generated)

. 
. tab workstat2 workstat , row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |                  workstat
 workstat2 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |     1,525      1,836        312        328 |     4,001 
           |     38.12      45.89       7.80       8.20 |    100.00 
-----------+--------------------------------------------+----------
         2 |     1,659     75,264      2,427      2,662 |    82,012 
           |      2.02      91.77       2.96       3.25 |    100.00 
-----------+--------------------------------------------+----------
         3 |       204      1,980      9,421        469 |    12,074 
           |      1.69      16.40      78.03       3.88 |    100.00 
-----------+--------------------------------------------+----------
         4 |        70        448         90     32,675 |    33,283 
           |      0.21       1.35       0.27      98.17 |    100.00 
-----------+--------------------------------------------+----------
     Total |     3,458     79,528     12,250     36,134 |   131,370 
           |      2.63      60.54       9.32      27.51 |    100.00 


. 
. sum newSelfemp

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |     96079    .0294237    .1689919          0          1

. sum newSelfemp if L.windfall > 0 & L.windfall != .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |     12852    .0306567    .1723925          0          1

. sum newSelfemp if inrange(L.windfall, 0.01, 1000) & L.windfall != .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |      7784     .024409    .1543253          0          1

. sum newSelfemp if inrange(L.windfall, 1000, 5000) & L.windfall != .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |      2665    .0382739    .1918928          0          1

. sum newSelfemp if L.windfall > 5000 & L.windfall != .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |      2429     .042816    .2024837          0          1

. 
. sum newSelfemp if L.pensionUp == 1 & L.pensionUp != .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |       894    .0693512    .2541927          0          1

. sum newSelfemp if L.pensionUp == 0 & L.pensionUp != .

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  newSelfemp |     93785      .02864    .1667934          0          1

. 
. **selfemployment around retirement
. 
. by pid: gen jbstat1 = jbstat[_n-1]
(28917 missing values generated)

. by pid: gen jbstat2 = jbstat[_n-2]
(52687 missing values generated)

. by pid: gen jbstat3 = jbstat[_n-3]
(73785 missing values generated)

. 
. tab jbstat3 if pensionUp == 1 & newretir != .

    jbstat3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        203        7.01        7.01
          2 |      1,397       48.24       55.25
          3 |         56        1.93       57.18
          4 |        894       30.87       88.05
          5 |         14        0.48       88.54
          6 |        152        5.25       93.78
          7 |          4        0.14       93.92
          8 |        165        5.70       99.62
          9 |          1        0.03       99.65
         10 |         10        0.35      100.00
------------+-----------------------------------
      Total |      2,896      100.00

. tab jbstat2 if pensionUp == 1 & newretir != .

    jbstat2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        218        6.71        6.71
          2 |      1,510       46.50       53.22
          3 |         61        1.88       55.10
          4 |      1,072       33.02       88.11
          5 |         13        0.40       88.51
          6 |        168        5.17       93.69
          7 |         10        0.31       93.99
          8 |        182        5.61       99.60
         10 |         13        0.40      100.00
------------+-----------------------------------
      Total |      3,247      100.00

. tab jbstat1 if pensionUp == 1 & newretir != .

    jbstat1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        225        6.11        6.11
          2 |      1,364       37.05       43.16
          3 |         89        2.42       45.57
          4 |      1,516       41.17       86.75
          5 |         26        0.71       87.45
          6 |        173        4.70       92.15
          7 |         15        0.41       92.56
          8 |        250        6.79       99.35
          9 |          2        0.05       99.40
         10 |         22        0.60      100.00
------------+-----------------------------------
      Total |      3,682      100.00

. tab jbstat if pensionUp == 1 & newretir != .

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        299        4.38        4.38
        employed |      1,137       16.65       21.03
      unemployed |        151        2.21       23.24
         retired |      4,435       64.95       88.20
 maternity leave |        103        1.51       89.70
     family care |        255        3.73       93.44
ft studt, school |         80        1.17       94.61
lt sick, disabld |        334        4.89       99.50
 gvt trng scheme |          1        0.01       99.52
           other |         33        0.48      100.00
-----------------+-----------------------------------
           Total |      6,828      100.00

. tab jbstat if L.pensionUp == 1 & L.newretir != .

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        285        4.79        4.79
        employed |      1,006       16.89       21.68
      unemployed |         73        1.23       22.90
         retired |      3,947       66.27       89.17
 maternity leave |          2        0.03       89.20
     family care |        275        4.62       93.82
ft studt, school |         10        0.17       93.99
lt sick, disabld |        339        5.69       99.68
 gvt trng scheme |          3        0.05       99.73
           other |         16        0.27      100.00
-----------------+-----------------------------------
           Total |      5,956      100.00

. tab jbstat if L2.pensionUp == 1 & L2.newretir !=.

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        225        4.21        4.21
        employed |        858       16.05       20.25
      unemployed |         59        1.10       21.36
         retired |      3,651       68.28       89.64
 maternity leave |          1        0.02       89.66
     family care |        216        4.04       93.70
ft studt, school |         10        0.19       93.88
lt sick, disabld |        305        5.70       99.59
 gvt trng scheme |          1        0.02       99.61
           other |         21        0.39      100.00
-----------------+-----------------------------------
           Total |      5,347      100.00

. tab jbstat if L3.pensionUp == 1 & L2.newretir !=.

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        180        3.82        3.82
        employed |        724       15.38       19.21
      unemployed |         42        0.89       20.10
         retired |      3,302       70.15       90.25
 maternity leave |          6        0.13       90.38
     family care |        190        4.04       94.41
ft studt, school |          9        0.19       94.60
lt sick, disabld |        236        5.01       99.62
           other |         18        0.38      100.00
-----------------+-----------------------------------
           Total |      4,707      100.00

. 
. tab jbstat3 if newretirB == 1 & newretir != .

    jbstat3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        143        7.86        7.86
          2 |      1,141       62.73       70.59
          3 |         38        2.09       72.68
          4 |        304       16.71       89.39
          5 |          7        0.38       89.77
          6 |         89        4.89       94.67
          7 |          4        0.22       94.89
          8 |         87        4.78       99.67
         10 |          6        0.33      100.00
------------+-----------------------------------
      Total |      1,819      100.00

. tab jbstat2 if newretirB == 1 & newretir != .

    jbstat2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        158        7.60        7.60
          2 |      1,249       60.08       67.68
          3 |         41        1.97       69.65
          4 |        414       19.91       89.56
          5 |          8        0.38       89.95
          6 |         94        4.52       94.47
          7 |          4        0.19       94.66
          8 |        102        4.91       99.57
         10 |          9        0.43      100.00
------------+-----------------------------------
      Total |      2,079      100.00

. tab jbstat1 if newretirB == 1 & newretir != .

    jbstat1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        167        6.64        6.64
          2 |      1,115       44.33       50.97
          3 |         79        3.14       54.12
          4 |        819       32.56       86.68
          5 |         26        1.03       87.71
          6 |        107        4.25       91.97
          7 |         12        0.48       92.45
          8 |        171        6.80       99.24
         10 |         19        0.76      100.00
------------+-----------------------------------
      Total |      2,515      100.00

. tab jbstat if newretirB == 1 & newretir != .

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        169        6.72        6.72
        employed |        570       22.66       29.37
      unemployed |         83        3.30       32.67
         retired |      1,360       54.05       86.72
 maternity leave |          1        0.04       86.76
     family care |        133        5.29       92.05
ft studt, school |          8        0.32       92.37
lt sick, disabld |        174        6.92       99.28
 gvt trng scheme |          1        0.04       99.32
           other |         17        0.68      100.00
-----------------+-----------------------------------
           Total |      2,516      100.00

. tab jbstat if L.newretirB == 1 & L.newretir != .

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        169        7.62        7.62
        employed |        538       24.26       31.88
      unemployed |         37        1.67       33.54
         retired |      1,214       54.73       88.28
 maternity leave |          2        0.09       88.37
     family care |         94        4.24       92.61
ft studt, school |          5        0.23       92.83
lt sick, disabld |        148        6.67       99.50
 gvt trng scheme |          1        0.05       99.55
           other |         10        0.45      100.00
-----------------+-----------------------------------
           Total |      2,218      100.00

. tab jbstat if L2.newretirB == 1 & L2.newretir !=.

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        129        6.61        6.61
        employed |        455       23.32       29.93
      unemployed |         29        1.49       31.42
         retired |      1,099       56.33       87.75
 maternity leave |          1        0.05       87.80
     family care |         81        4.15       91.95
ft studt, school |          7        0.36       92.31
lt sick, disabld |        136        6.97       99.28
 gvt trng scheme |          1        0.05       99.33
           other |         13        0.67      100.00
-----------------+-----------------------------------
           Total |      1,951      100.00

. tab jbstat if L3.newretirB == 1 & L2.newretir !=.

current economic |
     activity    |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   self-employed |        102        6.04        6.04
        employed |        383       22.69       28.73
      unemployed |         22        1.30       30.04
         retired |        986       58.41       88.45
 maternity leave |          3        0.18       88.63
     family care |         70        4.15       92.77
ft studt, school |          5        0.30       93.07
lt sick, disabld |        104        6.16       99.23
           other |         13        0.77      100.00
-----------------+-----------------------------------
           Total |      1,688      100.00

. 
. /*RETIREMENT MODEL*/
. 
. 
. reg newSelfemp L.pensionUp L.k_pension L.ln_tenure_diff L.age L.edyears $personal , r

Linear regression                                      Number of obs =    3592
                                                       F( 27,  3564) =    3.38
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0236
                                                       Root MSE      =  .33514

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |   .1825038   .0781893     2.33   0.020     .0292034    .3358041
               |
     k_pension |
           L1. |   .0011517   .0026588     0.43   0.665    -.0040612    .0063647
               |
ln_tenure_diff |
           L1. |   .0181155   .0045326     4.00   0.000     .0092286    .0270023
               |
           age |
           L1. |  -.0000141   .0006708    -0.02   0.983    -.0013293    .0013012
               |
       edyears |
           L1. |  -.0034661   .0018005    -1.93   0.054    -.0069962    .0000641
               |
       married |
           L1. |  -.0056751   .0146897    -0.39   0.699    -.0344762    .0231261
               |
         black |  -.0182588    .045298    -0.40   0.687    -.1070714    .0705538
         asian |  -.0022684   .0540906    -0.04   0.967      -.10832    .1037832
        female |  -.0102553   .0123707    -0.83   0.407    -.0345097    .0139991
          ind2 |  -.0279905   .0525011    -0.53   0.594    -.1309258    .0749448
          ind3 |  -.0489913   .0430339    -1.14   0.255    -.1333649    .0353822
          ind4 |  -.0349632   .0441626    -0.79   0.429    -.1215497    .0516233
          ind5 |   .0145055   .0437301     0.33   0.740    -.0712329     .100244
          ind6 |   .0355526   .0428854     0.83   0.407    -.0485297     .119635
          ind7 |  -.0217713   .0417163    -0.52   0.602    -.1035615    .0600189
          ind8 |    .047309   .0426432     1.11   0.267    -.0362987    .1309166
          ind9 |   .0241511   .0429485     0.56   0.574     -.060055    .1083572
         ind10 |   .0436145   .0430058     1.01   0.311    -.0407039    .1279329
               |
        London |
           L1. |  -.0077603   .0191383    -0.41   0.685    -.0452833    .0297628
               |
         Wales |
           L1. |  -.0212902   .0272365    -0.78   0.434    -.0746909    .0321104
               |
      Scotland |
           L1. |   .0474635   .0237627     2.00   0.046     .0008736    .0940533
               |
          NIrl |
           L1. |   .0787282   .0856255     0.92   0.358    -.0891517     .246608
               |
     m_selfemp |
           L1. |  -.0047923   .0198746    -0.24   0.809     -.043759    .0341745
               |
     f_selfemp |
           L1. |  -.0114176   .0162931    -0.70   0.483    -.0433623    .0205271
               |
  health_limit |
           L1. |   .0169362   .0251023     0.67   0.500    -.0322801    .0661524
               |
      bornAway |   .0067534   .0298692     0.23   0.821    -.0518091    .0653159
               |
        nokids |
           L1. |  -.0005235   .0125472    -0.04   0.967    -.0251239    .0240769
               |
         _cons |   .1883969    .054433     3.46   0.001      .081674    .2951198
--------------------------------------------------------------------------------

. reg newSelfemp L.pensionUp L.k_avgpension $personal L.edyears L.ln_tenure_diff L.age L.k_pension, r

Linear regression                                      Number of obs =    3592
                                                       F( 28,  3563) =    3.29
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0243
                                                       Root MSE      =  .33506

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |   .1650869   .0766696     2.15   0.031     .0147662    .3154075
               |
  k_avgpension |
           L1. |   .0111203   .0080749     1.38   0.169    -.0047116    .0269522
               |
       married |
           L1. |  -.0062629   .0146903    -0.43   0.670    -.0350651    .0225392
               |
         black |  -.0172498   .0453131    -0.38   0.703    -.1060919    .0715924
         asian |  -.0012881   .0540712    -0.02   0.981    -.1073017    .1047256
        female |  -.0092873   .0123676    -0.75   0.453    -.0335355     .014961
          ind2 |  -.0275535   .0524583    -0.53   0.599    -.1304048    .0752978
          ind3 |  -.0483233   .0429838    -1.12   0.261    -.1325986    .0359519
          ind4 |  -.0345108    .044117    -0.78   0.434     -.121008    .0519863
          ind5 |   .0143997   .0436514     0.33   0.742    -.0711846    .0999839
          ind6 |   .0353593   .0428219     0.83   0.409    -.0485985    .1193171
          ind7 |  -.0218792   .0416662    -0.53   0.600    -.1035711    .0598127
          ind8 |   .0471259   .0425815     1.11   0.268    -.0363607    .1306126
          ind9 |    .023471   .0429008     0.55   0.584    -.0606416    .1075836
         ind10 |   .0435164   .0429572     1.01   0.311    -.0407068    .1277397
               |
        London |
           L1. |  -.0082517    .019155    -0.43   0.667    -.0458075    .0293041
               |
         Wales |
           L1. |  -.0202582   .0272313    -0.74   0.457    -.0736486    .0331323
               |
      Scotland |
           L1. |   .0478572   .0237662     2.01   0.044     .0012605    .0944539
               |
          NIrl |
           L1. |   .0786077   .0856222     0.92   0.359    -.0892658    .2464811
               |
     m_selfemp |
           L1. |  -.0044639   .0198411    -0.22   0.822    -.0433649    .0344372
               |
     f_selfemp |
           L1. |  -.0109025   .0162881    -0.67   0.503    -.0428375    .0210324
               |
  health_limit |
           L1. |   .0166849   .0250868     0.67   0.506     -.032501    .0658709
               |
      bornAway |    .007202   .0298693     0.24   0.809    -.0513606    .0657646
               |
        nokids |
           L1. |  -.0011647   .0125493    -0.09   0.926    -.0257693    .0234399
               |
       edyears |
           L1. |  -.0035572   .0017994    -1.98   0.048    -.0070852   -.0000292
               |
ln_tenure_diff |
           L1. |   .0179918    .004531     3.97   0.000     .0091083    .0268754
               |
           age |
           L1. |  -.0000931     .00067    -0.14   0.890    -.0014066    .0012205
               |
     k_pension |
           L1. |  -.0081158   .0071089    -1.14   0.254    -.0220538    .0058221
               |
         _cons |   .1923553   .0543558     3.54   0.000     .0857838    .2989269
--------------------------------------------------------------------------------

. probit newSelfemp L.pensionUp $personal L.edyears L.ln_tenure_diff L.age L.k_pension, r

Iteration 0:   log pseudolikelihood = -1397.4507  
Iteration 1:   log pseudolikelihood = -1355.3267  
Iteration 2:   log pseudolikelihood = -1354.8033  
Iteration 3:   log pseudolikelihood = -1354.8027  
Iteration 4:   log pseudolikelihood = -1354.8027  

Probit regression                                 Number of obs   =       3592
                                                  Wald chi2(27)   =      85.34
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -1354.8027                 Pseudo R2       =     0.0305

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |   .6262627   .2268063     2.76   0.006     .1817305    1.070795
               |
       married |
           L1. |  -.0308296   .0696642    -0.44   0.658    -.1673689    .1057098
               |
         black |   -.132435   .2760414    -0.48   0.631    -.6734663    .4085962
         asian |  -.0014104    .234933    -0.01   0.995    -.4618706    .4590497
        female |  -.0495103   .0587921    -0.84   0.400    -.1647408    .0657201
          ind2 |  -.1577735   .2750625    -0.57   0.566     -.696886     .381339
          ind3 |  -.3610425   .2272293    -1.59   0.112    -.8064037    .0843187
          ind4 |  -.2647175    .228104    -1.16   0.246    -.7117932    .1823582
          ind5 |   .0439783    .199032     0.22   0.825    -.3461173    .4340738
          ind6 |   .1487237   .1932054     0.77   0.441    -.2299518    .5273993
          ind7 |  -.1316096   .1955948    -0.67   0.501    -.5149684    .2517491
          ind8 |   .1972686   .1920302     1.03   0.304    -.1791037     .573641
          ind9 |   .1046387   .1963119     0.53   0.594    -.2801256    .4894029
         ind10 |   .1872133   .1941502     0.96   0.335     -.193314    .5677407
               |
        London |
           L1. |  -.0287774   .0980835    -0.29   0.769    -.2210176    .1634628
               |
         Wales |
           L1. |  -.1051356   .1420797    -0.74   0.459    -.3836067    .1733356
               |
      Scotland |
           L1. |   .2003302   .0936238     2.14   0.032     .0168309    .3838296
               |
          NIrl |
           L1. |   .2827076   .2821458     1.00   0.316    -.2702879    .8357031
               |
     m_selfemp |
           L1. |  -.0280603   .0935643    -0.30   0.764     -.211443    .1553223
               |
     f_selfemp |
           L1. |  -.0592727   .0777814    -0.76   0.446    -.2117215    .0931761
               |
  health_limit |
           L1. |   .0673894   .1059449     0.64   0.525    -.1402588    .2750377
               |
      bornAway |   .0204906   .1277459     0.16   0.873    -.2298867     .270868
               |
        nokids |
           L1. |   .0004193   .0600481     0.01   0.994    -.1172729    .1181115
               |
       edyears |
           L1. |  -.0163074   .0085406    -1.91   0.056    -.0330468    .0004319
               |
ln_tenure_diff |
           L1. |   .0868659   .0207737     4.18   0.000     .0461502    .1275815
               |
           age |
           L1. |    .000522   .0032352     0.16   0.872    -.0058189    .0068629
               |
     k_pension |
           L1. |   .0045628   .0102843     0.44   0.657    -.0155939    .0247196
               |
         _cons |  -.8668453   .2489035    -3.48   0.000    -1.354687   -.3790034
--------------------------------------------------------------------------------

. margins, dydx(L1.pensionUp L1.k_pension L1.ln_tenure_diff)

Average marginal effects                          Number of obs   =       3592
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.pensionUp L.ln_tenure_diff L.k_pension

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |   .1294609   .0467893     2.77   0.006     .0377555    .2211663
               |
ln_tenure_diff |
           L1. |   .0179569    .004298     4.18   0.000      .009533    .0263808
               |
     k_pension |
           L1. |   .0009432    .002126     0.44   0.657    -.0032236      .00511
--------------------------------------------------------------------------------

. probit newSelfemp L.pensionUp L.k_avgpension $personal L.edyears L.ln_tenure_diff L.age L.k_pension, r

Iteration 0:   log pseudolikelihood = -1397.4507  
Iteration 1:   log pseudolikelihood = -1354.3914  
Iteration 2:   log pseudolikelihood =  -1353.851  
Iteration 3:   log pseudolikelihood = -1353.8505  
Iteration 4:   log pseudolikelihood = -1353.8505  

Probit regression                                 Number of obs   =       3592
                                                  Wald chi2(28)   =      86.59
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -1353.8505                 Pseudo R2       =     0.0312

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |      .5588   .2273654     2.46   0.014      .113172    1.004428
               |
  k_avgpension |
           L1. |   .0399561   .0273524     1.46   0.144    -.0136535    .0935658
               |
       married |
           L1. |  -.0334341   .0697095    -0.48   0.631    -.1700623    .1031941
               |
         black |  -.1273643   .2761333    -0.46   0.645    -.6685756     .413847
         asian |    .003876   .2347405     0.02   0.987    -.4562068    .4639589
        female |  -.0446253   .0589104    -0.76   0.449    -.1600875    .0708369
          ind2 |  -.1562384   .2749825    -0.57   0.570    -.6951942    .3827174
          ind3 |  -.3574544   .2270807    -1.57   0.115    -.8025244    .0876156
          ind4 |  -.2619575   .2279874    -1.15   0.251    -.7088045    .1848895
          ind5 |   .0422857   .1987634     0.21   0.832    -.3472835    .4318548
          ind6 |   .1478786   .1929894     0.77   0.444    -.2303737     .526131
          ind7 |  -.1310577   .1954016    -0.67   0.502    -.5140377    .2519224
          ind8 |    .196541   .1918299     1.02   0.306    -.1794387    .5725207
          ind9 |   .1015935   .1961896     0.52   0.605     -.282931     .486118
         ind10 |   .1873634   .1939701     0.97   0.334     -.192811    .5675378
               |
        London |
           L1. |  -.0311988   .0982609    -0.32   0.751    -.2237866     .161389
               |
         Wales |
           L1. |  -.1004932   .1419887    -0.71   0.479    -.3787858    .1777995
               |
      Scotland |
           L1. |   .2021576    .093634     2.16   0.031     .0186384    .3856767
               |
          NIrl |
           L1. |   .2821254   .2821026     1.00   0.317    -.2707855    .8350362
               |
     m_selfemp |
           L1. |   -.027757   .0935279    -0.30   0.767    -.2110683    .1555544
               |
     f_selfemp |
           L1. |  -.0570786   .0778377    -0.73   0.463    -.2096376    .0954805
               |
  health_limit |
           L1. |   .0670579   .1058306     0.63   0.526    -.1403663     .274482
               |
      bornAway |   .0222936   .1277491     0.17   0.861    -.2280901    .2726773
               |
        nokids |
           L1. |  -.0017962   .0601072    -0.03   0.976    -.1196041    .1160117
               |
       edyears |
           L1. |  -.0167964   .0085523    -1.96   0.050    -.0335586   -.0000342
               |
ln_tenure_diff |
           L1. |   .0864349   .0208001     4.16   0.000     .0456674    .1272023
               |
           age |
           L1. |   .0001388   .0032413     0.04   0.966    -.0062141    .0064917
               |
     k_pension |
           L1. |  -.0288239   .0248097    -1.16   0.245      -.07745    .0198022
               |
         _cons |  -.8472437   .2489635    -3.40   0.001    -1.335203   -.3592842
--------------------------------------------------------------------------------

. margins, dydx(L1.pensionUp L1.k_pension L1.k_avgpension L1.ln_tenure_diff )

Average marginal effects                          Number of obs   =       3592
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.pensionUp L.k_avgpension L.ln_tenure_diff L.k_pension

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |   .1154317   .0468791     2.46   0.014     .0235504     .207313
               |
  k_avgpension |
           L1. |   .0082538    .005649     1.46   0.144    -.0028181    .0193256
               |
ln_tenure_diff |
           L1. |   .0178549   .0042998     4.15   0.000     .0094274    .0262824
               |
     k_pension |
           L1. |  -.0059542   .0051245    -1.16   0.245     -.015998    .0040897
--------------------------------------------------------------------------------

. 
. *different definitions of newretir
. 
. probit newSelfemp L.newretir $personal L.edyears L.ln_tenure_diff L.age L.k_pension L.k_avgpension, r

Iteration 0:   log pseudolikelihood = -1397.4507  
Iteration 1:   log pseudolikelihood = -1353.8758  
Iteration 2:   log pseudolikelihood = -1353.2977  
Iteration 3:   log pseudolikelihood = -1353.2971  
Iteration 4:   log pseudolikelihood = -1353.2971  

Probit regression                                 Number of obs   =       3592
                                                  Wald chi2(28)   =      87.00
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -1353.2971                 Pseudo R2       =     0.0316

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      newretir |
           L1. |   .9640219   .3733745     2.58   0.010     .2322214    1.695822
               |
       married |
           L1. |  -.0209891   .0695981    -0.30   0.763    -.1573989    .1154207
               |
         black |  -.1257954   .2764018    -0.46   0.649    -.6675329    .4159421
         asian |   .0120591   .2337478     0.05   0.959    -.4460782    .4701964
        female |  -.0412256   .0587712    -0.70   0.483     -.156415    .0739637
          ind2 |  -.1540039   .2747052    -0.56   0.575    -.6924163    .3844085
          ind3 |  -.3562384    .226997    -1.57   0.117    -.8011444    .0886676
          ind4 |  -.2609399   .2278908    -1.15   0.252    -.7075977    .1857179
          ind5 |   .0444098   .1985295     0.22   0.823    -.3447009    .4335205
          ind6 |   .1434256   .1928812     0.74   0.457    -.2346146    .5214658
          ind7 |  -.1265899   .1951367    -0.65   0.517    -.5090507     .255871
          ind8 |   .2076113   .1916493     1.08   0.279    -.1680143     .583237
          ind9 |    .098373   .1959532     0.50   0.616    -.2856883    .4824343
         ind10 |   .1872466   .1937442     0.97   0.334    -.1924852    .5669783
               |
        London |
           L1. |  -.0392827   .0986075    -0.40   0.690    -.2325499    .1539844
               |
         Wales |
           L1. |  -.0939361   .1412803    -0.66   0.506    -.3708403    .1829681
               |
      Scotland |
           L1. |   .1935705   .0935051     2.07   0.038     .0103039    .3768371
               |
          NIrl |
           L1. |    .281209   .2823511     1.00   0.319     -.272189     .834607
               |
     m_selfemp |
           L1. |  -.0356592   .0933892    -0.38   0.703    -.2186986    .1473802
               |
     f_selfemp |
           L1. |  -.0498311   .0775716    -0.64   0.521    -.2018686    .1022064
               |
  health_limit |
           L1. |   .0608975   .1057725     0.58   0.565    -.1464128    .2682079
               |
      bornAway |   .0236279   .1277126     0.19   0.853    -.2266843    .2739401
               |
        nokids |
           L1. |   .0063604   .0600188     0.11   0.916    -.1112743    .1239951
               |
       edyears |
           L1. |  -.0169932   .0085729    -1.98   0.047    -.0337958   -.0001907
               |
ln_tenure_diff |
           L1. |   .0862489   .0207199     4.16   0.000     .0456386    .1268592
               |
           age |
           L1. |   -.000222    .003229    -0.07   0.945    -.0065507    .0061067
               |
     k_pension |
           L1. |  -.0319327   .0280682    -1.14   0.255    -.0869453    .0230798
               |
  k_avgpension |
           L1. |     .04719   .0301905     1.56   0.118    -.0119823    .1063623
               |
         _cons |  -.8446758   .2486704    -3.40   0.001    -1.332061   -.3572909
--------------------------------------------------------------------------------

. margins, dydx(L1.newretir L1.k_pension L1.k_avgpension L1.ln_tenure_diff )

Average marginal effects                          Number of obs   =       3592
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.newretir L.ln_tenure_diff L.k_pension L.k_avgpension

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      newretir |
           L1. |   .1990093   .0768905     2.59   0.010     .0483066    .3497119
               |
ln_tenure_diff |
           L1. |   .0178049   .0042793     4.16   0.000     .0094176    .0261922
               |
     k_pension |
           L1. |  -.0065921   .0057937    -1.14   0.255    -.0179475    .0047633
               |
  k_avgpension |
           L1. |   .0097417   .0062315     1.56   0.118    -.0024718    .0219553
--------------------------------------------------------------------------------

. probit newSelfemp L.newretirB L.k_pension L.ln_tenure_diff L.age L.edyears L.k_avgpension $personal , r

Iteration 0:   log pseudolikelihood = -1397.4507  
Iteration 1:   log pseudolikelihood = -1353.0746  
Iteration 2:   log pseudolikelihood =  -1352.535  
Iteration 3:   log pseudolikelihood = -1352.5344  
Iteration 4:   log pseudolikelihood = -1352.5344  

Probit regression                                 Number of obs   =       3592
                                                  Wald chi2(28)   =      89.62
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -1352.5344                 Pseudo R2       =     0.0321

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     newretirB |
           L1. |   .7226203   .2460833     2.94   0.003      .240306    1.204935
               |
     k_pension |
           L1. |  -.0213395   .0238307    -0.90   0.371    -.0680468    .0253678
               |
ln_tenure_diff |
           L1. |   .0865414   .0208146     4.16   0.000     .0457455    .1273373
               |
           age |
           L1. |   .0001707   .0032387     0.05   0.958    -.0061771    .0065185
               |
       edyears |
           L1. |  -.0166593   .0085491    -1.95   0.051    -.0334153    .0000967
               |
  k_avgpension |
           L1. |   .0312754   .0265844     1.18   0.239    -.0208291      .08338
               |
       married |
           L1. |  -.0345479   .0697364    -0.50   0.620    -.1712287    .1021328
               |
         black |  -.1268309   .2760403    -0.46   0.646      -.66786    .4141981
         asian |   .0001225    .235267     0.00   1.000    -.4609923    .4612372
        female |  -.0472954   .0589627    -0.80   0.422    -.1628603    .0682694
          ind2 |  -.1558472   .2750472    -0.57   0.571    -.6949297    .3832353
          ind3 |  -.3568759   .2271314    -1.57   0.116    -.8020454    .0882935
          ind4 |  -.2614029   .2280273    -1.15   0.252    -.7083282    .1855224
          ind5 |   .0421655   .1988186     0.21   0.832    -.3475117    .4318428
          ind6 |   .1484535   .1930688     0.77   0.442    -.2299543    .5268614
          ind7 |  -.1295767   .1954573    -0.66   0.507    -.5126659    .2535125
          ind8 |   .1959401   .1919041     1.02   0.307    -.1801851    .5720653
          ind9 |   .1024535   .1962581     0.52   0.602    -.2822053    .4871123
         ind10 |   .1874893   .1940453     0.97   0.334    -.1928324    .5678111
               |
        London |
           L1. |  -.0310501    .098353    -0.32   0.752    -.2238185    .1617183
               |
         Wales |
           L1. |  -.1031768   .1423615    -0.72   0.469    -.3822002    .1758465
               |
      Scotland |
           L1. |   .2030085   .0936416     2.17   0.030     .0194743    .3865427
               |
          NIrl |
           L1. |   .2827613   .2820695     1.00   0.316    -.2700848    .8356073
               |
     m_selfemp |
           L1. |  -.0248905   .0934801    -0.27   0.790    -.2081081    .1583271
               |
     f_selfemp |
           L1. |  -.0578176   .0778993    -0.74   0.458    -.2104974    .0948622
               |
  health_limit |
           L1. |   .0692487   .1058183     0.65   0.513    -.1381513    .2766487
               |
      bornAway |   .0221019   .1277589     0.17   0.863     -.228301    .2725048
               |
        nokids |
           L1. |  -.0027373   .0601345    -0.05   0.964    -.1205987    .1151242
               |
         _cons |  -.8488907   .2488879    -3.41   0.001    -1.336702   -.3610794
--------------------------------------------------------------------------------

. margins, dydx(L1.newretirB L1.k_pension L1.k_avgpension L1.ln_tenure_diff )

Average marginal effects                          Number of obs   =       3592
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.newretirB L.k_pension L.ln_tenure_diff L.k_avgpension

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     newretirB |
           L1. |   .1491171   .0506478     2.94   0.003     .0498492    .2483849
               |
     k_pension |
           L1. |  -.0044035   .0049182    -0.90   0.371    -.0140431     .005236
               |
ln_tenure_diff |
           L1. |   .0178583   .0042987     4.15   0.000     .0094331    .0262836
               |
  k_avgpension |
           L1. |   .0064539   .0054861     1.18   0.239    -.0042986    .0172063
--------------------------------------------------------------------------------

. 
. probit newSelfemp L.pensionUp L.k_pension L.ln_tenure_diff L.age L.edyears L.k_avgpension $personal , r

Iteration 0:   log pseudolikelihood = -1397.4507  
Iteration 1:   log pseudolikelihood = -1354.3914  
Iteration 2:   log pseudolikelihood =  -1353.851  
Iteration 3:   log pseudolikelihood = -1353.8505  
Iteration 4:   log pseudolikelihood = -1353.8505  

Probit regression                                 Number of obs   =       3592
                                                  Wald chi2(28)   =      86.59
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -1353.8505                 Pseudo R2       =     0.0312

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |      .5588   .2273654     2.46   0.014      .113172    1.004428
               |
     k_pension |
           L1. |  -.0288239   .0248097    -1.16   0.245      -.07745    .0198022
               |
ln_tenure_diff |
           L1. |   .0864349   .0208001     4.16   0.000     .0456674    .1272023
               |
           age |
           L1. |   .0001388   .0032413     0.04   0.966    -.0062141    .0064917
               |
       edyears |
           L1. |  -.0167964   .0085523    -1.96   0.050    -.0335586   -.0000342
               |
  k_avgpension |
           L1. |   .0399561   .0273524     1.46   0.144    -.0136535    .0935658
               |
       married |
           L1. |  -.0334341   .0697095    -0.48   0.631    -.1700623    .1031941
               |
         black |  -.1273643   .2761333    -0.46   0.645    -.6685756     .413847
         asian |    .003876   .2347405     0.02   0.987    -.4562068    .4639589
        female |  -.0446253   .0589104    -0.76   0.449    -.1600875    .0708369
          ind2 |  -.1562384   .2749825    -0.57   0.570    -.6951942    .3827174
          ind3 |  -.3574544   .2270807    -1.57   0.115    -.8025244    .0876156
          ind4 |  -.2619575   .2279874    -1.15   0.251    -.7088045    .1848895
          ind5 |   .0422857   .1987634     0.21   0.832    -.3472835    .4318548
          ind6 |   .1478786   .1929894     0.77   0.444    -.2303737     .526131
          ind7 |  -.1310577   .1954016    -0.67   0.502    -.5140377    .2519224
          ind8 |    .196541   .1918299     1.02   0.306    -.1794387    .5725207
          ind9 |   .1015935   .1961896     0.52   0.605     -.282931     .486118
         ind10 |   .1873634   .1939701     0.97   0.334     -.192811    .5675378
               |
        London |
           L1. |  -.0311988   .0982609    -0.32   0.751    -.2237866     .161389
               |
         Wales |
           L1. |  -.1004932   .1419887    -0.71   0.479    -.3787858    .1777995
               |
      Scotland |
           L1. |   .2021576    .093634     2.16   0.031     .0186384    .3856767
               |
          NIrl |
           L1. |   .2821254   .2821026     1.00   0.317    -.2707855    .8350362
               |
     m_selfemp |
           L1. |   -.027757   .0935279    -0.30   0.767    -.2110683    .1555544
               |
     f_selfemp |
           L1. |  -.0570786   .0778377    -0.73   0.463    -.2096376    .0954805
               |
  health_limit |
           L1. |   .0670579   .1058306     0.63   0.526    -.1403663     .274482
               |
      bornAway |   .0222936   .1277491     0.17   0.861    -.2280901    .2726773
               |
        nokids |
           L1. |  -.0017962   .0601072    -0.03   0.976    -.1196041    .1160117
               |
         _cons |  -.8472437   .2489635    -3.40   0.001    -1.335203   -.3592842
--------------------------------------------------------------------------------

. 
. *different transitions (own account or employer)
. probit newOwn L.pensionUp $personal L.edyears L.ln_tenure_diff L.age L.k_pension L.k_avgpension, r

Iteration 0:   log pseudolikelihood = -697.50344  
Iteration 1:   log pseudolikelihood = -589.19979  
Iteration 2:   log pseudolikelihood = -587.88998  
Iteration 3:   log pseudolikelihood =  -587.8853  
Iteration 4:   log pseudolikelihood =  -587.8853  

Probit regression                                 Number of obs   =       1153
                                                  Wald chi2(28)   =     186.93
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood =  -587.8853                 Pseudo R2       =     0.1572

--------------------------------------------------------------------------------
               |               Robust
        newOwn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |    .628578    .292328     2.15   0.032     .0556255     1.20153
               |
       married |
           L1. |  -.0654008   .1113267    -0.59   0.557    -.2835971    .1527955
               |
         black |  -1.149234   .4193156    -2.74   0.006    -1.971078    -.327391
         asian |   -.307265   .3729826    -0.82   0.410    -1.038297    .4237675
        female |  -.1157669   .0971898    -1.19   0.234    -.3062555    .0747217
          ind2 |   .1741384   .3827186     0.46   0.649    -.5759763    .9242532
          ind3 |   .6029856   .3829819     1.57   0.115    -.1476452    1.353616
          ind4 |   .7319421   .4566193     1.60   0.109    -.1630153      1.6269
          ind5 |   .5642473   .2630492     2.15   0.032     .0486803    1.079814
          ind6 |   .2394611     .25732     0.93   0.352    -.2648767     .743799
          ind7 |   .2516478   .2563595     0.98   0.326    -.2508075    .7541031
          ind8 |   .6416634   .2536726     2.53   0.011     .1444741    1.138853
          ind9 |   .6403819   .2628021     2.44   0.015     .1252992    1.155465
         ind10 |   .6967419   .2609791     2.67   0.008     .1852323    1.208252
               |
        London |
           L1. |   .2342674   .1739835     1.35   0.178    -.1067339    .5752687
               |
         Wales |
           L1. |   .1294264   .2324561     0.56   0.578    -.3261793     .585032
               |
      Scotland |
           L1. |    .162248   .1424657     1.14   0.255    -.1169796    .4414757
               |
          NIrl |
           L1. |  -.2776546   .4011627    -0.69   0.489    -1.063919    .5086098
               |
     m_selfemp |
           L1. |   .0512286   .1284489     0.40   0.690    -.2005266    .3029839
               |
     f_selfemp |
           L1. |  -.0225193   .1119521    -0.20   0.841    -.2419415    .1969028
               |
  health_limit |
           L1. |   .1024462   .1549248     0.66   0.508    -.2012008    .4060932
               |
      bornAway |   .0073249   .1896411     0.04   0.969    -.3643649    .3790147
               |
        nokids |
           L1. |   .2196936   .0994703     2.21   0.027     .0247354    .4146518
               |
       edyears |
           L1. |  -.0261087   .0146136    -1.79   0.074    -.0547508    .0025334
               |
ln_tenure_diff |
           L1. |  -.4128075   .0401964   -10.27   0.000     -.491591    -.334024
               |
           age |
           L1. |   -.024403   .0056882    -4.29   0.000    -.0355517   -.0132544
               |
     k_pension |
           L1. |   -.048977   .0327135    -1.50   0.134    -.1130942    .0151403
               |
  k_avgpension |
           L1. |   .0235643   .0334099     0.71   0.481    -.0419178    .0890464
               |
         _cons |   .1518123   .3748353     0.41   0.685    -.5828514    .8864759
--------------------------------------------------------------------------------

. margins, dydx(L1.pensionUp L1.k_pension L1.k_avgpension L1.ln_tenure_diff )

Average marginal effects                          Number of obs   =       1153
Model VCE    : Robust

Expression   : Pr(newOwn), predict()
dy/dx w.r.t. : L.pensionUp L.ln_tenure_diff L.k_pension L.k_avgpension

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |   .1810684   .0837949     2.16   0.031     .0168335    .3453033
               |
ln_tenure_diff |
           L1. |  -.1189135    .009885   -12.03   0.000    -.1382876   -.0995393
               |
     k_pension |
           L1. |  -.0141083     .00941    -1.50   0.134    -.0325517     .004335
               |
  k_avgpension |
           L1. |   .0067879   .0096231     0.71   0.481    -.0120729    .0256488
--------------------------------------------------------------------------------

. probit newFirm L.pensionUp $personal L.edyears L.ln_tenure_diff L.age L.k_pension L.k_avgpension, r

note: ind2 != 0 predicts failure perfectly
      ind2 dropped and 18 obs not used

Iteration 0:   log pseudolikelihood = -331.32033  
Iteration 1:   log pseudolikelihood = -288.11655  
Iteration 2:   log pseudolikelihood = -285.24875  
Iteration 3:   log pseudolikelihood = -285.22366  
Iteration 4:   log pseudolikelihood = -285.22362  
Iteration 5:   log pseudolikelihood = -285.22362  

Probit regression                                 Number of obs   =       1135
                                                  Wald chi2(27)   =      93.54
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -285.22362                 Pseudo R2       =     0.1391

--------------------------------------------------------------------------------
               |               Robust
       newFirm |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |  -.1441449   .5250608    -0.27   0.784    -1.173245    .8849552
               |
       married |
           L1. |   .0706562   .1562904     0.45   0.651    -.2356673    .3769796
               |
         black |   .6956578   .5352202     1.30   0.194    -.3533545     1.74467
         asian |   .5583988    .385055     1.45   0.147    -.1962951    1.313093
        female |   .1996981   .1306191     1.53   0.126    -.0563106    .4557069
          ind2 |          0  (omitted)
          ind3 |   .1772627   .4934141     0.36   0.719    -.7898111    1.144337
          ind4 |   .4023212   .5116266     0.79   0.432    -.6004484    1.405091
          ind5 |  -.0934936   .3703155    -0.25   0.801    -.8192987    .6323115
          ind6 |   .5046776   .3340971     1.51   0.131    -.1501407    1.159496
          ind7 |   .2072344   .3414089     0.61   0.544    -.4619148    .8763836
          ind8 |   .1730614   .3366494     0.51   0.607    -.4867592    .8328821
          ind9 |   .2146448   .3454304     0.62   0.534    -.4623865     .891676
         ind10 |  -.3192259    .359277    -0.89   0.374    -1.023396    .3849441
               |
        London |
           L1. |  -.0642448   .2673795    -0.24   0.810    -.5882989    .4598093
               |
         Wales |
           L1. |  -.6122311   .4566701    -1.34   0.180    -1.507288    .2828259
               |
      Scotland |
           L1. |   .1651091     .17333     0.95   0.341    -.1746115    .5048297
               |
          NIrl |
           L1. |   .8681893   .3888149     2.23   0.026     .1061262    1.630252
               |
     m_selfemp |
           L1. |  -.5608803   .2073806    -2.70   0.007    -.9673389   -.1544217
               |
     f_selfemp |
           L1. |  -.0680313   .1649541    -0.41   0.680    -.3913354    .2552729
               |
  health_limit |
           L1. |   .3656357   .1939366     1.89   0.059     -.014473    .7457444
               |
      bornAway |  -.1420988   .2670157    -0.53   0.595      -.66544    .3812423
               |
        nokids |
           L1. |  -.2263565   .1363567    -1.66   0.097    -.4936107    .0408977
               |
       edyears |
           L1. |   .0312512   .0207503     1.51   0.132    -.0094186    .0719211
               |
ln_tenure_diff |
           L1. |  -.2916411   .0510759    -5.71   0.000    -.3917481   -.1915342
               |
           age |
           L1. |  -.0107471   .0066226    -1.62   0.105    -.0237272    .0022329
               |
     k_pension |
           L1. |   .0143711   .0307233     0.47   0.640    -.0458455    .0745877
               |
  k_avgpension |
           L1. |  -.0406107   .0457662    -0.89   0.375    -.1303108    .0490894
               |
         _cons |  -1.586963   .4758501    -3.34   0.001    -2.519612   -.6543135
--------------------------------------------------------------------------------

. margins, dydx(L1.pensionUp L1.k_pension L1.k_avgpension L1.ln_tenure_diff )

Average marginal effects                          Number of obs   =       1135
Model VCE    : Robust

Expression   : Pr(newFirm), predict()
dy/dx w.r.t. : L.pensionUp L.ln_tenure_diff L.k_pension L.k_avgpension

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L1. |  -.0196346   .0715716    -0.27   0.784    -.1599124    .1206433
               |
ln_tenure_diff |
           L1. |  -.0397256   .0070371    -5.65   0.000    -.0535181   -.0259332
               |
     k_pension |
           L1. |   .0019575   .0041809     0.47   0.640    -.0062368    .0101519
               |
  k_avgpension |
           L1. |  -.0055317   .0062238    -0.89   0.374    -.0177302    .0066667
--------------------------------------------------------------------------------

. 
. *persistence
. reg selfPersist L2.pensionUp $personal L.edyears L2.ln_tenure_diff L2.age L.k_pension L.k_avgpension, r

Linear regression                                      Number of obs =    3143
                                                       F( 28,  3114) =    6.43
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0602
                                                       Root MSE      =  .28273

--------------------------------------------------------------------------------
               |               Robust
   selfPersist |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L2. |   .2119372   .0863516     2.45   0.014     .0426253     .381249
               |
       married |
           L1. |   -.000618   .0131825    -0.05   0.963    -.0264652    .0252293
               |
         black |  -.0226588   .0348554    -0.65   0.516    -.0910006     .045683
         asian |    .004598   .0509313     0.09   0.928    -.0952644    .1044604
        female |   .0080625   .0111997     0.72   0.472     -.013897     .030022
          ind2 |   .0370289   .0510116     0.73   0.468    -.0629909    .1370488
          ind3 |  -.0065305   .0411809    -0.16   0.874    -.0872749     .074214
          ind4 |  -.0072504   .0409343    -0.18   0.859    -.0875114    .0730106
          ind5 |   .0295197   .0416318     0.71   0.478    -.0521089    .1111482
          ind6 |   .0465768   .0414133     1.12   0.261    -.0346234     .127777
          ind7 |  -.0004276   .0401518    -0.01   0.992    -.0791543    .0782992
          ind8 |   .0395785   .0407093     0.97   0.331    -.0402413    .1193983
          ind9 |   .0139114   .0405175     0.34   0.731    -.0655322    .0933551
         ind10 |   .0360653   .0415294     0.87   0.385    -.0453624    .1174931
               |
        London |
           L1. |  -.0058519   .0170563    -0.34   0.732    -.0392947    .0275908
               |
         Wales |
           L1. |  -.0263072    .021844    -1.20   0.229    -.0691374     .016523
               |
      Scotland |
           L1. |   -.012783   .0206891    -0.62   0.537    -.0533486    .0277826
               |
          NIrl |
           L1. |    .125137   .0980256     1.28   0.202    -.0670643    .3173383
               |
     m_selfemp |
           L1. |   .0050907   .0191456     0.27   0.790    -.0324486      .04263
               |
     f_selfemp |
           L1. |  -.0083603   .0150937    -0.55   0.580     -.037955    .0212344
               |
  health_limit |
           L1. |  -.0590526   .0194752    -3.03   0.002    -.0972382   -.0208669
               |
      bornAway |   .0070043   .0279462     0.25   0.802    -.0477905     .061799
               |
        nokids |
           L1. |   .0026403    .011447     0.23   0.818    -.0198041    .0250848
               |
       edyears |
           L1. |  -.0027483   .0016064    -1.71   0.087    -.0058981    .0004015
               |
ln_tenure_diff |
           L2. |   .0387835   .0041215     9.41   0.000     .0307023    .0468647
               |
           age |
           L2. |  -.0006321   .0005823    -1.09   0.278    -.0017739    .0005097
               |
     k_pension |
           L1. |  -.0017426   .0079389    -0.22   0.826    -.0173087    .0138235
               |
  k_avgpension |
           L1. |   .0124865    .008935     1.40   0.162    -.0050326    .0300056
               |
         _cons |   .1749954   .0499081     3.51   0.000     .0771394    .2728515
--------------------------------------------------------------------------------

. probit selfPersist L2.pensionUp $personal L.edyears L2.ln_tenure_diff L2.age L.k_pension L.k_avgpension, r

Iteration 0:   log pseudolikelihood =  -971.8395  
Iteration 1:   log pseudolikelihood = -882.98662  
Iteration 2:   log pseudolikelihood = -879.39264  
Iteration 3:   log pseudolikelihood = -879.37829  
Iteration 4:   log pseudolikelihood = -879.37829  

Probit regression                                 Number of obs   =       3143
                                                  Wald chi2(28)   =     246.95
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -879.37829                 Pseudo R2       =     0.0951

--------------------------------------------------------------------------------
               |               Robust
   selfPersist |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L2. |   .8600489    .261283     3.29   0.001     .3479436    1.372154
               |
       married |
           L1. |  -.0151536   .0846652    -0.18   0.858    -.1810943    .1507871
               |
         black |  -.3068868   .3547144    -0.87   0.387    -1.002114    .3883407
         asian |   .0334101   .2772482     0.12   0.904    -.5099864    .5768066
        female |    .072255   .0727813     0.99   0.321    -.0703938    .2149038
          ind2 |   .1802617   .3099783     0.58   0.561    -.4272846     .787808
          ind3 |  -.1805191   .2665489    -0.68   0.498    -.7029454    .3419071
          ind4 |  -.3165144   .2887433    -1.10   0.273    -.8824409     .249412
          ind5 |    .137434   .2284148     0.60   0.547    -.3102508    .5851188
          ind6 |   .2366824   .2217239     1.07   0.286    -.1978884    .6712532
          ind7 |  -.0586977   .2250023    -0.26   0.794    -.4996941    .3822988
          ind8 |   .2281728   .2206813     1.03   0.301    -.2043546    .6607001
          ind9 |   .0630458   .2288809     0.28   0.783    -.3855525     .511644
         ind10 |   .1884757   .2251167     0.84   0.402    -.2527449    .6296963
               |
        London |
           L1. |  -.0452893   .1184203    -0.38   0.702    -.2773888    .1868102
               |
         Wales |
           L1. |  -.2627322   .1846374    -1.42   0.155    -.6246148    .0991504
               |
      Scotland |
           L1. |  -.0743819   .1210929    -0.61   0.539    -.3117196    .1629559
               |
          NIrl |
           L1. |   .3736865   .3075038     1.22   0.224    -.2290098    .9763828
               |
     m_selfemp |
           L1. |   .0157513   .1085718     0.15   0.885    -.1970455    .2285481
               |
     f_selfemp |
           L1. |  -.0549506   .0920325    -0.60   0.550    -.2353311    .1254298
               |
  health_limit |
           L1. |  -.4403526   .1580385    -2.79   0.005    -.7501025   -.1306028
               |
      bornAway |   .0119833   .1587281     0.08   0.940    -.2991181    .3230847
               |
        nokids |
           L1. |   .0212101   .0730872     0.29   0.772    -.1220381    .1644583
               |
       edyears |
           L1. |  -.0204737   .0106287    -1.93   0.054    -.0413056    .0003582
               |
ln_tenure_diff |
           L2. |   .2578358   .0233769    11.03   0.000      .212018    .3036537
               |
           age |
           L2. |  -.0031156    .003894    -0.80   0.424    -.0107478    .0045165
               |
     k_pension |
           L1. |  -.0129232   .0260844    -0.50   0.620    -.0640476    .0382012
               |
  k_avgpension |
           L1. |   .0587625   .0297232     1.98   0.048     .0005062    .1170189
               |
         _cons |   -.827757    .291788    -2.84   0.005    -1.399651   -.2558631
--------------------------------------------------------------------------------

. reg selfDrop L2.pensionUp $personal L.edyears L2.ln_tenure_diff L2.age L.k_pension L.k_avgpension, r

Linear regression                                      Number of obs =    3143
                                                       F( 28,  3114) =    3.44
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0156
                                                       Root MSE      =  .19101

--------------------------------------------------------------------------------
               |               Robust
      selfDrop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L2. |  -.0189159   .0073417    -2.58   0.010     -.033311   -.0045208
               |
       married |
           L1. |   .0016549   .0093146     0.18   0.859    -.0166086    .0199183
               |
         black |    .029571   .0435309     0.68   0.497    -.0557812    .1149233
         asian |   .0294306   .0372434     0.79   0.429    -.0435936    .1024548
        female |  -.0047439   .0075436    -0.63   0.529    -.0195348     .010047
          ind2 |  -.0429929   .0265902    -1.62   0.106    -.0951289    .0091431
          ind3 |  -.0129169   .0250922    -0.51   0.607    -.0621158     .036282
          ind4 |   .0058425    .027319     0.21   0.831    -.0477226    .0594076
          ind5 |   .0011114   .0235141     0.05   0.962    -.0449933    .0472161
          ind6 |  -.0077739    .022054    -0.35   0.724    -.0510157    .0354679
          ind7 |  -.0126508   .0218514    -0.58   0.563    -.0554955    .0301939
          ind8 |   .0005377   .0217735     0.02   0.980    -.0421542    .0432296
          ind9 |   -.015602   .0219624    -0.71   0.478    -.0586641    .0274602
         ind10 |   .0057082    .022081     0.26   0.796    -.0375867     .049003
               |
        London |
           L1. |   .0194604   .0136689     1.42   0.155    -.0073407    .0462614
               |
         Wales |
           L1. |   .0213488    .020566     1.04   0.299    -.0189754     .061673
               |
      Scotland |
           L1. |    .037606   .0160357     2.35   0.019     .0061644    .0690477
               |
          NIrl |
           L1. |  -.0102623   .0100129    -1.02   0.305    -.0298948    .0093702
               |
     m_selfemp |
           L1. |  -.0054792   .0111297    -0.49   0.623    -.0273016    .0163431
               |
     f_selfemp |
           L1. |   .0028835   .0099801     0.29   0.773    -.0166846    .0224517
               |
  health_limit |
           L1. |  -.0066825   .0108298    -0.62   0.537    -.0279169    .0145518
               |
      bornAway |  -.0033414   .0167546    -0.20   0.842    -.0361926    .0295098
               |
        nokids |
           L1. |  -.0084242   .0078538    -1.07   0.284    -.0238233    .0069749
               |
       edyears |
           L1. |  -.0008216   .0011797    -0.70   0.486    -.0031347    .0014914
               |
ln_tenure_diff |
           L2. |  -.0129945   .0026683    -4.87   0.000    -.0182263   -.0077626
               |
           age |
           L2. |  -.0002346   .0004519    -0.52   0.604    -.0011208    .0006515
               |
     k_pension |
           L1. |   .0016189   .0016893     0.96   0.338    -.0016934    .0049311
               |
  k_avgpension |
           L1. |  -.0029048   .0014682    -1.98   0.048    -.0057835   -.0000261
               |
         _cons |   .0478822   .0318472     1.50   0.133    -.0145615    .1103259
--------------------------------------------------------------------------------

. probit selfDrop L2.pensionUp $personal L.edyears L2.ln_tenure_diff L2.age L.k_pension L.k_avgpension, r

note: L2.pensionUp != 0 predicts failure perfectly
      L2.pensionUp dropped and 31 obs not used

note: L.NIrl != 0 predicts failure perfectly
      L.NIrl dropped and 21 obs not used

Iteration 0:   log pseudolikelihood =  -507.4909  
Iteration 1:   log pseudolikelihood = -483.32895  
Iteration 2:   log pseudolikelihood = -481.66643  
Iteration 3:   log pseudolikelihood = -481.56491  
Iteration 4:   log pseudolikelihood = -481.56426  
Iteration 5:   log pseudolikelihood = -481.56426  

Probit regression                                 Number of obs   =       3091
                                                  Wald chi2(26)   =      71.19
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -481.56426                 Pseudo R2       =     0.0511

--------------------------------------------------------------------------------
               |               Robust
      selfDrop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L2. |          0  (omitted)
               |
       married |
           L1. |   -.005596   .1137143    -0.05   0.961     -.228472      .21728
               |
         black |   .2642668   .3072882     0.86   0.390     -.338007    .8665405
         asian |   .3267028   .3589807     0.91   0.363    -.3768864    1.030292
        female |  -.0538751   .0948387    -0.57   0.570    -.2397555    .1320053
          ind2 |  -.6162224   .5243962    -1.18   0.240     -1.64402    .4115752
          ind3 |   -.095817   .3618748    -0.26   0.791    -.8050787    .6134446
          ind4 |    .067704    .356927     0.19   0.850    -.6318601    .7672682
          ind5 |    .051753   .3393384     0.15   0.879     -.613338     .716844
          ind6 |  -.0943502    .338903    -0.28   0.781    -.7585879    .5698875
          ind7 |  -.1368313    .337501    -0.41   0.685     -.798321    .5246584
          ind8 |   .0494017   .3301347     0.15   0.881    -.5976505    .6964539
          ind9 |  -.1618125   .3413136    -0.47   0.635     -.830775    .5071499
         ind10 |   .1018423   .3316787     0.31   0.759    -.5482361    .7519206
               |
        London |
           L1. |   .2241068   .1358062     1.65   0.099    -.0420684    .4902821
               |
         Wales |
           L1. |   .2444585   .1941815     1.26   0.208    -.1361303    .6250473
               |
      Scotland |
           L1. |    .418213   .1460546     2.86   0.004     .1319512    .7044747
               |
          NIrl |
           L1. |          0  (omitted)
               |
     m_selfemp |
           L1. |  -.0994562   .1665287    -0.60   0.550    -.4258464     .226934
               |
     f_selfemp |
           L1. |    .043345    .128165     0.34   0.735    -.2078538    .2945439
               |
  health_limit |
           L1. |  -.1890419    .212037    -0.89   0.373    -.6046267     .226543
               |
      bornAway |   -.004671   .2188407    -0.02   0.983    -.4335909     .424249
               |
        nokids |
           L1. |  -.1045374   .0942914    -1.11   0.268    -.2893451    .0802704
               |
       edyears |
           L1. |  -.0099718   .0133021    -0.75   0.453    -.0360434    .0160998
               |
ln_tenure_diff |
           L2. |  -.1840295   .0369784    -4.98   0.000    -.2565058   -.1115532
               |
           age |
           L2. |  -.0033267   .0057841    -0.58   0.565    -.0146633    .0080099
               |
     k_pension |
           L1. |   .1190976   .0445168     2.68   0.007     .0318462     .206349
               |
  k_avgpension |
           L1. |   -.187794   .0512079    -3.67   0.000    -.2881597   -.0874283
               |
         _cons |  -1.739186   .4230039    -4.11   0.000    -2.568259   -.9101141
--------------------------------------------------------------------------------
Note: 1 failure and 0 successes completely determined.

. 
. reg selfPersist2 L3.pensionUp $personal L.edyears L3.ln_tenure_diff L3.age L.k_pension L.k_avgpension, r

Linear regression                                      Number of obs =    2790
                                                       F( 28,  2761) =    6.42
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0718
                                                       Root MSE      =  .27359

--------------------------------------------------------------------------------
               |               Robust
  selfPersist2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L3. |   .1692882    .092896     1.82   0.069    -.0128645    .3514409
               |
       married |
           L1. |  -.0067208    .013906    -0.48   0.629     -.033988    .0205464
               |
         black |  -.0090875    .038144    -0.24   0.812    -.0838811    .0657061
         asian |   .0377906   .0567167     0.67   0.505    -.0734208     .149002
        female |  -.0052449   .0113642    -0.46   0.644    -.0275281    .0170384
          ind2 |    -.01328    .065443    -0.20   0.839    -.1416021    .1150422
          ind3 |  -.0941776   .0532111    -1.77   0.077    -.1985151    .0101599
          ind4 |  -.0727956   .0539323    -1.35   0.177    -.1785473    .0329561
          ind5 |  -.0663863   .0538803    -1.23   0.218    -.1720361    .0392635
          ind6 |  -.0476998   .0541565    -0.88   0.379    -.1538912    .0584916
          ind7 |  -.0753275    .053375    -1.41   0.158    -.1799864    .0293314
          ind8 |  -.0524942   .0534893    -0.98   0.326    -.1573773    .0523888
          ind9 |  -.0623331   .0535252    -1.16   0.244    -.1672866    .0426204
         ind10 |  -.0533935   .0540412    -0.99   0.323    -.1593587    .0525717
               |
        London |
           L1. |  -.0008136   .0172181    -0.05   0.962    -.0345753    .0329482
               |
         Wales |
           L1. |  -.0107958   .0243192    -0.44   0.657    -.0584815    .0368899
               |
      Scotland |
           L1. |  -.0018609   .0218842    -0.09   0.932     -.044772    .0410501
               |
          NIrl |
           L1. |   .2227646   .1168911     1.91   0.057    -.0064383    .4519675
               |
     m_selfemp |
           L1. |   .0104277   .0209577     0.50   0.619    -.0306667    .0515221
               |
     f_selfemp |
           L1. |  -.0097428   .0161095    -0.60   0.545    -.0413307    .0218451
               |
  health_limit |
           L1. |  -.0327057   .0211843    -1.54   0.123    -.0742444     .008833
               |
      bornAway |  -.0091051   .0272901    -0.33   0.739    -.0626161    .0444059
               |
        nokids |
           L1. |   .0022832   .0121615     0.19   0.851    -.0215633    .0261297
               |
       edyears |
           L1. |  -.0029828    .001689    -1.77   0.078    -.0062947    .0003291
               |
ln_tenure_diff |
           L3. |    .045332   .0043826    10.34   0.000     .0367385    .0539255
               |
           age |
           L3. |   .0001217   .0006455     0.19   0.850    -.0011439    .0013873
               |
     k_pension |
           L1. |  -.0019667   .0084029    -0.23   0.815    -.0184433    .0145098
               |
  k_avgpension |
           L1. |   .0087371   .0086577     1.01   0.313     -.008239    .0257133
               |
         _cons |   .2413577   .0604928     3.99   0.000     .1227419    .3599734
--------------------------------------------------------------------------------

. probit selfPersist2 L3.pensionUp $personal L.edyears L3.ln_tenure_diff L3.age L.k_pension L.k_avgpension, r

Iteration 0:   log pseudolikelihood = -827.54246  
Iteration 1:   log pseudolikelihood = -732.40142  
Iteration 2:   log pseudolikelihood = -728.03897  
Iteration 3:   log pseudolikelihood =  -728.0233  
Iteration 4:   log pseudolikelihood =  -728.0233  

Probit regression                                 Number of obs   =       2790
                                                  Wald chi2(28)   =     292.54
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood =  -728.0233                 Pseudo R2       =     0.1203

--------------------------------------------------------------------------------
               |               Robust
  selfPersist2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L3. |   .7065555   .3061911     2.31   0.021      .106432    1.306679
               |
       married |
           L1. |  -.0682488    .093349    -0.73   0.465    -.2512094    .1147118
               |
         black |   -.142208   .3630836    -0.39   0.695    -.8538388    .5694227
         asian |   .2684092   .3017468     0.89   0.374    -.3230037    .8598222
        female |  -.0161065   .0811637    -0.20   0.843    -.1751844    .1429714
          ind2 |   .0977127   .2969858     0.33   0.742    -.4843687    .6797941
          ind3 |  -.6666057   .2922637    -2.28   0.023    -1.239432   -.0937794
          ind4 |  -.4558595   .2751267    -1.66   0.098     -.995098     .083379
          ind5 |   -.280187   .2214895    -1.27   0.206    -.7142984    .1539243
          ind6 |  -.1859257    .216408    -0.86   0.390    -.6100776    .2382263
          ind7 |  -.3577334   .2181134    -1.64   0.101    -.7852278     .069761
          ind8 |  -.1818248   .2129517    -0.85   0.393    -.5992024    .2355529
          ind9 |  -.2530941   .2206243    -1.15   0.251    -.6855098    .1793216
         ind10 |  -.1803565   .2187566    -0.82   0.410    -.6091114    .2483985
               |
        London |
           L1. |  -.0442358   .1325936    -0.33   0.739    -.3041145     .215643
               |
         Wales |
           L1. |  -.1524723   .1975136    -0.77   0.440    -.5395917    .2346472
               |
      Scotland |
           L1. |  -.0070214   .1301737    -0.05   0.957     -.262157    .2481143
               |
          NIrl |
           L1. |   .6910122   .3246734     2.13   0.033      .054664     1.32736
               |
     m_selfemp |
           L1. |   .0663346   .1221475     0.54   0.587    -.1730701    .3057393
               |
     f_selfemp |
           L1. |  -.0836684   .1067326    -0.78   0.433    -.2928604    .1255236
               |
  health_limit |
           L1. |  -.2840908   .1480705    -1.92   0.055    -.5743037    .0061221
               |
      bornAway |  -.1089257   .1762618    -0.62   0.537    -.4543926    .2365411
               |
        nokids |
           L1. |   .0187834   .0822615     0.23   0.819    -.1424461     .180013
               |
       edyears |
           L1. |  -.0229999   .0118415    -1.94   0.052    -.0462089    .0002091
               |
ln_tenure_diff |
           L3. |   .3177769   .0247063    12.86   0.000     .2693534    .3662004
               |
           age |
           L3. |   .0011673   .0044434     0.26   0.793    -.0075416    .0098761
               |
     k_pension |
           L1. |  -.0029307   .0274525    -0.11   0.915    -.0567365    .0508751
               |
  k_avgpension |
           L1. |   .0365418   .0293019     1.25   0.212    -.0208888    .0939724
               |
         _cons |  -.5546123   .2934361    -1.89   0.059    -1.129736    .0205119
--------------------------------------------------------------------------------

. reg selfDrop2 L3.pensionUp $personal L.edyears L3.ln_tenure_diff L3.age L.k_pension L.k_avgpension, r

Linear regression                                      Number of obs =    2790
                                                       F( 28,  2761) =    3.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0166
                                                       Root MSE      =  .19568

--------------------------------------------------------------------------------
               |               Robust
     selfDrop2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L3. |   -.031736   .0124167    -2.56   0.011    -.0560829    -.007389
               |
       married |
           L1. |  -.0166798   .0101919    -1.64   0.102    -.0366642    .0033047
               |
         black |   .0763674   .0539484     1.42   0.157    -.0294159    .1821506
         asian |  -.0482492   .0218278    -2.21   0.027    -.0910496   -.0054487
        female |  -.0013745   .0078883    -0.17   0.862    -.0168419     .014093
          ind2 |  -.0405774    .018866    -2.15   0.032    -.0775702   -.0035846
          ind3 |    .015897   .0257418     0.62   0.537    -.0345781    .0663721
          ind4 |   -.003033   .0236483    -0.13   0.898     -.049403    .0433371
          ind5 |    .019258   .0218644     0.88   0.379    -.0236141    .0621302
          ind6 |   .0148519   .0195445     0.76   0.447    -.0234714    .0531753
          ind7 |   .0104021   .0195918     0.53   0.596    -.0280139    .0488181
          ind8 |    .000593   .0183382     0.03   0.974     -.035365     .036551
          ind9 |   .0103765   .0195353     0.53   0.595    -.0279288    .0486818
         ind10 |   .0105939   .0191026     0.55   0.579     -.026863    .0480508
               |
        London |
           L1. |  -.0031374   .0142139    -0.22   0.825    -.0310083    .0247336
               |
         Wales |
           L1. |  -.0070011   .0178373    -0.39   0.695    -.0419769    .0279746
               |
      Scotland |
           L1. |   .0130458   .0145667     0.90   0.371    -.0155169    .0416086
               |
          NIrl |
           L1. |   .0313824   .0625964     0.50   0.616     -.091358    .1541228
               |
     m_selfemp |
           L1. |   .0135974   .0130666     1.04   0.298     -.012024    .0392188
               |
     f_selfemp |
           L1. |  -.0075688   .0104343    -0.73   0.468    -.0280285     .012891
               |
  health_limit |
           L1. |  -.0093106    .011459    -0.81   0.417    -.0317797    .0131585
               |
      bornAway |   .0186559   .0221406     0.84   0.400    -.0247579    .0620697
               |
        nokids |
           L1. |  -.0049282   .0077039    -0.64   0.522    -.0200342    .0101777
               |
       edyears |
           L1. |  -.0007202   .0012898    -0.56   0.577    -.0032493    .0018088
               |
ln_tenure_diff |
           L3. |  -.0137552   .0028039    -4.91   0.000    -.0192531   -.0082573
               |
           age |
           L3. |  -.0003963   .0004173    -0.95   0.342    -.0012145    .0004219
               |
     k_pension |
           L1. |  -.0034386    .003359    -1.02   0.306     -.010025    .0031478
               |
  k_avgpension |
           L1. |   .0030854    .003975     0.78   0.438    -.0047089    .0108797
               |
         _cons |    .054149   .0306557     1.77   0.077    -.0059613    .1142594
--------------------------------------------------------------------------------

. probit selfDrop2 L3.pensionUp $personal L.edyears L3.ln_tenure_diff L3.age L.k_pension L.k_avgpension, r

note: L3.pensionUp != 0 predicts failure perfectly
      L3.pensionUp dropped and 23 obs not used

note: asian != 0 predicts failure perfectly
      asian dropped and 45 obs not used

note: ind2 != 0 predicts failure perfectly
      ind2 dropped and 56 obs not used

Iteration 0:   log pseudolikelihood = -464.63535  
Iteration 1:   log pseudolikelihood = -443.09009  
Iteration 2:   log pseudolikelihood = -441.58337  
Iteration 3:   log pseudolikelihood = -441.54413  
Iteration 4:   log pseudolikelihood = -441.54403  
Iteration 5:   log pseudolikelihood = -441.54403  

Probit regression                                 Number of obs   =       2666
                                                  Wald chi2(25)   =      57.47
                                                  Prob > chi2     =     0.0002
Log pseudolikelihood = -441.54403                 Pseudo R2       =     0.0497

--------------------------------------------------------------------------------
               |               Robust
     selfDrop2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     pensionUp |
           L3. |          0  (omitted)
               |
       married |
           L1. |  -.1990906   .1045783    -1.90   0.057    -.4040602     .005879
               |
         black |   .5397095   .3011796     1.79   0.073    -.0505916    1.130011
         asian |          0  (omitted)
        female |   .0027161   .0930212     0.03   0.977     -.179602    .1850342
          ind2 |          0  (omitted)
          ind3 |    .338867   .4356519     0.78   0.437    -.5149951    1.192729
          ind4 |   .1290364   .4462048     0.29   0.772     -.745509    1.003582
          ind5 |   .3845368   .4191694     0.92   0.359    -.4370201    1.206094
          ind6 |   .3116493    .415568     0.75   0.453     -.502849    1.126148
          ind7 |   .2835187   .4166059     0.68   0.496    -.5330138    1.100051
          ind8 |    .181295   .4131245     0.44   0.661     -.628414    .9910041
          ind9 |   .3057261   .4120158     0.74   0.458    -.5018099    1.113262
         ind10 |   .2988752   .4119847     0.73   0.468    -.5085999     1.10635
               |
        London |
           L1. |   -.013285   .1505187    -0.09   0.930    -.3082963    .2817264
               |
         Wales |
           L1. |   -.117751   .2318809    -0.51   0.612    -.5722292    .3367272
               |
      Scotland |
           L1. |   .1901459   .1622373     1.17   0.241    -.1278335    .5081253
               |
          NIrl |
           L1. |   .4157655    .511809     0.81   0.417    -.5873617    1.418893
               |
     m_selfemp |
           L1. |   .1987732     .15291     1.30   0.194     -.100925    .4984713
               |
     f_selfemp |
           L1. |  -.1293035   .1345469    -0.96   0.337    -.3930105    .1344035
               |
  health_limit |
           L1. |  -.1842536   .2199036    -0.84   0.402    -.6152567    .2467495
               |
      bornAway |   .1740207   .1930617     0.90   0.367    -.2043734    .5524147
               |
        nokids |
           L1. |  -.0689303   .0925024    -0.75   0.456    -.2502318    .1123711
               |
       edyears |
           L1. |  -.0116735   .0145801    -0.80   0.423      -.04025    .0169031
               |
ln_tenure_diff |
           L3. |   -.202393   .0393601    -5.14   0.000    -.2795373   -.1252487
               |
           age |
           L3. |  -.0070734   .0052874    -1.34   0.181    -.0174366    .0032897
               |
     k_pension |
           L1. |  -.1270035   .0921703    -1.38   0.168     -.307654    .0536469
               |
  k_avgpension |
           L1. |   .0938694   .0733067     1.28   0.200    -.0498091    .2375479
               |
         _cons |   -1.73179   .4978951    -3.48   0.001    -2.707646   -.7559336
--------------------------------------------------------------------------------

. 
. 
. /*WINDFAL MODEL*/
. 
. ***Heckman correction
. *employment
. heckman ln_inc_emp L.ln_schooling L.ln_tenure_emp L.ln_age L.ln_hrs $personal, select(employee = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.k_windfdy L.k_windfay L.k_windfcy
>  L.k_windfhy L.k_windfgy L.k_windffy L.k_windfiy) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3718
(regression model with sample selection)        Censored obs       =      1337
                                                Uncensored obs     =      2381

                                                Wald chi2(26)      =   2804.65
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_emp     |
  ln_schooling |
           L1. |   .6737033   .0377443    17.85   0.000     .5997258    .7476807
               |
 ln_tenure_emp |
           L1. |   .1312794   .0348837     3.76   0.000     .0629087    .1996501
               |
        ln_age |
           L1. |    .201391   .0585261     3.44   0.001     .0866819    .3161001
               |
        ln_hrs |
           L1. |   .8422109   .0291031    28.94   0.000     .7851699    .8992519
               |
       married |
           L1. |   .0467578   .0288285     1.62   0.105    -.0097449    .1032606
               |
         black |   .3114775   .0968684     3.22   0.001      .121619     .501336
         asian |   .0841824   .1206454     0.70   0.485    -.1522782     .320643
        female |  -.3570564    .027545   -12.96   0.000    -.4110436   -.3030692
          ind2 |    .392683   .1370335     2.87   0.004     .1241023    .6612637
          ind3 |   .3333622   .1263929     2.64   0.008     .0856367    .5810877
          ind4 |   .2975031   .1265239     2.35   0.019     .0495207    .5454854
          ind5 |   .2695763   .1230285     2.19   0.028     .0284448    .5107078
          ind6 |   .0208303    .122053     0.17   0.864    -.2183892    .2600499
          ind7 |   .1507286   .1218169     1.24   0.216    -.0880281    .3894854
          ind8 |   .3400224   .1214424     2.80   0.005     .1019996    .5780452
          ind9 |   .2864887   .1219167     2.35   0.019     .0475364    .5254409
         ind10 |   .1280417   .1212453     1.06   0.291    -.1095947    .3656781
               |
        London |
           L1. |   .2796255   .0371923     7.52   0.000       .20673    .3525211
               |
         Wales |
           L1. |    .015529   .0583175     0.27   0.790    -.0987711    .1298291
               |
      Scotland |
           L1. |  -.1122865   .0453552    -2.48   0.013    -.2011812   -.0233919
               |
          NIrl |
           L1. |  -.2412904   .1742633    -1.38   0.166    -.5828402    .1002594
               |
     m_selfemp |
           L1. |   .0284238   .0434072     0.65   0.513    -.0566527    .1135003
               |
     f_selfemp |
           L1. |  -.1726817   .0334077    -5.17   0.000    -.2381595   -.1072038
               |
  health_limit |
           L1. |  -.2339152   .0529862    -4.41   0.000    -.3377663   -.1300641
               |
      bornAway |  -.1000701   .0592562    -1.69   0.091    -.2162102      .01607
               |
        nokids |
           L1. |  -.0841676   .0248217    -3.39   0.001    -.1328174   -.0355179
               |
         _cons |   3.913597   .2631792    14.87   0.000     3.397775    4.429419
---------------+----------------------------------------------------------------
employee       |
       married |
           L1. |   .0698527   .0636049     1.10   0.272    -.0548107    .1945161
               |
         black |    .028321    .262676     0.11   0.914    -.4865146    .5431565
         asian |  -.3055356   .2262985    -1.35   0.177    -.7490726    .1380014
        female |  -.0359822   .0532258    -0.68   0.499    -.1403029    .0683385
          ind2 |   .5962421    .238099     2.50   0.012     .1295766    1.062908
          ind3 |   1.051247   .2065538     5.09   0.000      .646409    1.456085
          ind4 |   1.058318   .2110037     5.02   0.000     .6447589    1.471878
          ind5 |    .430692   .1834445     2.35   0.019     .0711473    .7902367
          ind6 |   .2436883   .1797945     1.36   0.175    -.1087024    .5960791
          ind7 |   .5631948   .1788462     3.15   0.002     .2126628    .9137269
          ind8 |   .4355686   .1781293     2.45   0.014     .0864416    .7846955
          ind9 |   .6905352   .1792529     3.85   0.000      .339206    1.041864
         ind10 |   .4518787   .1784677     2.53   0.011     .1020885     .801669
               |
        London |
           L1. |   .0959505   .0897242     1.07   0.285    -.0799057    .2718068
               |
         Wales |
           L1. |   .0454554   .1346497     0.34   0.736    -.2184532     .309364
               |
      Scotland |
           L1. |  -.0937704   .0912926    -1.03   0.304    -.2727005    .0851598
               |
          NIrl |
           L1. |  -.3543105   .2494833    -1.42   0.156    -.8432887    .1346677
               |
     m_selfemp |
           L1. |  -.1014133    .084164    -1.20   0.228    -.2663717     .063545
               |
     f_selfemp |
           L1. |   .0572628    .070801     0.81   0.419    -.0815045    .1960302
               |
  health_limit |
           L1. |  -.1234407    .105217    -1.17   0.241    -.3296623    .0827808
               |
      bornAway |  -.0637695   .1176557    -0.54   0.588    -.2943705    .1668315
               |
        nokids |
           L1. |   .1179308   .0546679     2.16   0.031     .0107837    .2250779
               |
  ln_schooling |
           L1. |  -.0138076   .0865298    -0.16   0.873    -.1834029    .1557878
               |
ln_tenure_diff |
           L1. |  -.6129391   .0224162   -27.34   0.000    -.6568741   -.5690041
               |
        ln_age |
           L1. |  -1.131324   .1163921    -9.72   0.000    -1.359448   -.9031994
               |
     k_windfdy |
           L1. |  -.0320153   .0130351    -2.46   0.014    -.0575636    -.006467
               |
     k_windfay |
           L1. |   .0380835   .0222967     1.71   0.088    -.0056173    .0817843
               |
     k_windfcy |
           L1. |  -.0375709   .0564427    -0.67   0.506    -.1481965    .0730547
               |
     k_windfhy |
           L1. |  -.0021997   .0080595    -0.27   0.785     -.017996    .0135965
               |
     k_windfgy |
           L1. |  -.4720135   .2258841    -2.09   0.037    -.9147381   -.0292888
               |
     k_windffy |
           L1. |  -.0034519   .0060532    -0.57   0.569     -.015316    .0084123
               |
     k_windfiy |
           L1. |   .0639569   .0729043     0.88   0.380    -.0789329    .2068467
               |
         _cons |   3.308046   .4835527     6.84   0.000       2.3603    4.255792
---------------+----------------------------------------------------------------
mills          |
        lambda |    .078834   .0530692     1.49   0.137    -.0251796    .1828477
---------------+----------------------------------------------------------------
           rho |    0.14685
         sigma |  .53684942
--------------------------------------------------------------------------------

. predict expinc_emp_np
(option xb assumed; fitted values)
(195479 missing values generated)

. 
. heckman ln_inc_emp L.ln_schooling L.ln_tenure_emp L.ln_age L.ln_hrs $personal, select(employee = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.ln_windfdy L.ln_windfay L.ln_wind
> fcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3718
(regression model with sample selection)        Censored obs       =      1337
                                                Uncensored obs     =      2381

                                                Wald chi2(26)      =   2804.89
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_emp     |
  ln_schooling |
           L1. |   .6734944   .0377349    17.85   0.000     .5995354    .7474534
               |
 ln_tenure_emp |
           L1. |   .1284731   .0348069     3.69   0.000     .0602527    .1966934
               |
        ln_age |
           L1. |   .2040391   .0585889     3.48   0.000     .0892069    .3188712
               |
        ln_hrs |
           L1. |   .8426133   .0291037    28.95   0.000      .785571    .8996555
               |
       married |
           L1. |   .0467959    .028821     1.62   0.104    -.0096922     .103284
               |
         black |   .3116144   .0968326     3.22   0.001     .1218259    .5014029
         asian |    .083175   .1206172     0.69   0.490    -.1532304    .3195804
        female |  -.3572008   .0275401   -12.97   0.000    -.4111783   -.3032233
          ind2 |    .389138   .1369488     2.84   0.004     .1207233    .6575527
          ind3 |   .3295708   .1263834     2.61   0.009     .0818639    .5772777
          ind4 |   .2934904    .126487     2.32   0.020     .0455805    .5414004
          ind5 |   .2665616   .1229739     2.17   0.030     .0255372     .507586
          ind6 |   .0187429   .1220425     0.15   0.878     -.220456    .2579418
          ind7 |    .147842   .1217857     1.21   0.225    -.0908536    .3865376
          ind8 |   .3376041   .1214485     2.78   0.005     .0995694    .5756388
          ind9 |   .2835249   .1218994     2.33   0.020     .0446064    .5224434
         ind10 |   .1259945    .121255     1.04   0.299     -.111661      .36365
               |
        London |
           L1. |   .2791654   .0371743     7.51   0.000     .2063051    .3520257
               |
         Wales |
           L1. |    .014902   .0583179     0.26   0.798    -.0993989    .1292029
               |
      Scotland |
           L1. |  -.1119791   .0453472    -2.47   0.014    -.2008579   -.0231003
               |
          NIrl |
           L1. |  -.2417983   .1742813    -1.39   0.165    -.5833834    .0997868
               |
     m_selfemp |
           L1. |   .0296709   .0433572     0.68   0.494    -.0553076    .1146494
               |
     f_selfemp |
           L1. |  -.1727528   .0333995    -5.17   0.000    -.2382146   -.1072911
               |
  health_limit |
           L1. |  -.2338696   .0529763    -4.41   0.000    -.3377013    -.130038
               |
      bornAway |  -.0994859   .0592355    -1.68   0.093    -.2155855    .0166136
               |
        nokids |
           L1. |  -.0844175   .0248114    -3.40   0.001     -.133047    -.035788
               |
         _cons |   3.915612   .2631219    14.88   0.000     3.399902    4.431321
---------------+----------------------------------------------------------------
employee       |
       married |
           L1. |   .0735026   .0635881     1.16   0.248    -.0511279     .198133
               |
         black |   .0123521   .2623109     0.05   0.962    -.5017678     .526472
         asian |  -.3157953   .2262277    -1.40   0.163    -.7591934    .1276027
        female |  -.0413918   .0532092    -0.78   0.437    -.1456799    .0628963
          ind2 |    .581179    .237361     2.45   0.014     .1159599    1.046398
          ind3 |   1.045287    .206586     5.06   0.000     .6403854    1.450188
          ind4 |   1.056776   .2108743     5.01   0.000     .6434695    1.470082
          ind5 |     .42553   .1831948     2.32   0.020     .0664748    .7845851
          ind6 |   .2426674   .1796956     1.35   0.177    -.1095294    .5948643
          ind7 |   .5653021   .1786832     3.16   0.002     .2150894    .9155149
          ind8 |   .4378613   .1779932     2.46   0.014     .0890011    .7867215
          ind9 |   .6958487   .1790884     3.89   0.000     .3448419    1.046856
         ind10 |   .4471828     .17838     2.51   0.012     .0975645    .7968012
               |
        London |
           L1. |   .1044983   .0896894     1.17   0.244    -.0712896    .2802862
               |
         Wales |
           L1. |   .0571169   .1350088     0.42   0.672    -.2074955    .3217293
               |
      Scotland |
           L1. |  -.0887483   .0913634    -0.97   0.331    -.2678172    .0903207
               |
          NIrl |
           L1. |  -.3688311   .2493269    -1.48   0.139    -.8575029    .1198407
               |
     m_selfemp |
           L1. |  -.0996498   .0843854    -1.18   0.238    -.2650421    .0657425
               |
     f_selfemp |
           L1. |   .0560144   .0708408     0.79   0.429     -.082831    .1948598
               |
  health_limit |
           L1. |  -.1280121   .1050901    -1.22   0.223     -.333985    .0779607
               |
      bornAway |  -.0610594   .1178722    -0.52   0.604    -.2920847     .169966
               |
        nokids |
           L1. |   .1236426   .0546855     2.26   0.024      .016461    .2308242
               |
  ln_schooling |
           L1. |  -.0040372    .086449    -0.05   0.963     -.173474    .1653997
               |
ln_tenure_diff |
           L1. |  -.6146888   .0224451   -27.39   0.000    -.6586804   -.5706971
               |
        ln_age |
           L1. |  -1.123724   .1168371    -9.62   0.000     -1.35272   -.8947273
               |
    ln_windfdy |
           L1. |  -.0713609   .0262362    -2.72   0.007    -.1227829   -.0199388
               |
    ln_windfay |
           L1. |     .05326   .0257257     2.07   0.038     .0028385    .1036815
               |
    ln_windfcy |
           L1. |  -.0028846   .0338168    -0.09   0.932    -.0691643     .063395
               |
    ln_windfhy |
           L1. |  -.0029241   .0255307    -0.11   0.909    -.0529633    .0471151
               |
    ln_windfgy |
           L1. |  -.0637777   .0225211    -2.83   0.005    -.1079183   -.0196372
               |
    ln_windffy |
           L1. |   -.017957   .0204742    -0.88   0.380    -.0580856    .0221716
               |
    ln_windfiy |
           L1. |   .0179221     .02586     0.69   0.488    -.0327626    .0686067
               |
         _cons |   3.263188   .4851573     6.73   0.000     2.312297    4.214079
---------------+----------------------------------------------------------------
mills          |
        lambda |   .0729875   .0531151     1.37   0.169    -.0311161    .1770912
---------------+----------------------------------------------------------------
           rho |    0.13603
         sigma |  .53655793
--------------------------------------------------------------------------------

. predict expinc_emp_npl
(option xb assumed; fitted values)
(195479 missing values generated)

. 
. heckman ln_inc_emp L.ln_schooling L.ln_tenure_emp L.ln_age L.ln_hrs $personal, select(employee = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.has_windfdy L.has_windfay L.has_w
> indfcy L.has_windfhy L.has_windfgy L.has_windffy L.has_windfiy) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3718
(regression model with sample selection)        Censored obs       =      1337
                                                Uncensored obs     =      2381

                                                Wald chi2(26)      =   2804.65
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_emp     |
  ln_schooling |
           L1. |   .6736843   .0377431    17.85   0.000     .5997092    .7476595
               |
 ln_tenure_emp |
           L1. |   .1287723   .0348019     3.70   0.000     .0605618    .1969827
               |
        ln_age |
           L1. |   .2034701   .0586639     3.47   0.001      .088491    .3184491
               |
        ln_hrs |
           L1. |   .8425205   .0291076    28.95   0.000     .7854707    .8995702
               |
       married |
           L1. |   .0468365   .0288222     1.63   0.104    -.0096539     .103327
               |
         black |   .3117552   .0968372     3.22   0.001     .1219577    .5015526
         asian |   .0831351   .1206198     0.69   0.491    -.1532754    .3195456
        female |  -.3572104   .0275396   -12.97   0.000    -.4111871   -.3032337
          ind2 |   .3894865   .1369501     2.84   0.004     .1210693    .6579037
          ind3 |   .3301738   .1264149     2.61   0.009     .0824052    .5779424
          ind4 |   .2940143    .126502     2.32   0.020      .046075    .5419536
          ind5 |   .2669565   .1229863     2.17   0.030     .0259077    .5080052
          ind6 |   .0188724   .1220321     0.15   0.877    -.2203062     .258051
          ind7 |   .1482923   .1218052     1.22   0.223    -.0904415     .387026
          ind8 |   .3379714   .1214586     2.78   0.005      .099917    .5760259
          ind9 |   .2839652   .1219154     2.33   0.020     .0450155     .522915
         ind10 |   .1263968    .121272     1.04   0.297     -.111292    .3640857
               |
        London |
           L1. |   .2792159   .0371764     7.51   0.000     .2063514    .3520803
               |
         Wales |
           L1. |   .0150867   .0583283     0.26   0.796    -.0992346     .129408
               |
      Scotland |
           L1. |  -.1120269   .0453489    -2.47   0.013     -.200909   -.0231448
               |
          NIrl |
           L1. |   -.241878   .1742807    -1.39   0.165    -.5834618    .0997058
               |
     m_selfemp |
           L1. |   .0295131   .0433652     0.68   0.496    -.0554812    .1145073
               |
     f_selfemp |
           L1. |  -.1726878   .0334013    -5.17   0.000    -.2381531   -.1072224
               |
  health_limit |
           L1. |    -.23387   .0529774    -4.41   0.000    -.3377038   -.1300362
               |
      bornAway |  -.0993685    .059233    -1.68   0.093     -.215463    .0167261
               |
        nokids |
           L1. |  -.0843961   .0248124    -3.40   0.001    -.1330275   -.0357647
               |
         _cons |   3.915993   .2631199    14.88   0.000     3.400288    4.431699
---------------+----------------------------------------------------------------
employee       |
       married |
           L1. |   .0725538   .0635885     1.14   0.254    -.0520773    .1971849
               |
         black |   .0161416   .2631689     0.06   0.951      -.49966    .5319433
         asian |  -.3191158   .2264495    -1.41   0.159    -.7629488    .1247171
        female |  -.0428748    .053218    -0.81   0.420    -.1471802    .0614306
          ind2 |   .5751849   .2373032     2.42   0.015     .1100793    1.040291
          ind3 |   1.045886   .2067157     5.06   0.000     .6407304    1.451041
          ind4 |   1.055706   .2108003     5.01   0.000     .6425447    1.468867
          ind5 |   .4226143   .1831919     2.31   0.021     .0635647    .7816638
          ind6 |   .2398465     .17968     1.33   0.182    -.1123198    .5920128
          ind7 |   .5657002    .178703     3.17   0.002     .2154487    .9159517
          ind8 |   .4343903   .1779884     2.44   0.015     .0855395    .7832411
          ind9 |   .6952145   .1791025     3.88   0.000     .3441801    1.046249
         ind10 |   .4461843   .1784443     2.50   0.012       .09644    .7959286
               |
        London |
           L1. |   .1049988   .0897209     1.17   0.242    -.0708508    .2808485
               |
         Wales |
           L1. |   .0612284   .1351054     0.45   0.650    -.2035732      .32603
               |
      Scotland |
           L1. |  -.0904118   .0913938    -0.99   0.323    -.2695403    .0887167
               |
          NIrl |
           L1. |  -.3691256   .2493958    -1.48   0.139    -.8579324    .1196811
               |
     m_selfemp |
           L1. |  -.1027097   .0844507    -1.22   0.224    -.2682301    .0628107
               |
     f_selfemp |
           L1. |   .0591602   .0708588     0.83   0.404    -.0797205     .198041
               |
  health_limit |
           L1. |  -.1270641   .1050062    -1.21   0.226    -.3328724    .0787442
               |
      bornAway |  -.0628256   .1179594    -0.53   0.594    -.2940217    .1683705
               |
        nokids |
           L1. |   .1263274   .0546588     2.31   0.021     .0191981    .2334567
               |
  ln_schooling |
           L1. |   .0058593   .0862601     0.07   0.946    -.1632074    .1749261
               |
ln_tenure_diff |
           L1. |  -.6166466   .0224507   -27.47   0.000    -.6606492   -.5726441
               |
        ln_age |
           L1. |  -1.120507   .1167662    -9.60   0.000    -1.349364   -.8916491
               |
   has_windfdy |
           L1. |  -.6221643   .2274718    -2.74   0.006    -1.068001   -.1763278
               |
   has_windfay |
           L1. |   .4050558   .2156884     1.88   0.060    -.0176856    .8277972
               |
   has_windfcy |
           L1. |  -.0290362    .270454    -0.11   0.915    -.5591163     .501044
               |
   has_windfhy |
           L1. |  -.1339055   .1949462    -0.69   0.492    -.5159931    .2481821
               |
   has_windfgy |
           L1. |  -.2313945   .0929264    -2.49   0.013    -.4135268   -.0492621
               |
   has_windffy |
           L1. |  -.2421726   .1883313    -1.29   0.198    -.6112951      .12695
               |
   has_windfiy |
           L1. |   .1088041   .1901604     0.57   0.567    -.2639035    .4815116
               |
         _cons |    3.22884   .4849478     6.66   0.000      2.27836     4.17932
---------------+----------------------------------------------------------------
mills          |
        lambda |   .0737306   .0531499     1.39   0.165    -.0304413    .1779025
---------------+----------------------------------------------------------------
           rho |    0.13740
         sigma |  .53659453
--------------------------------------------------------------------------------

. predict expinc_emp_npd
(option xb assumed; fitted values)
(195479 missing values generated)

. 
. heckman ln_inc_emp L.ln_schooling L.ln_tenure_emp L.ln_age L.ln_hrs $personal, select(employee = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.windfdy5 L.windfay5 L.windfcy5 L.
> windfhy5 L.windfgy5 L.windffy5 L.windfiy5) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3718
(regression model with sample selection)        Censored obs       =      1337
                                                Uncensored obs     =      2381

                                                Wald chi2(26)      =   2804.11
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_emp     |
  ln_schooling |
           L1. |   .6744251   .0377766    17.85   0.000     .6003843    .7484659
               |
 ln_tenure_emp |
           L1. |   .1365336   .0347498     3.93   0.000     .0684252    .2046419
               |
        ln_age |
           L1. |   .1952797    .058566     3.33   0.001     .0804925     .310067
               |
        ln_hrs |
           L1. |   .8413354   .0291025    28.91   0.000     .7842955    .8983753
               |
       married |
           L1. |   .0468076   .0288466     1.62   0.105    -.0097308     .103346
               |
         black |   .3115858   .0969512     3.21   0.001      .121565    .5016066
         asian |   .0847522   .1206927     0.70   0.483    -.1518012    .3213055
        female |  -.3568661   .0275532   -12.95   0.000    -.4108695   -.3028628
          ind2 |   .3987944   .1370228     2.91   0.004     .1302346    .6673542
          ind3 |   .3420168   .1265093     2.70   0.007     .0940632    .5899705
          ind4 |   .3061429   .1266132     2.42   0.016     .0579856    .5543002
          ind5 |   .2755361   .1230733     2.24   0.025     .0343168    .5167555
          ind6 |   .0254125   .1220805     0.21   0.835    -.2138609    .2646858
          ind7 |   .1570388   .1218902     1.29   0.198    -.0818616    .3959392
          ind8 |   .3456481   .1214815     2.85   0.004     .1075488    .5837474
          ind9 |   .2931639   .1219922     2.40   0.016     .0540637    .5322642
         ind10 |    .133172    .121297     1.10   0.272    -.1045658    .3709097
               |
        London |
           L1. |   .2805472   .0372284     7.54   0.000     .2075808    .3535136
               |
         Wales |
           L1. |   .0170276   .0583427     0.29   0.770    -.0973219    .1313772
               |
      Scotland |
           L1. |  -.1134114   .0453947    -2.50   0.012    -.2023834   -.0244395
               |
          NIrl |
           L1. |  -.2415692   .1742343    -1.39   0.166    -.5830622    .0999238
               |
     m_selfemp |
           L1. |   .0266586   .0434005     0.61   0.539    -.0584049    .1117221
               |
     f_selfemp |
           L1. |   -.172606   .0334264    -5.16   0.000    -.2381206   -.1070914
               |
  health_limit |
           L1. |  -.2345978   .0530161    -4.43   0.000    -.3385076   -.1306881
               |
      bornAway |  -.1004326   .0592778    -1.69   0.090     -.216615    .0157498
               |
        nokids |
           L1. |   -.083905   .0248348    -3.38   0.001    -.1325803   -.0352298
               |
         _cons |   3.912167    .263261    14.86   0.000     3.396185    4.428149
---------------+----------------------------------------------------------------
employee       |
       married |
           L1. |   .0717526   .0636257     1.13   0.259    -.0529514    .1964567
               |
         black |   .0351985   .2636496     0.13   0.894    -.4815451    .5519422
         asian |  -.3058226   .2268352    -1.35   0.178    -.7504115    .1387663
        female |  -.0364221   .0531381    -0.69   0.493    -.1405709    .0677267
          ind2 |   .5736037   .2371441     2.42   0.016     .1088098    1.038398
          ind3 |   1.044146   .2062617     5.06   0.000     .6398802    1.448411
          ind4 |   1.070824   .2108061     5.08   0.000     .6576518    1.483997
          ind5 |   .4367892   .1830599     2.39   0.017     .0779984      .79558
          ind6 |   .2406847   .1794275     1.34   0.180    -.1109868    .5923563
          ind7 |   .5661129   .1785299     3.17   0.002     .2162008    .9160251
          ind8 |   .4387795   .1777725     2.47   0.014     .0903518    .7872072
          ind9 |   .6953506   .1788835     3.89   0.000     .3447453    1.045956
         ind10 |   .4501395   .1780908     2.53   0.011     .1010879    .7991912
               |
        London |
           L1. |   .1015522   .0899071     1.13   0.259    -.0746625    .2777669
               |
         Wales |
           L1. |   .0574412   .1346461     0.43   0.670    -.2064602    .3213427
               |
      Scotland |
           L1. |  -.0953999   .0911693    -1.05   0.295    -.2740885    .0832886
               |
          NIrl |
           L1. |  -.3370234   .2501202    -1.35   0.178    -.8272499    .1532031
               |
     m_selfemp |
           L1. |  -.0971612   .0843473    -1.15   0.249     -.262479    .0681565
               |
     f_selfemp |
           L1. |   .0599599   .0707961     0.85   0.397    -.0787979    .1987177
               |
  health_limit |
           L1. |   -.116234   .1052757    -1.10   0.270    -.3225705    .0901025
               |
      bornAway |  -.0569893   .1178547    -0.48   0.629    -.2879802    .1740017
               |
        nokids |
           L1. |   .1202649   .0546154     2.20   0.028     .0132206    .2273092
               |
  ln_schooling |
           L1. |  -.0158849   .0862886    -0.18   0.854    -.1850076    .1532377
               |
ln_tenure_diff |
           L1. |  -.6175954   .0224566   -27.50   0.000    -.6616095   -.5735812
               |
        ln_age |
           L1. |  -1.153926   .1166143    -9.90   0.000    -1.382486   -.9253661
               |
      windfdy5 |
           L1. |  -.7095378   .3049563    -2.33   0.020    -1.307241   -.1118345
               |
      windfay5 |
           L1. |   .7836732   .3682737     2.13   0.033       .06187    1.505476
               |
      windfcy5 |
           L1. |  -.6626671   .5823081    -1.14   0.255     -1.80397    .4786358
               |
      windfhy5 |
           L1. |   .3970696   .3862906     1.03   0.304    -.3600461    1.154185
               |
      windfgy5 |
           L1. |  -5.791284          .        .       .            .           .
               |
      windffy5 |
           L1. |    .088556   .2293336     0.39   0.699    -.3609295    .5380416
               |
      windfiy5 |
           L1. |   .1806841   .6950813     0.26   0.795     -1.18165    1.543018
               |
         _cons |   3.377239   .4842689     6.97   0.000     2.428089    4.326388
---------------+----------------------------------------------------------------
mills          |
        lambda |   .0911155   .0529682     1.72   0.085    -.0127002    .1949312
---------------+----------------------------------------------------------------
           rho |    0.16951
         sigma |  .53753321
--------------------------------------------------------------------------------

. predict expinc_emp_np5
(option xb assumed; fitted values)
(195479 missing values generated)

. 
. *selfemployment
. //amounts
. heckman ln_inc_self L.ln_schooling L.ln_tenure_self L.ln_age L.ln_hrs $personal, select(selfemp = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.k_windfdy L.k_windfay L.k_windfc
> y L.k_windfhy L.k_windfgy L.k_windffy L.k_windfiy) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3484
(regression model with sample selection)        Censored obs       =      2799
                                                Uncensored obs     =       685

                                                Wald chi2(26)      =     73.24
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_self    |
  ln_schooling |
           L1. |  -.5806753   .3733807    -1.56   0.120    -1.312488    .1511374
               |
ln_tenure_self |
           L1. |   .6485354   .2782182     2.33   0.020     .1032378    1.193833
               |
        ln_age |
           L1. |    .787777   .5864834     1.34   0.179    -.3617095    1.937263
               |
        ln_hrs |
           L1. |   .9552638   .2330585     4.10   0.000     .4984775     1.41205
               |
       married |
           L1. |  -.0069406   .2960742    -0.02   0.981    -.5872353    .5733541
               |
         black |   2.254542   1.950231     1.16   0.248    -1.567841    6.076925
         asian |  -.3212532    .881822    -0.36   0.716    -2.049593    1.407086
        female |  -.5221692   .2598255    -2.01   0.044    -1.031418   -.0129206
          ind2 |  -.6794034   1.041646    -0.65   0.514    -2.720991    1.362184
          ind3 |   1.477472   .9810566     1.51   0.132    -.4453634    3.400308
          ind4 |  -1.329076   1.011896    -1.31   0.189    -3.312355    .6542038
          ind5 |   -.293032   .5728403    -0.51   0.609    -1.415778    .8297144
          ind6 |  -.1947019   .5297996    -0.37   0.713     -1.23309    .8436862
          ind7 |   .0991034   .5361544     0.18   0.853      -.95174    1.149947
          ind8 |   1.031824   .5271566     1.96   0.050    -.0013842    2.065032
          ind9 |   .5248841   .5726777     0.92   0.359    -.5975435    1.647312
         ind10 |   .0534548   .5604624     0.10   0.924    -1.045031    1.151941
               |
        London |
           L1. |  -.4886961   .4385264    -1.11   0.265    -1.348192    .3707999
               |
         Wales |
           L1. |   .9834794   .6050033     1.63   0.104    -.2023052    2.169264
               |
      Scotland |
           L1. |  -.5163538   .3471291    -1.49   0.137    -1.196714    .1640067
               |
          NIrl |
           L1. |  -.2148886   .9109405    -0.24   0.814    -2.000299    1.570522
               |
     m_selfemp |
           L1. |   .1320609   .3282928     0.40   0.687    -.5113811    .7755029
               |
     f_selfemp |
           L1. |   -.543601   .3139607    -1.73   0.083    -1.158953    .0717506
               |
  health_limit |
           L1. |  -.3218642   .3697405    -0.87   0.384    -1.046542    .4028139
               |
      bornAway |  -.0994031   .4415079    -0.23   0.822    -.9647426    .7659365
               |
        nokids |
           L1. |  -.1639557   .2451295    -0.67   0.504    -.6444006    .3164893
               |
         _cons |   1.818701   2.757439     0.66   0.510    -3.585779    7.223182
---------------+----------------------------------------------------------------
selfemp        |
       married |
           L1. |   .0723334   .0764825     0.95   0.344    -.0775695    .2222363
               |
         black |  -.2243801   .4052383    -0.55   0.580    -1.018633    .5698724
         asian |  -.1365295   .2550457    -0.54   0.592    -.6364099    .3633509
        female |  -.1011707   .0620994    -1.63   0.103    -.2228833    .0205419
          ind2 |  -.7592625   .2706135    -2.81   0.005    -1.289655   -.2288698
          ind3 |  -1.316739   .2386297    -5.52   0.000    -1.784444   -.8490329
          ind4 |  -1.282371   .2409678    -5.32   0.000    -1.754659   -.8100831
          ind5 |  -.5684281   .1926114    -2.95   0.003    -.9459395   -.1909167
          ind6 |  -.4853115   .1872168    -2.59   0.010    -.8522497   -.1183734
          ind7 |  -.6645471   .1858252    -3.58   0.000    -1.028758   -.3003364
          ind8 |  -.5384236   .1855081    -2.90   0.004    -.9020129   -.1748344
          ind9 |  -.7315642   .1871505    -3.91   0.000    -1.098372    -.364756
         ind10 |  -.6088607   .1867141    -3.26   0.001    -.9748137   -.2429078
               |
        London |
           L1. |  -.1570396      .1075    -1.46   0.144    -.3677357    .0536566
               |
         Wales |
           L1. |  -.2958345   .1676484    -1.76   0.078    -.6244194    .0327504
               |
      Scotland |
           L1. |   .0810158   .1034468     0.78   0.434    -.1217363    .2837679
               |
          NIrl |
           L1. |  -.0672268   .2710916    -0.25   0.804    -.5985565     .464103
               |
     m_selfemp |
           L1. |    .146753   .0973465     1.51   0.132    -.0440426    .3375486
               |
     f_selfemp |
           L1. |  -.2670583   .0855461    -3.12   0.002    -.4347256   -.0993911
               |
  health_limit |
           L1. |  -.0293795   .1187968    -0.25   0.805    -.2622169    .2034579
               |
      bornAway |   .1283788   .1279704     1.00   0.316    -.1224386    .3791962
               |
        nokids |
           L1. |  -.0606302   .0642802    -0.94   0.346    -.1866171    .0653567
               |
  ln_schooling |
           L1. |  -.0067774   .1005213    -0.07   0.946    -.2037955    .1902407
               |
ln_tenure_diff |
           L1. |   .5824818   .0260792    22.34   0.000     .5313675    .6335962
               |
        ln_age |
           L1. |   1.120929   .1368783     8.19   0.000     .8526523    1.389205
               |
     k_windfdy |
           L1. |      .0274   .0136561     2.01   0.045     .0006345    .0541654
               |
     k_windfay |
           L1. |  -.1048755   .0608504    -1.72   0.085    -.2241401     .014389
               |
     k_windfcy |
           L1. |  -.0132058   .0943338    -0.14   0.889    -.1980966     .171685
               |
     k_windfhy |
           L1. |   .0076878   .0071094     1.08   0.280    -.0062464     .021622
               |
     k_windfgy |
           L1. |   .5918819   .2573523     2.30   0.021     .0874806    1.096283
               |
     k_windffy |
           L1. |   .0033406   .0084687     0.39   0.693    -.0132578     .019939
               |
     k_windfiy |
           L1. |  -.0095327   .0733542    -0.13   0.897    -.1533043    .1342388
               |
         _cons |  -3.669263   .5539285    -6.62   0.000    -4.754943   -2.583583
---------------+----------------------------------------------------------------
mills          |
        lambda |   .7575425   .3877524     1.95   0.051    -.0024383    1.517523
---------------+----------------------------------------------------------------
           rho |    0.27865
         sigma |  2.7185853
--------------------------------------------------------------------------------

. predict expinc_self_np
(option xb assumed; fitted values)
(213471 missing values generated)

. //amounts in logs
. heckman ln_inc_self L.ln_schooling L.ln_tenure_self L.ln_age L.ln_hrs $personal, select(selfemp = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.ln_windfdy L.ln_windfay L.ln_win
> dfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3484
(regression model with sample selection)        Censored obs       =      2799
                                                Uncensored obs     =       685

                                                Wald chi2(26)      =     70.34
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_self    |
  ln_schooling |
           L1. |  -.5683257   .3719998    -1.53   0.127    -1.297432    .1607804
               |
ln_tenure_self |
           L1. |   .4676303   .2787262     1.68   0.093     -.078663    1.013924
               |
        ln_age |
           L1. |   .5975868    .581495     1.03   0.304    -.5421224    1.737296
               |
        ln_hrs |
           L1. |   .9478731   .2335523     4.06   0.000      .490119    1.405627
               |
       married |
           L1. |   .0125222   .2951551     0.04   0.966    -.5659712    .5910156
               |
         black |   2.379477   1.950392     1.22   0.222    -1.443221    6.202176
         asian |  -.2095013   .8778535    -0.24   0.811    -1.930063     1.51106
        female |  -.5423569   .2590306    -2.09   0.036    -1.050048   -.0346662
          ind2 |  -.5032245   1.040583    -0.48   0.629    -2.542729    1.536281
          ind3 |   1.737697   .9774234     1.78   0.075    -.1780174    3.653412
          ind4 |  -1.087975   1.011436    -1.08   0.282    -3.070353    .8944026
          ind5 |  -.1859115   .5709238    -0.33   0.745    -1.304902    .9330786
          ind6 |  -.1160047   .5271434    -0.22   0.826    -1.149187    .9171773
          ind7 |   .2226681   .5328801     0.42   0.676    -.8217577    1.267094
          ind8 |   1.136502   .5237557     2.17   0.030     .1099601    2.163045
          ind9 |   .6920633   .5690691     1.22   0.224    -.4232917    1.807418
         ind10 |   .1979275   .5568828     0.36   0.722    -.8935427    1.289398
               |
        London |
           L1. |  -.4425529   .4377883    -1.01   0.312    -1.300602    .4154965
               |
         Wales |
           L1. |   .9491361   .6030252     1.57   0.115    -.2327717    2.131044
               |
      Scotland |
           L1. |  -.5321021    .345308    -1.54   0.123    -1.208893    .1446892
               |
          NIrl |
           L1. |  -.3797353   .9060239    -0.42   0.675    -2.155509    1.396039
               |
     m_selfemp |
           L1. |   .1008429   .3267301     0.31   0.758    -.5395364    .7412221
               |
     f_selfemp |
           L1. |  -.4857658   .3122851    -1.56   0.120    -1.097833    .1263017
               |
  health_limit |
           L1. |  -.3497097   .3675392    -0.95   0.341    -1.070073    .3706539
               |
      bornAway |    -.16004   .4394662    -0.36   0.716    -1.021378    .7012978
               |
        nokids |
           L1. |  -.1447715   .2442408    -0.59   0.553    -.6234747    .3339318
               |
         _cons |   3.033448   2.722063     1.11   0.265    -2.301698    8.368594
---------------+----------------------------------------------------------------
selfemp        |
       married |
           L1. |   .0657718    .076383     0.86   0.389    -.0839361    .2154797
               |
         black |  -.2075425   .4045602    -0.51   0.608    -1.000466    .5853809
         asian |  -.1258563   .2546006    -0.49   0.621    -.6248644    .3731518
        female |  -.0907277    .062076    -1.46   0.144    -.2123945     .030939
          ind2 |  -.7350565   .2702311    -2.72   0.007      -1.2647   -.2054133
          ind3 |  -1.298493    .239266    -5.43   0.000    -1.767446   -.8295402
          ind4 |  -1.272349   .2413804    -5.27   0.000    -1.745446   -.7992523
          ind5 |  -.5495584   .1929236    -2.85   0.004    -.9276817   -.1714351
          ind6 |  -.4747289   .1876606    -2.53   0.011    -.8425369    -.106921
          ind7 |  -.6554899   .1863355    -3.52   0.000    -1.020701    -.290279
          ind8 |   -.528393   .1861012    -2.84   0.005    -.8931445   -.1636414
          ind9 |  -.7258777   .1876342    -3.87   0.000    -1.093634   -.3581214
         ind10 |  -.6000821   .1873269    -3.20   0.001    -.9672361   -.2329281
               |
        London |
           L1. |  -.1680398   .1073137    -1.57   0.117    -.3783709    .0422913
               |
         Wales |
           L1. |   -.301585    .168199    -1.79   0.073     -.631249     .028079
               |
      Scotland |
           L1. |   .0745267   .1033552     0.72   0.471    -.1280457    .2770991
               |
          NIrl |
           L1. |  -.0605914   .2699215    -0.22   0.822    -.5896278    .4684451
               |
     m_selfemp |
           L1. |   .1441513   .0976087     1.48   0.140    -.0471583    .3354608
               |
     f_selfemp |
           L1. |  -.2679347   .0856551    -3.13   0.002    -.4358156   -.1000539
               |
  health_limit |
           L1. |  -.0309609   .1184499    -0.26   0.794    -.2631184    .2011967
               |
      bornAway |    .127233   .1280252     0.99   0.320    -.1236918    .3781579
               |
        nokids |
           L1. |    -.06335   .0642722    -0.99   0.324    -.1893212    .0626212
               |
  ln_schooling |
           L1. |  -.0099494   .1003192    -0.10   0.921    -.2065714    .1866726
               |
ln_tenure_diff |
           L1. |   .5836529   .0260152    22.44   0.000     .5326639    .6346418
               |
        ln_age |
           L1. |    1.11265   .1372252     8.11   0.000     .8436933    1.381606
               |
    ln_windfdy |
           L1. |   .0466733   .0322257     1.45   0.148    -.0164878    .1098345
               |
    ln_windfay |
           L1. |  -.0493187   .0312815    -1.58   0.115    -.1106293     .011992
               |
    ln_windfcy |
           L1. |  -.0068452   .0427647    -0.16   0.873    -.0906624     .076972
               |
    ln_windfhy |
           L1. |    -.00955   .0283083    -0.34   0.736    -.0650333    .0459332
               |
    ln_windfgy |
           L1. |   .0723062    .024612     2.94   0.003     .0240675    .1205449
               |
    ln_windffy |
           L1. |   .0235704   .0223133     1.06   0.291    -.0201628    .0673036
               |
    ln_windfiy |
           L1. |  -.0079631   .0288948    -0.28   0.783    -.0645959    .0486697
               |
         _cons |  -3.651467    .555091    -6.58   0.000    -4.739426   -2.563509
---------------+----------------------------------------------------------------
mills          |
        lambda |   .4436796   .3847087     1.15   0.249    -.3103357    1.197695
---------------+----------------------------------------------------------------
           rho |    0.16563
         sigma |  2.6786962
--------------------------------------------------------------------------------

. predict expinc_self_npl
(option xb assumed; fitted values)
(213471 missing values generated)

. //dummies
. heckman ln_inc_self L.ln_schooling L.ln_tenure_self L.ln_age L.ln_hrs $personal, select(selfemp = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.has_windfdy L.has_windfay L.has_
> windfcy L.has_windfhy L.has_windfgy L.has_windffy L.has_windfiy) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3484
(regression model with sample selection)        Censored obs       =      2799
                                                Uncensored obs     =       685

                                                Wald chi2(26)      =     70.44
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_self    |
  ln_schooling |
           L1. |  -.5647416   .3718772    -1.52   0.129    -1.293607    .1641242
               |
ln_tenure_self |
           L1. |   .4757058   .2814827     1.69   0.091    -.0759902    1.027402
               |
        ln_age |
           L1. |   .5991769   .5808702     1.03   0.302    -.5393078    1.737662
               |
        ln_hrs |
           L1. |   .9461391   .2335531     4.05   0.000     .4883835    1.403895
               |
       married |
           L1. |   .0143799   .2950577     0.05   0.961    -.5639226    .5926824
               |
         black |   2.370039   1.950955     1.21   0.224    -1.453762     6.19384
         asian |  -.2134154   .8782193    -0.24   0.808    -1.934694    1.507863
        female |  -.5416589   .2590774    -2.09   0.037    -1.049441   -.0338764
          ind2 |  -.5111051   1.041421    -0.49   0.624    -2.552253    1.530042
          ind3 |   1.724809    .979488     1.76   0.078    -.1949517    3.644571
          ind4 |   -1.10191   1.013671    -1.09   0.277    -3.088669    .8848494
          ind5 |  -.1904479   .5714842    -0.33   0.739    -1.310536    .9296406
          ind6 |  -.1221639   .5280533    -0.23   0.817    -1.157129    .9128016
          ind7 |   .2181949   .5334444     0.41   0.683    -.8273368    1.263727
          ind8 |   1.130082   .5247887     2.15   0.031     .1015155    2.158649
          ind9 |   .6835782   .5706814     1.20   0.231    -.4349368    1.802093
         ind10 |   .1925322   .5576255     0.35   0.730    -.9003937    1.285458
               |
        London |
           L1. |  -.4416663   .4376126    -1.01   0.313    -1.299371    .4160386
               |
         Wales |
           L1. |   .9522755   .6033084     1.58   0.114    -.2301873    2.134738
               |
      Scotland |
           L1. |  -.5306439   .3454345    -1.54   0.124    -1.207683    .1463953
               |
          NIrl |
           L1. |   -.372812   .9068406    -0.41   0.681    -2.150187    1.404563
               |
     m_selfemp |
           L1. |   .1017373   .3268237     0.31   0.756    -.5388253    .7422998
               |
     f_selfemp |
           L1. |   -.484572   .3119269    -1.55   0.120    -1.095937    .1267935
               |
  health_limit |
           L1. |  -.3474661   .3677604    -0.94   0.345    -1.068263    .3733311
               |
      bornAway |  -.1557973   .4399843    -0.35   0.723    -1.018151     .706556
               |
        nokids |
           L1. |  -.1442573   .2442081    -0.59   0.555    -.6228963    .3343817
               |
         _cons |   2.998634   2.726726     1.10   0.271    -2.345651    8.342919
---------------+----------------------------------------------------------------
selfemp        |
       married |
           L1. |   .0626326   .0763198     0.82   0.412    -.0869515    .2122168
               |
         black |  -.2112634   .4052329    -0.52   0.602    -1.005505    .5829785
         asian |  -.1249287   .2548175    -0.49   0.624    -.6243619    .3745044
        female |  -.0911422   .0620696    -1.47   0.142    -.2127963    .0305119
          ind2 |  -.7372237   .2702272    -2.73   0.006    -1.266859   -.2075881
          ind3 |  -1.301887    .239254    -5.44   0.000    -1.770816   -.8329574
          ind4 |  -1.277306   .2412708    -5.29   0.000    -1.750189   -.8044245
          ind5 |  -.5522777   .1930232    -2.86   0.004    -.9305962   -.1739593
          ind6 |  -.4776807   .1876967    -2.54   0.011    -.8455595   -.1098019
          ind7 |  -.6591864   .1864535    -3.54   0.000    -1.024629   -.2937442
          ind8 |  -.5301765   .1862012    -2.85   0.004    -.8951241   -.1652288
          ind9 |  -.7293055   .1877111    -3.89   0.000    -1.097212   -.3613985
         ind10 |  -.6059721   .1875393    -3.23   0.001    -.9735424   -.2384018
               |
        London |
           L1. |  -.1663056   .1073693    -1.55   0.121    -.3767455    .0441343
               |
         Wales |
           L1. |  -.2990767   .1683464    -1.78   0.076    -.6290295    .0308761
               |
      Scotland |
           L1. |   .0743666   .1034126     0.72   0.472    -.1283185    .2770516
               |
          NIrl |
           L1. |  -.0685696   .2698038    -0.25   0.799    -.5973754    .4602361
               |
     m_selfemp |
           L1. |   .1436114   .0977778     1.47   0.142    -.0480296    .3352524
               |
     f_selfemp |
           L1. |  -.2749856   .0857049    -3.21   0.001    -.4429641   -.1070071
               |
  health_limit |
           L1. |  -.0303863   .1181473    -0.26   0.797    -.2619507    .2011781
               |
      bornAway |   .1246402   .1280879     0.97   0.331    -.1264075    .3756879
               |
        nokids |
           L1. |  -.0647152   .0641975    -1.01   0.313    -.1905399    .0611095
               |
  ln_schooling |
           L1. |  -.0201768    .099962    -0.20   0.840    -.2160988    .1757452
               |
ln_tenure_diff |
           L1. |   .5863288   .0259965    22.55   0.000     .5353766    .6372811
               |
        ln_age |
           L1. |   1.122241   .1370884     8.19   0.000     .8535524    1.390929
               |
   has_windfdy |
           L1. |   .3702773     .28178     1.31   0.189    -.1820013     .922556
               |
   has_windfay |
           L1. |  -.3147807   .2524086    -1.25   0.212    -.8094925    .1799311
               |
   has_windfcy |
           L1. |   .0035655   .3311874     0.01   0.991      -.64555    .6526809
               |
   has_windfhy |
           L1. |  -.1534804   .2302599    -0.67   0.505    -.6047814    .2978206
               |
   has_windfgy |
           L1. |   .2359115   .1032568     2.28   0.022     .0335319    .4382912
               |
   has_windffy |
           L1. |   .2708988   .2041982     1.33   0.185    -.1293224      .67112
               |
   has_windfiy |
           L1. |   -.035688   .2135206    -0.17   0.867    -.4541806    .3828046
               |
         _cons |  -3.648455   .5545081    -6.58   0.000    -4.735271   -2.561639
---------------+----------------------------------------------------------------
mills          |
        lambda |   .4570886   .3902493     1.17   0.241     -.307786    1.221963
---------------+----------------------------------------------------------------
           rho |    0.17055
         sigma |  2.6801087
--------------------------------------------------------------------------------

. predict expinc_self_npd
(option xb assumed; fitted values)
(213471 missing values generated)

. //above 5k
. heckman ln_inc_self L.ln_schooling L.ln_tenure_self L.ln_age L.ln_hrs $personal, select(selfemp = $personal L.ln_schooling L.ln_tenure_diff L.ln_age L.windfdy5 L.windfay5 L.windfcy5 L
> .windfhy5 L.windfgy5 L.windffy5 L.windfiy5) twostep

Heckman selection model -- two-step estimates   Number of obs      =      3484
(regression model with sample selection)        Censored obs       =      2799
                                                Uncensored obs     =       685

                                                Wald chi2(26)      =     72.51
                                                Prob > chi2        =    0.0000

--------------------------------------------------------------------------------
               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
ln_inc_self    |
  ln_schooling |
           L1. |   -.568109   .3730121    -1.52   0.128    -1.299199    .1629812
               |
ln_tenure_self |
           L1. |   .6321886    .288665     2.19   0.029     .0664156    1.197962
               |
        ln_age |
           L1. |   .7631868   .5896833     1.29   0.196    -.3925711    1.918945
               |
        ln_hrs |
           L1. |   .9409177   .2331723     4.04   0.000     .4839084    1.397927
               |
       married |
           L1. |   .0013824   .2958844     0.00   0.996    -.5785404    .5813052
               |
         black |    2.26275   1.951903     1.16   0.246     -1.56291    6.088409
         asian |  -.3124818   .8830325    -0.35   0.723    -2.043194     1.41823
        female |  -.5312025   .2596046    -2.05   0.041    -1.040018   -.0223868
          ind2 |  -.6592084   1.044246    -0.63   0.528    -2.705893    1.387476
          ind3 |   1.499219   .9872492     1.52   0.129     -.435754    3.434192
          ind4 |  -1.310865   1.017962    -1.29   0.198    -3.306033    .6843035
          ind5 |  -.2804926   .5743034    -0.49   0.625    -1.406107    .8451214
          ind6 |  -.1901218   .5310915    -0.36   0.720    -1.231042    .8507985
          ind7 |   .1173679   .5373539     0.22   0.827    -.9358263    1.170562
          ind8 |     1.0387   .5292046     1.96   0.050     .0014777    2.075921
          ind9 |   .5440944   .5758852     0.94   0.345    -.5846198    1.672809
         ind10 |   .0747918   .5620173     0.13   0.894    -1.026742    1.176325
               |
        London |
           L1. |  -.4766593    .438468    -1.09   0.277    -1.336041    .3827222
               |
         Wales |
           L1. |   .9786768   .6050952     1.62   0.106    -.2072881    2.164642
               |
      Scotland |
           L1. |  -.5221764   .3469227    -1.51   0.132    -1.202132    .1577796
               |
          NIrl |
           L1. |  -.2095915   .9163742    -0.23   0.819    -2.005652    1.586469
               |
     m_selfemp |
           L1. |   .1313993    .328671     0.40   0.689     -.512784    .7755826
               |
     f_selfemp |
           L1. |  -.5321862   .3140178    -1.69   0.090     -1.14765    .0832774
               |
  health_limit |
           L1. |  -.3252887   .3696936    -0.88   0.379    -1.049875    .3992975
               |
      bornAway |   -.101173    .442541    -0.23   0.819    -.9685374    .7661915
               |
        nokids |
           L1. |  -.1626899    .245243    -0.66   0.507    -.6433574    .3179776
               |
         _cons |   1.971202   2.785956     0.71   0.479    -3.489172    7.431576
---------------+----------------------------------------------------------------
selfemp        |
       married |
           L1. |   .0642329   .0763119     0.84   0.400    -.0853357    .2138014
               |
         black |  -.2285459   .4061279    -0.56   0.574    -1.024542    .5674502
         asian |  -.1564194   .2551742    -0.61   0.540    -.6565517    .3437129
        female |  -.1005628   .0619287    -1.62   0.104    -.2219408    .0208153
          ind2 |  -.7648943   .2713569    -2.82   0.005    -1.296744   -.2330445
          ind3 |  -1.298695   .2379675    -5.46   0.000    -1.765103   -.8322875
          ind4 |  -1.292019   .2407014    -5.37   0.000    -1.763785   -.8202524
          ind5 |  -.5689479   .1920952    -2.96   0.003    -.9454476   -.1924481
          ind6 |  -.4755176   .1868052    -2.55   0.011    -.8416492   -.1093861
          ind7 |  -.6639809   .1854955    -3.58   0.000    -1.027545   -.3004164
          ind8 |   -.539273   .1851389    -2.91   0.004    -.9021386   -.1764073
          ind9 |  -.7363891   .1867942    -3.94   0.000    -1.102499   -.3702791
         ind10 |  -.6063361   .1863264    -3.25   0.001    -.9715292   -.2411431
               |
        London |
           L1. |  -.1603144   .1077334    -1.49   0.137     -.371468    .0508393
               |
         Wales |
           L1. |  -.3130652   .1677528    -1.87   0.062    -.6418545    .0157242
               |
      Scotland |
           L1. |   .0758644   .1032779     0.73   0.463    -.1265565    .2782854
               |
          NIrl |
           L1. |  -.1122825    .272269    -0.41   0.680      -.64592     .421355
               |
     m_selfemp |
           L1. |    .144386   .0976984     1.48   0.139    -.0470994    .3358713
               |
     f_selfemp |
           L1. |  -.2739105   .0856586    -3.20   0.001    -.4417983   -.1060227
               |
  health_limit |
           L1. |  -.0362042   .1186278    -0.31   0.760    -.2687103     .196302
               |
      bornAway |    .127598    .128326     0.99   0.320    -.1239164    .3791124
               |
        nokids |
           L1. |  -.0636378   .0641182    -0.99   0.321    -.1893072    .0620316
               |
  ln_schooling |
           L1. |   -.013405   .0999112    -0.13   0.893    -.2092274    .1824174
               |
ln_tenure_diff |
           L1. |   .5881692   .0260492    22.58   0.000     .5371137    .6392247
               |
        ln_age |
           L1. |   1.147537   .1368181     8.39   0.000     .8793787    1.415696
               |
      windfdy5 |
           L1. |   .4570921   .3798635     1.20   0.229    -.2874267    1.201611
               |
      windfay5 |
           L1. |  -6.231788          .        .       .            .           .
               |
      windfcy5 |
           L1. |   .5801331   .7929175     0.73   0.464    -.9739565    2.134223
               |
      windfhy5 |
           L1. |   .0238847   .3915548     0.06   0.951    -.7435486     .791318
               |
      windfgy5 |
           L1. |   5.806527          .        .       .            .           .
               |
      windffy5 |
           L1. |   .0484234   .2560366     0.19   0.850     -.453399    .5502459
               |
      windfiy5 |
           L1. |   .2241386   .6766467     0.33   0.740    -1.102064    1.550342
               |
         _cons |  -3.727433   .5543384    -6.72   0.000    -4.813916   -2.640949
---------------+----------------------------------------------------------------
mills          |
        lambda |   .7260067   .4077693     1.78   0.075    -.0732064     1.52522
---------------+----------------------------------------------------------------
           rho |    0.26744
         sigma |  2.7146074
--------------------------------------------------------------------------------

. predict expinc_self_np5
(option xb assumed; fitted values)
(213471 missing values generated)

. 
. ***Selection
. gen expinc_diff_np = expinc_self_np - expinc_emp_np
(214397 missing values generated)

. reg newSelfemp L.expinc_diff_np L.k_windfdy L.k_windfay L.k_windfcy L.k_windfhy L.k_windfgy L.k_windffy L.k_windfiy $personal, r

Linear regression                                      Number of obs =    2695
                                                       F( 30,  2664) =    2.51
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0222
                                                       Root MSE      =  .30585

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
expinc_diff_np |
           L1. |  -.0007288   .0068802    -0.11   0.916    -.0142198    .0127622
               |
     k_windfdy |
           L1. |   .0214581   .0048405     4.43   0.000     .0119666    .0309496
               |
     k_windfay |
           L1. |   -.001454   .0008826    -1.65   0.100    -.0031846    .0002766
               |
     k_windfcy |
           L1. |   .0038126   .0098151     0.39   0.698    -.0154334    .0230585
               |
     k_windfhy |
           L1. |  -.0016711   .0009723    -1.72   0.086    -.0035776    .0002355
               |
     k_windfgy |
           L1. |  -.0017728   .0089593    -0.20   0.843    -.0193407     .015795
               |
     k_windffy |
           L1. |   .0002686    .001123     0.24   0.811    -.0019335    .0024707
               |
     k_windfiy |
           L1. |  -.0066227   .0124225    -0.53   0.594    -.0309814    .0177359
               |
       married |
           L1. |   .0130527   .0146224     0.89   0.372    -.0156197    .0417252
               |
         black |  -.0413152    .044416    -0.93   0.352    -.1284084    .0457781
         asian |  -.1125707   .0499014    -2.26   0.024    -.2104202   -.0147213
        female |  -.0156145   .0131507    -1.19   0.235    -.0414011    .0101722
          ind2 |  -.0647206   .0566281    -1.14   0.253    -.1757601    .0463188
          ind3 |  -.0891752   .0445365    -2.00   0.045    -.1765047   -.0018457
          ind4 |  -.0771419   .0477477    -1.62   0.106    -.1707682    .0164844
          ind5 |  -.0436301   .0459434    -0.95   0.342    -.1337183    .0464582
          ind6 |  -.0070325    .045793    -0.15   0.878    -.0968259    .0827609
          ind7 |  -.0414725   .0443923    -0.93   0.350    -.1285194    .0455743
          ind8 |   .0006653   .0454235     0.01   0.988    -.0884036    .0897342
          ind9 |  -.0045278   .0456741    -0.10   0.921    -.0940881    .0850325
         ind10 |  -.0172658   .0450303    -0.38   0.701    -.1055637     .071032
               |
        London |
           L1. |   .0041494    .021377     0.19   0.846    -.0377677    .0460665
               |
         Wales |
           L1. |  -.0142643    .031188    -0.46   0.647    -.0754194    .0468909
               |
      Scotland |
           L1. |   .0434821   .0255131     1.70   0.088    -.0065454    .0935097
               |
          NIrl |
           L1. |  -.0367805   .0649518    -0.57   0.571    -.1641415    .0905805
               |
     m_selfemp |
           L1. |  -.0215592   .0199064    -1.08   0.279    -.0605927    .0174744
               |
     f_selfemp |
           L1. |  -.0224553   .0173639    -1.29   0.196    -.0565034    .0115927
               |
  health_limit |
           L1. |   .0035831   .0264251     0.14   0.892    -.0482326    .0553989
               |
      bornAway |   .0513233   .0342705     1.50   0.134    -.0158761    .1185227
               |
        nokids |
           L1. |   .0117045   .0128679     0.91   0.363    -.0135276    .0369367
               |
         _cons |   .1215879   .0454008     2.68   0.007     .0325635    .2106123
--------------------------------------------------------------------------------

. probit newSelfemp L.expinc_diff_np L.k_windfdy L.k_windfay L.k_windfcy L.k_windfhy L.k_windfgy L.k_windffy L.k_windfiy $personal, r

Iteration 0:   log pseudolikelihood = -909.66854  
Iteration 1:   log pseudolikelihood = -883.13983  
Iteration 2:   log pseudolikelihood = -881.84316  
Iteration 3:   log pseudolikelihood = -880.58104  
Iteration 4:   log pseudolikelihood = -880.21295  
Iteration 5:   log pseudolikelihood = -880.19497  
Iteration 6:   log pseudolikelihood = -880.19492  

Probit regression                                 Number of obs   =       2695
                                                  Wald chi2(30)   =      59.91
                                                  Prob > chi2     =     0.0009
Log pseudolikelihood = -880.19492                 Pseudo R2       =     0.0324

--------------------------------------------------------------------------------
               |               Robust
    newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
expinc_diff_np |
           L1. |  -.0083317   .0388239    -0.21   0.830    -.0844252    .0677618
               |
     k_windfdy |
           L1. |   .0689439   .0196612     3.51   0.000     .0304087    .1074791
               |
     k_windfay |
           L1. |   -.025143   .0289156    -0.87   0.385    -.0818165    .0315305
               |
     k_windfcy |
           L1. |   .0172694   .0371017     0.47   0.642    -.0554487    .0899874
               |
     k_windfhy |
           L1. |  -.5347442   .2258114    -2.37   0.018    -.9773265    -.092162
               |
     k_windfgy |
           L1. |  -.0095206   .0570461    -0.17   0.867    -.1213289    .1022876
               |
     k_windffy |
           L1. |   .0014971   .0057373     0.26   0.794    -.0097477     .012742
               |
     k_windfiy |
           L1. |  -.0410698    .091837    -0.45   0.655     -.221067    .1389274
               |
       married |
           L1. |   .0861374   .0831612     1.04   0.300    -.0768555    .2491303
               |
         black |   -.319204    .358606    -0.89   0.373    -1.022059    .3836509
         asian |  -.6688382   .3683415    -1.82   0.069    -1.390774     .053098
        female |  -.0969478   .0725871    -1.34   0.182    -.2392159    .0453202
          ind2 |  -.3501364   .3215322    -1.09   0.276    -.9803279     .280055
          ind3 |  -.6197041   .2592646    -2.39   0.017    -1.127853   -.1115549
          ind4 |   -.499606   .2658147    -1.88   0.060    -1.020593    .0213812
          ind5 |  -.2555298   .2334438    -1.09   0.274    -.7130713    .2020116
          ind6 |   -.050715   .2242277    -0.23   0.821    -.4901932    .3887632
          ind7 |  -.2325821    .222901    -1.04   0.297      -.66946    .2042959
          ind8 |  -.0093743   .2208407    -0.04   0.966    -.4422141    .4234655
          ind9 |  -.0238903   .2230493    -0.11   0.915    -.4610589    .4132783
         ind10 |  -.0979911   .2229857    -0.44   0.660     -.535035    .3390528
               |
        London |
           L1. |   .0399822     .11885     0.34   0.737    -.1929595    .2729239
               |
         Wales |
           L1. |  -.0713226   .1801426    -0.40   0.692    -.4243956    .2817504
               |
      Scotland |
           L1. |   .1887559   .1111912     1.70   0.090    -.0291749    .4066866
               |
          NIrl |
           L1. |  -.2924129   .4866138    -0.60   0.548    -1.246159    .6613327
               |
     m_selfemp |
           L1. |  -.1500529    .123808    -1.21   0.226    -.3927121    .0926063
               |
     f_selfemp |
           L1. |  -.1429241   .1018949    -1.40   0.161    -.3426344    .0567862
               |
  health_limit |
           L1. |   .0105138   .1401873     0.07   0.940    -.2642484    .2852759
               |
      bornAway |   .2455655    .144395     1.70   0.089    -.0374436    .5285745
               |
        nokids |
           L1. |   .0760758    .071404     1.07   0.287    -.0638735     .216025
               |
         _cons |  -1.173432   .2314286    -5.07   0.000    -1.627024   -.7198404
--------------------------------------------------------------------------------
Note: 5 failures and 0 successes completely determined.

. margins, dydx(L.expinc_diff_np L.k_windfdy L.k_windfay L.k_windfcy L.k_windfhy L.k_windfgy L.k_windffy L.k_windfiy)

Average marginal effects                          Number of obs   =       2695
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.expinc_diff_np L.k_windfdy L.k_windfay L.k_windfcy L.k_windfhy L.k_windfgy L.k_windffy L.k_windfiy

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
expinc_diff_np |
           L1. |  -.0014754   .0068761    -0.21   0.830    -.0149523    .0120015
               |
     k_windfdy |
           L1. |   .0122089   .0034733     3.52   0.000     .0054013    .0190164
               |
     k_windfay |
           L1. |  -.0044524   .0051221    -0.87   0.385    -.0144915    .0055866
               |
     k_windfcy |
           L1. |   .0030581   .0065711     0.47   0.642    -.0098211    .0159373
               |
     k_windfhy |
           L1. |  -.0946947   .0401378    -2.36   0.018    -.1733633    -.016026
               |
     k_windfgy |
           L1. |   -.001686    .010102    -0.17   0.867    -.0214855    .0181136
               |
     k_windffy |
           L1. |   .0002651    .001016     0.26   0.794    -.0017262    .0022564
               |
     k_windfiy |
           L1. |  -.0072728   .0162599    -0.45   0.655    -.0391416     .024596
--------------------------------------------------------------------------------

. 
. *with logs
. gen expinc_diff_npl = expinc_self_npl - expinc_emp_npl
(214397 missing values generated)

. reg newSelfemp L.expinc_diff_npl L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy $personal, r

Linear regression                                      Number of obs =    2695
                                                       F( 30,  2664) =    1.92
                                                       Prob > F      =  0.0019
                                                       R-squared     =  0.0190
                                                       Root MSE      =  .30636

---------------------------------------------------------------------------------
                |               Robust
     newSelfemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |  -.0028616   .0078917    -0.36   0.717    -.0183362    .0126129
                |
     ln_windfdy |
            L1. |   .0210649   .0103844     2.03   0.043     .0007025    .0414272
                |
     ln_windfay |
            L1. |  -.0059008   .0046223    -1.28   0.202    -.0149645     .003163
                |
     ln_windfcy |
            L1. |    .000712    .009886     0.07   0.943    -.0186729    .0200969
                |
     ln_windfhy |
            L1. |  -.0059875   .0038151    -1.57   0.117    -.0134683    .0014933
                |
     ln_windfgy |
            L1. |   .0010441   .0054128     0.19   0.847    -.0095696    .0116577
                |
     ln_windffy |
            L1. |  -.0005808   .0049664    -0.12   0.907    -.0103193    .0091576
                |
     ln_windfiy |
            L1. |  -.0028945   .0039001    -0.74   0.458    -.0105419     .004753
                |
        married |
            L1. |   .0141751   .0147308     0.96   0.336    -.0147098      .04306
                |
          black |  -.0372036   .0458247    -0.81   0.417    -.1270591    .0526519
          asian |  -.1152735   .0500138    -2.30   0.021    -.2133432   -.0172037
         female |  -.0175557   .0131935    -1.33   0.183    -.0434262    .0083148
           ind2 |  -.0687716   .0559857    -1.23   0.219    -.1785514    .0410083
           ind3 |  -.0943553   .0441248    -2.14   0.033    -.1808777   -.0078329
           ind4 |  -.0836445    .046905    -1.78   0.075    -.1756184    .0083294
           ind5 |  -.0489306   .0453097    -1.08   0.280    -.1377764    .0399152
           ind6 |  -.0108904   .0452614    -0.24   0.810    -.0996415    .0778607
           ind7 |  -.0449358   .0437668    -1.03   0.305    -.1307562    .0408845
           ind8 |   .0003594    .044926     0.01   0.994     -.087734    .0884528
           ind9 |  -.0074608   .0451162    -0.17   0.869    -.0959272    .0810056
          ind10 |  -.0201156   .0445387    -0.45   0.652    -.1074494    .0672182
                |
         London |
            L1. |   .0009299   .0214711     0.04   0.965    -.0411717    .0430316
                |
          Wales |
            L1. |  -.0125514   .0315536    -0.40   0.691    -.0744235    .0493207
                |
       Scotland |
            L1. |   .0408579   .0255639     1.60   0.110    -.0092693    .0909851
                |
           NIrl |
            L1. |  -.0380012   .0648139    -0.59   0.558    -.1650918    .0890895
                |
      m_selfemp |
            L1. |  -.0221207   .0198233    -1.12   0.265    -.0609912    .0167498
                |
      f_selfemp |
            L1. |  -.0228611   .0173293    -1.32   0.187    -.0568414    .0111193
                |
   health_limit |
            L1. |    .003074   .0266249     0.12   0.908    -.0491335    .0552815
                |
       bornAway |   .0518239   .0343182     1.51   0.131    -.0154692    .1191171
                |
         nokids |
            L1. |   .0131175   .0128892     1.02   0.309    -.0121564    .0383914
                |
          _cons |   .1217477   .0449859     2.71   0.007     .0335369    .2099584
---------------------------------------------------------------------------------

. probit newSelfemp L.expinc_diff_npl  L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy $personal, r

Iteration 0:   log pseudolikelihood = -909.66854  
Iteration 1:   log pseudolikelihood = -884.69718  
Iteration 2:   log pseudolikelihood = -884.27174  
Iteration 3:   log pseudolikelihood = -884.27108  
Iteration 4:   log pseudolikelihood = -884.27108  

Probit regression                                 Number of obs   =       2695
                                                  Wald chi2(30)   =      53.19
                                                  Prob > chi2     =     0.0056
Log pseudolikelihood = -884.27108                 Pseudo R2       =     0.0279

---------------------------------------------------------------------------------
                |               Robust
     newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |  -.0217954   .0449841    -0.48   0.628    -.1099626    .0663718
                |
     ln_windfdy |
            L1. |   .0764984   .0308452     2.48   0.013     .0160429     .136954
                |
     ln_windfay |
            L1. |  -.0369276   .0340155    -1.09   0.278    -.1035966    .0297415
                |
     ln_windfcy |
            L1. |   .0050211   .0505691     0.10   0.921    -.0940926    .1041348
                |
     ln_windfhy |
            L1. |  -.0423011   .0349469    -1.21   0.226    -.1107959    .0261936
                |
     ln_windfgy |
            L1. |   .0076646   .0280937     0.27   0.785    -.0473981    .0627272
                |
     ln_windffy |
            L1. |  -.0014759   .0291913    -0.05   0.960    -.0586898     .055738
                |
     ln_windfiy |
            L1. |  -.0234781    .027982    -0.84   0.401    -.0783219    .0313656
                |
        married |
            L1. |   .0879534   .0828023     1.06   0.288    -.0743361    .2502429
                |
          black |  -.2776597   .3616452    -0.77   0.443    -.9864714    .4311519
          asian |  -.6741807    .368997    -1.83   0.068    -1.397402    .0490403
         female |  -.1027357   .0724206    -1.42   0.156    -.2446775    .0392061
           ind2 |   -.381181   .3183715    -1.20   0.231    -1.005178    .2428158
           ind3 |  -.6380141   .2595384    -2.46   0.014      -1.1467   -.1293281
           ind4 |  -.5260477   .2628271    -2.00   0.045    -1.041179   -.0109159
           ind5 |  -.2733178   .2313324    -1.18   0.237    -.7267208    .1800853
           ind6 |   -.064454   .2224143    -0.29   0.772    -.5003781      .37147
           ind7 |  -.2462819   .2209265    -1.11   0.265    -.6792899    .1867261
           ind8 |  -.0106665   .2187977    -0.05   0.961    -.4395023    .4181692
           ind9 |  -.0375435   .2211721    -0.17   0.865    -.4710328    .3959457
          ind10 |  -.1071562   .2213573    -0.48   0.628    -.5410085     .326696
                |
         London |
            L1. |   .0231597   .1190598     0.19   0.846    -.2101932    .2565127
                |
          Wales |
            L1. |  -.0733073   .1817238    -0.40   0.687    -.4294795    .2828649
                |
       Scotland |
            L1. |   .1783306   .1119936     1.59   0.111    -.0411727     .397834
                |
           NIrl |
            L1. |  -.2959302    .486592    -0.61   0.543    -1.249633    .6577726
                |
      m_selfemp |
            L1. |  -.1512414    .123763    -1.22   0.222    -.3938124    .0913295
                |
      f_selfemp |
            L1. |  -.1434394   .1018382    -1.41   0.159    -.3430386    .0561598
                |
   health_limit |
            L1. |   .0190903   .1406798     0.14   0.892    -.2566371    .2948176
                |
       bornAway |   .2496879   .1445659     1.73   0.084     -.033656    .5330317
                |
         nokids |
            L1. |   .0760322    .071256     1.07   0.286    -.0636269    .2156914
                |
          _cons |  -1.184136   .2299073    -5.15   0.000    -1.634746   -.7335261
---------------------------------------------------------------------------------

. margins, dydx(L.expinc_diff_npl  L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy)

Average marginal effects                          Number of obs   =       2695
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.expinc_diff_npl L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |  -.0038775   .0080057    -0.48   0.628    -.0195683    .0118134
                |
     ln_windfdy |
            L1. |   .0136092   .0054767     2.48   0.013     .0028751    .0243433
                |
     ln_windfay |
            L1. |  -.0065695   .0060536    -1.09   0.278    -.0184344    .0052954
                |
     ln_windfcy |
            L1. |   .0008933   .0089965     0.10   0.921    -.0167395    .0185261
                |
     ln_windfhy |
            L1. |  -.0075255    .006218    -1.21   0.226    -.0197124    .0046615
                |
     ln_windfgy |
            L1. |   .0013635   .0049986     0.27   0.785    -.0084335    .0111606
                |
     ln_windffy |
            L1. |  -.0002626   .0051931    -0.05   0.960    -.0104408    .0099157
                |
     ln_windfiy |
            L1. |  -.0041768   .0049814    -0.84   0.402    -.0139402    .0055866
---------------------------------------------------------------------------------

. 
. *with dummies
. gen expinc_diff_npd = expinc_self_npd - expinc_emp_npd
(214397 missing values generated)

. reg newSelfemp L.expinc_diff_npd L.has_windfdy L.has_windfay L.has_windfcy L.has_windfhy L.has_windfgy L.has_windffy L.has_windfiy $personal, r

Linear regression                                      Number of obs =    2695
                                                       F( 30,  2664) =    1.88
                                                       Prob > F      =  0.0026
                                                       R-squared     =  0.0179
                                                       Root MSE      =  .30652

---------------------------------------------------------------------------------
                |               Robust
     newSelfemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npd |
            L1. |  -.0029259   .0078255    -0.37   0.709    -.0182706    .0124189
                |
    has_windfdy |
            L1. |   .1576788   .0849046     1.86   0.063    -.0088069    .3241644
                |
    has_windfay |
            L1. |  -.0454256   .0436562    -1.04   0.298     -.131029    .0401779
                |
    has_windfcy |
            L1. |  -.0072549   .0706849    -0.10   0.918    -.1458578    .1313479
                |
    has_windfhy |
            L1. |  -.0192447   .0411838    -0.47   0.640    -.1000003    .0615108
                |
    has_windfgy |
            L1. |   .0085686   .0227038     0.38   0.706    -.0359503    .0530875
                |
    has_windffy |
            L1. |  -.0079889   .0460952    -0.17   0.862    -.0983749    .0823972
                |
    has_windfiy |
            L1. |  -.0221904   .0293103    -0.76   0.449    -.0796637    .0352829
                |
        married |
            L1. |   .0140682   .0147544     0.95   0.340    -.0148631    .0429994
                |
          black |  -.0366954   .0453695    -0.81   0.419    -.1256584    .0522677
          asian |  -.1158538   .0500112    -2.32   0.021    -.2139186    -.017789
         female |  -.0174522   .0132046    -1.32   0.186    -.0433445    .0084401
           ind2 |  -.0688141   .0559311    -1.23   0.219     -.178487    .0408587
           ind3 |   -.094303    .044098    -2.14   0.033    -.1807729   -.0078332
           ind4 |  -.0831015    .046883    -1.77   0.076    -.1750322    .0088292
           ind5 |  -.0486348   .0452735    -1.07   0.283    -.1374095    .0401399
           ind6 |  -.0104688   .0451996    -0.23   0.817    -.0990987     .078161
           ind7 |  -.0448552   .0437249    -1.03   0.305    -.1305934    .0408831
           ind8 |   .0008527   .0448979     0.02   0.985    -.0871855    .0888909
           ind9 |  -.0074177   .0451056    -0.16   0.869    -.0958632    .0810279
          ind10 |  -.0199593   .0445413    -0.45   0.654    -.1072983    .0673797
                |
         London |
            L1. |   .0008979   .0214828     0.04   0.967    -.0412269    .0430226
                |
          Wales |
            L1. |  -.0134414   .0316294    -0.42   0.671     -.075462    .0485792
                |
       Scotland |
            L1. |   .0409578   .0255995     1.60   0.110     -.009239    .0911547
                |
           NIrl |
            L1. |  -.0377492   .0647602    -0.58   0.560    -.1647345    .0892361
                |
      m_selfemp |
            L1. |  -.0222781   .0198196    -1.12   0.261    -.0611415    .0165852
                |
      f_selfemp |
            L1. |  -.0228324   .0173274    -1.32   0.188     -.056809    .0111441
                |
   health_limit |
            L1. |   .0035765   .0266773     0.13   0.893    -.0487339    .0558868
                |
       bornAway |   .0529192   .0343337     1.54   0.123    -.0144042    .1202426
                |
         nokids |
            L1. |   .0130996   .0128815     1.02   0.309    -.0121592    .0383584
                |
          _cons |   .1207718   .0449632     2.69   0.007     .0326054    .2089381
---------------------------------------------------------------------------------

. probit newSelfemp L.expinc_diff_npd L.has_windfdy L.has_windfay L.has_windfcy L.has_windfhy L.has_windfgy L.has_windffy L.has_windfiy $personal, r

Iteration 0:   log pseudolikelihood = -909.66854  
Iteration 1:   log pseudolikelihood =   -885.756  
Iteration 2:   log pseudolikelihood = -885.35083  
Iteration 3:   log pseudolikelihood = -885.35017  
Iteration 4:   log pseudolikelihood = -885.35017  

Probit regression                                 Number of obs   =       2695
                                                  Wald chi2(30)   =      51.84
                                                  Prob > chi2     =     0.0079
Log pseudolikelihood = -885.35017                 Pseudo R2       =     0.0267

---------------------------------------------------------------------------------
                |               Robust
     newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npd |
            L1. |  -.0217628   .0446176    -0.49   0.626    -.1092116     .065686
                |
    has_windfdy |
            L1. |   .5995038   .2635801     2.27   0.023     .0828963    1.116111
                |
    has_windfay |
            L1. |  -.2724679   .3015888    -0.90   0.366     -.863571    .3186353
                |
    has_windfcy |
            L1. |  -.0303452   .3996974    -0.08   0.939    -.8137377    .7530474
                |
    has_windfhy |
            L1. |  -.1049815   .2653875    -0.40   0.692    -.6251314    .4151684
                |
    has_windfgy |
            L1. |   .0519375   .1175325     0.44   0.659    -.1784219    .2822969
                |
    has_windffy |
            L1. |   -.021536   .2788169    -0.08   0.938    -.5680071    .5249352
                |
    has_windfiy |
            L1. |   -.176246   .2082292    -0.85   0.397    -.5843677    .2318757
                |
        married |
            L1. |   .0866529   .0827701     1.05   0.295    -.0755734    .2488793
                |
          black |   -.285695   .3564769    -0.80   0.423    -.9843769    .4129868
          asian |  -.6757861   .3689861    -1.83   0.067    -1.398985    .0474133
         female |   -.100764   .0724473    -1.39   0.164    -.2427581    .0412301
           ind2 |   -.376795   .3181885    -1.18   0.236    -1.000433    .2468429
           ind3 |  -.6384735   .2595286    -2.46   0.014     -1.14714   -.1298067
           ind4 |  -.5209152   .2631331    -1.98   0.048    -1.036647   -.0051838
           ind5 |  -.2689102    .231407    -1.16   0.245    -.7224597    .1846392
           ind6 |  -.0592855   .2224207    -0.27   0.790     -.495222     .376651
           ind7 |   -.243162   .2210086    -1.10   0.271    -.6763309    .1900069
           ind8 |  -.0058354   .2187739    -0.03   0.979    -.4346244    .4229536
           ind9 |  -.0366735   .2211876    -0.17   0.868    -.4701931    .3968462
          ind10 |  -.1048429   .2214856    -0.47   0.636    -.5389467    .3292609
                |
         London |
            L1. |   .0247506   .1187986     0.21   0.835    -.2080903    .2575916
                |
          Wales |
            L1. |  -.0804533    .181883    -0.44   0.658    -.4369374    .2760309
                |
       Scotland |
            L1. |   .1791746   .1122367     1.60   0.110    -.0408052    .3991544
                |
           NIrl |
            L1. |  -.2948758     .48647    -0.61   0.544    -1.248339    .6585879
                |
      m_selfemp |
            L1. |   -.152593   .1237509    -1.23   0.218    -.3951404    .0899544
                |
      f_selfemp |
            L1. |  -.1427593   .1017749    -1.40   0.161    -.3422345    .0567159
                |
   health_limit |
            L1. |   .0216103   .1407715     0.15   0.878    -.2542968    .2975175
                |
       bornAway |    .254418   .1444458     1.76   0.078    -.0286906    .5375266
                |
         nokids |
            L1. |   .0745442   .0712019     1.05   0.295    -.0650088    .2140973
                |
          _cons |  -1.190595   .2300232    -5.18   0.000    -1.641432    -.739758
---------------------------------------------------------------------------------

. margins, dydx(L.expinc_diff_npd L.has_windfdy L.has_windfay L.has_windfcy L.has_windfhy L.has_windfgy L.has_windffy L.has_windfiy)

Average marginal effects                          Number of obs   =       2695
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.expinc_diff_npd L.has_windfdy L.has_windfay L.has_windfcy L.has_windfhy L.has_windfgy L.has_windffy L.has_windfiy

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npd |
            L1. |  -.0038763   .0079499    -0.49   0.626    -.0194578    .0117052
                |
    has_windfdy |
            L1. |   .1067814   .0468802     2.28   0.023      .014898    .1986649
                |
    has_windfay |
            L1. |   -.048531   .0537232    -0.90   0.366    -.1538265    .0567645
                |
    has_windfcy |
            L1. |   -.005405   .0711916    -0.08   0.939     -.144938    .1341281
                |
    has_windfhy |
            L1. |  -.0186989   .0472635    -0.40   0.692    -.1113336    .0739357
                |
    has_windfgy |
            L1. |   .0092509   .0209374     0.44   0.659    -.0317857    .0502876
                |
    has_windffy |
            L1. |  -.0038359   .0496592    -0.08   0.938    -.1011661    .0934943
                |
    has_windfiy |
            L1. |  -.0313923   .0371153    -0.85   0.398    -.1041369    .0413523
---------------------------------------------------------------------------------

. 
. *over 5000
. gen expinc_diff_np5 = expinc_self_np5 - expinc_emp_np5
(214397 missing values generated)

. reg newSelfemp L.expinc_diff_np5  L.windfdy5 L.windfay5 L.windfcy5 L.windfhy5 L.windfgy5 L.windffy5 L.windfiy5 $personal, r

Linear regression                                      Number of obs =    2695
                                                       F( 30,  2664) =    4.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0195
                                                       Root MSE      =  .30628

---------------------------------------------------------------------------------
                |               Robust
     newSelfemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_np5 |
            L1. |  -.0013887   .0069658    -0.20   0.842    -.0150476    .0122701
                |
       windfdy5 |
            L1. |   .2340127   .1250662     1.87   0.061    -.0112239    .4792493
                |
       windfay5 |
            L1. |  -.0844886   .0505519    -1.67   0.095    -.1836136    .0146363
                |
       windfcy5 |
            L1. |   .2311226   .2707145     0.85   0.393    -.2997093    .7619544
                |
       windfhy5 |
            L1. |  -.1100121    .016245    -6.77   0.000    -.1418662   -.0781579
                |
       windfgy5 |
            L1. |  -.1115183   .0209675    -5.32   0.000    -.1526325   -.0704042
                |
       windffy5 |
            L1. |   .0032634   .0573516     0.06   0.955    -.1091948    .1157216
                |
       windfiy5 |
            L1. |    .037923   .1367407     0.28   0.782    -.2302056    .3060516
                |
        married |
            L1. |    .013273   .0146257     0.91   0.364    -.0154058    .0419518
                |
          black |  -.0416558   .0445384    -0.94   0.350    -.1289891    .0456775
          asian |  -.1141972    .049968    -2.29   0.022    -.2121771   -.0162173
         female |  -.0164211   .0131773    -1.25   0.213    -.0422599    .0094177
           ind2 |  -.0620214   .0568163    -1.09   0.275    -.1734299    .0493872
           ind3 |  -.0894151   .0446693    -2.00   0.045    -.1770051   -.0018252
           ind4 |   -.080453   .0478507    -1.68   0.093    -.1742813    .0133754
           ind5 |  -.0447717   .0459196    -0.98   0.330    -.1348134      .04527
           ind6 |  -.0073154   .0458631    -0.16   0.873    -.0972464    .0826155
           ind7 |  -.0412158   .0444219    -0.93   0.354    -.1283207    .0458892
           ind8 |   .0050855   .0455141     0.11   0.911     -.084161    .0943319
           ind9 |  -.0039449   .0457398    -0.09   0.931    -.0936339    .0857442
          ind10 |  -.0169658    .045197    -0.38   0.707    -.1055904    .0716589
                |
         London |
            L1. |   .0033699   .0213586     0.16   0.875    -.0385113    .0452511
                |
          Wales |
            L1. |  -.0163286   .0313517    -0.52   0.603    -.0778046    .0451475
                |
       Scotland |
            L1. |   .0419448   .0255062     1.64   0.100    -.0080692    .0919588
                |
           NIrl |
            L1. |  -.0372071    .064653    -0.58   0.565    -.1639823     .089568
                |
      m_selfemp |
            L1. |  -.0215129   .0198261    -1.09   0.278    -.0603891    .0173632
                |
      f_selfemp |
            L1. |  -.0233151   .0173045    -1.35   0.178    -.0572466    .0106164
                |
   health_limit |
            L1. |  -.0002297   .0263425    -0.01   0.993    -.0518836    .0514242
                |
       bornAway |   .0514215   .0342574     1.50   0.133    -.0157522    .1185952
                |
         nokids |
            L1. |   .0128604   .0129088     1.00   0.319    -.0124518    .0381727
                |
          _cons |   .1201787    .045458     2.64   0.008     .0310422    .2093152
---------------------------------------------------------------------------------

. probit newSelfemp L.expinc_diff_np5  L.windfdy5 L.windfay5 L.windfcy5 L.windfhy5 L.windfgy5 L.windffy5 L.windfiy5 $personal, r

note: L.windfhy5 != 0 predicts failure perfectly
      L.windfhy5 dropped and 10 obs not used

note: L.windfgy5 != 0 predicts failure perfectly
      L.windfgy5 dropped and 2 obs not used

Iteration 0:   log pseudolikelihood = -908.32411  
Iteration 1:   log pseudolikelihood = -883.89887  
Iteration 2:   log pseudolikelihood = -883.48502  
Iteration 3:   log pseudolikelihood = -883.48435  
Iteration 4:   log pseudolikelihood = -883.48435  

Probit regression                                 Number of obs   =       2683
                                                  Wald chi2(28)   =      53.45
                                                  Prob > chi2     =     0.0026
Log pseudolikelihood = -883.48435                 Pseudo R2       =     0.0273

---------------------------------------------------------------------------------
                |               Robust
     newSelfemp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_np5 |
            L1. |  -.0103031   .0391922    -0.26   0.793    -.0871185    .0665123
                |
       windfdy5 |
            L1. |   .7835668   .3445959     2.27   0.023     .1081712    1.458962
                |
       windfay5 |
            L1. |  -.5646959   .4720204    -1.20   0.232    -1.489839     .360447
                |
       windfcy5 |
            L1. |   .8511376   .7514927     1.13   0.257    -.6217609    2.324036
                |
       windfhy5 |
            L1. |          0  (omitted)
                |
       windfgy5 |
            L1. |          0  (omitted)
                |
       windffy5 |
            L1. |   .0238639   .3213183     0.07   0.941    -.6059084    .6536362
                |
       windfiy5 |
            L1. |   .2103634   .6107789     0.34   0.731    -.9867414    1.407468
                |
        married |
            L1. |   .0841972   .0829621     1.01   0.310    -.0784055    .2467999
                |
          black |  -.3231706      .3577    -0.90   0.366     -1.02425    .3779085
          asian |  -.6699355   .3686866    -1.82   0.069    -1.392548    .0526769
         female |  -.0967107   .0726519    -1.33   0.183    -.2391058    .0456844
           ind2 |   -.350625   .3221547    -1.09   0.276    -.9820366    .2807866
           ind3 |  -.6310775   .2593728    -2.43   0.015    -1.139439   -.1227163
           ind4 |  -.5148234    .265686    -1.94   0.053    -1.035558    .0059115
           ind5 |  -.2619337   .2333289    -1.12   0.262    -.7192499    .1953826
           ind6 |  -.0581161   .2238585    -0.26   0.795    -.4968707    .3806384
           ind7 |  -.2393995   .2226765    -1.08   0.282    -.6758375    .1970384
           ind8 |   .0024672   .2202695     0.01   0.991     -.429253    .4341874
           ind9 |  -.0322923   .2226863    -0.15   0.885    -.4687493    .4041648
          ind10 |  -.1029637   .2232051    -0.46   0.645    -.5404376    .3345102
                |
         London |
            L1. |   .0372462   .1189467     0.31   0.754    -.1958851    .2703775
                |
          Wales |
            L1. |  -.0924717   .1804196    -0.51   0.608    -.4460875    .2611441
                |
       Scotland |
            L1. |   .1857055   .1114495     1.67   0.096    -.0327315    .4041426
                |
           NIrl |
            L1. |  -.2928122    .485801    -0.60   0.547    -1.244965    .6593403
                |
      m_selfemp |
            L1. |  -.1489077   .1235141    -1.21   0.228    -.3909909    .0931755
                |
      f_selfemp |
            L1. |  -.1475006   .1015877    -1.45   0.147    -.3466089    .0516077
                |
   health_limit |
            L1. |  -.0006943   .1416557    -0.00   0.996    -.2783344    .2769459
                |
       bornAway |   .2509822    .144713     1.73   0.083    -.0326501    .5346144
                |
         nokids |
            L1. |   .0748917   .0714787     1.05   0.295    -.0652041    .2149874
                |
          _cons |  -1.175412   .2316694    -5.07   0.000    -1.629475   -.7213482
---------------------------------------------------------------------------------

. margins, dydx(L.expinc_diff_np5  L.windfdy5 L.windfay5 L.windfcy5 L.windfhy5 L.windfgy5 L.windffy5 L.windfiy5)

Average marginal effects                          Number of obs   =       2683
Model VCE    : Robust

Expression   : Pr(newSelfemp), predict()
dy/dx w.r.t. : L.expinc_diff_np5 L.windfdy5 L.windfay5 L.windfcy5 L.windfhy5 L.windfgy5 L.windffy5 L.windfiy5

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_np5 |
            L1. |  -.0018395   .0069987    -0.26   0.793    -.0155567    .0118776
                |
       windfdy5 |
            L1. |   .1399005   .0614174     2.28   0.023     .0195246    .2602763
                |
       windfay5 |
            L1. |  -.1008226   .0843196    -1.20   0.232     -.266086    .0644409
                |
       windfcy5 |
            L1. |   .1519648   .1341387     1.13   0.257    -.1109423    .4148719
                |
       windfhy5 |
            L1. |          0  (omitted)
                |
       windfgy5 |
            L1. |          0  (omitted)
                |
       windffy5 |
            L1. |   .0042607   .0573698     0.07   0.941     -.108182    .1167034
                |
       windfiy5 |
            L1. |   .0375589   .1090621     0.34   0.731    -.1761989    .2513168
---------------------------------------------------------------------------------

. 
. *different transitions
. probit newOwn L.expinc_diff_npl  L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy $personal, r

note: asian != 0 predicts failure perfectly
      asian dropped and 18 obs not used

note: L.NIrl != 0 predicts failure perfectly
      L.NIrl dropped and 8 obs not used

Iteration 0:   log pseudolikelihood = -431.35003  
Iteration 1:   log pseudolikelihood = -391.33556  
Iteration 2:   log pseudolikelihood = -390.86528  
Iteration 3:   log pseudolikelihood = -390.86487  
Iteration 4:   log pseudolikelihood = -390.86487  

Probit regression                                 Number of obs   =        778
                                                  Wald chi2(28)   =      66.22
                                                  Prob > chi2     =     0.0001
Log pseudolikelihood = -390.86487                 Pseudo R2       =     0.0939

---------------------------------------------------------------------------------
                |               Robust
         newOwn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |  -.4409089   .0888349    -4.96   0.000    -.6150222   -.2667956
                |
     ln_windfdy |
            L1. |   .0149476   .0563498     0.27   0.791     -.095496    .1253912
                |
     ln_windfay |
            L1. |  -.0162156   .0573408    -0.28   0.777    -.1286016    .0961704
                |
     ln_windfcy |
            L1. |  -.0443729   .0707175    -0.63   0.530    -.1829767    .0942309
                |
     ln_windfhy |
            L1. |  -.1381651   .0768189    -1.80   0.072    -.2887273    .0123971
                |
     ln_windfgy |
            L1. |  -.0270125   .0354285    -0.76   0.446     -.096451     .042426
                |
     ln_windffy |
            L1. |  -.0084564   .0374826    -0.23   0.822    -.0819211    .0650082
                |
     ln_windfiy |
            L1. |  -.0098563   .0571061    -0.17   0.863    -.1217821    .1020696
                |
        married |
            L1. |  -.0176162    .129526    -0.14   0.892    -.2714825    .2362501
                |
          black |   .0210521   .5702544     0.04   0.971    -1.096626     1.13873
          asian |          0  (omitted)
         female |  -.2643536   .1156342    -2.29   0.022    -.4909925   -.0377146
           ind2 |   .4990249   .4957044     1.01   0.314    -.4725379    1.470588
           ind3 |   .6247428   .4997451     1.25   0.211    -.3547397    1.604225
           ind4 |   .3819494   .4700224     0.81   0.416    -.5392777    1.303176
           ind5 |   .3890515   .3115032     1.25   0.212    -.2214837    .9995866
           ind6 |     .28566   .2937878     0.97   0.331    -.2901536    .8614736
           ind7 |   .5141854   .2960728     1.74   0.082    -.0661066    1.094477
           ind8 |   .7592489   .2918729     2.60   0.009     .1871885    1.331309
           ind9 |   .8631159   .3014032     2.86   0.004     .2723765    1.453855
          ind10 |   .7058294   .3012236     2.34   0.019      .115442    1.296217
                |
         London |
            L1. |   -.097824   .2253623    -0.43   0.664    -.5395261     .343878
                |
          Wales |
            L1. |   .3264941   .3029639     1.08   0.281    -.2673042    .9202924
                |
       Scotland |
            L1. |  -.2399144   .1685387    -1.42   0.155    -.5702443    .0904154
                |
           NIrl |
            L1. |          0  (omitted)
                |
      m_selfemp |
            L1. |   -.137236   .1634061    -0.84   0.401    -.4575062    .1830341
                |
      f_selfemp |
            L1. |  -.3888405   .1476268    -2.63   0.008    -.6781837   -.0994973
                |
   health_limit |
            L1. |  -.3687474   .2022881    -1.82   0.068    -.7652248    .0277299
                |
       bornAway |   .2998351   .2129706     1.41   0.159    -.1175796    .7172498
                |
         nokids |
            L1. |   .1185161   .1132365     1.05   0.295    -.1034233    .3404556
                |
          _cons |  -1.810499   .3327389    -5.44   0.000    -2.462655   -1.158343
---------------------------------------------------------------------------------

. margins, dydx(L.expinc_diff_npl  L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy)

Average marginal effects                          Number of obs   =        778
Model VCE    : Robust

Expression   : Pr(newOwn), predict()
dy/dx w.r.t. : L.expinc_diff_npl L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |   -.124982   .0235208    -5.31   0.000    -.1710818   -.0788822
                |
     ln_windfdy |
            L1. |   .0042371   .0159704     0.27   0.791    -.0270642    .0355385
                |
     ln_windfay |
            L1. |  -.0045965   .0162568    -0.28   0.777    -.0364593    .0272662
                |
     ln_windfcy |
            L1. |  -.0125781   .0200535    -0.63   0.531    -.0518822    .0267259
                |
     ln_windfhy |
            L1. |  -.0391649   .0217357    -1.80   0.072     -.081766    .0034362
                |
     ln_windfgy |
            L1. |  -.0076571   .0100456    -0.76   0.446    -.0273462     .012032
                |
     ln_windffy |
            L1. |  -.0023971   .0106215    -0.23   0.821    -.0232148    .0184206
                |
     ln_windfiy |
            L1. |  -.0027939   .0161821    -0.17   0.863    -.0345102    .0289224
---------------------------------------------------------------------------------

. probit newFirm L.expinc_diff_npl  L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy $personal, r

note: L.ln_windfay != 0 predicts failure perfectly
      L.ln_windfay dropped and 8 obs not used

note: L.ln_windfhy != 0 predicts failure perfectly
      L.ln_windfhy dropped and 9 obs not used

note: L.ln_windffy != 0 predicts failure perfectly
      L.ln_windffy dropped and 19 obs not used

note: black != 0 predicts failure perfectly
      black dropped and 8 obs not used

note: ind2 != 0 predicts failure perfectly
      ind2 dropped and 9 obs not used

Iteration 0:   log pseudolikelihood = -214.01208  
Iteration 1:   log pseudolikelihood = -177.22002  
Iteration 2:   log pseudolikelihood = -175.12865  
Iteration 3:   log pseudolikelihood = -175.11429  
Iteration 4:   log pseudolikelihood = -175.11428  

Probit regression                                 Number of obs   =        751
                                                  Wald chi2(25)   =      79.50
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -175.11428                 Pseudo R2       =     0.1818

---------------------------------------------------------------------------------
                |               Robust
        newFirm |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |  -.5215231   .0960018    -5.43   0.000    -.7096831   -.3333631
                |
     ln_windfdy |
            L1. |   .1772698    .058384     3.04   0.002     .0628393    .2917002
                |
     ln_windfay |
            L1. |          0  (omitted)
                |
     ln_windfcy |
            L1. |   .0400604   .0700495     0.57   0.567     -.097234    .1773549
                |
     ln_windfhy |
            L1. |          0  (omitted)
                |
     ln_windfgy |
            L1. |   -.082519     .06356    -1.30   0.194    -.2070943    .0420564
                |
     ln_windffy |
            L1. |          0  (omitted)
                |
     ln_windfiy |
            L1. |   .0426403   .0639016     0.67   0.505    -.0826046    .1678852
                |
        married |
            L1. |   .1217493   .1812319     0.67   0.502    -.2334588    .4769573
                |
          black |          0  (omitted)
          asian |  -.0429458   .5060087    -0.08   0.932    -1.034705     .948813
         female |  -.0129642   .1514688    -0.09   0.932    -.3098377    .2839093
           ind2 |          0  (omitted)
           ind3 |   .0309871   .5309334     0.06   0.953    -1.009623    1.071597
           ind4 |   -.580675   .5983948    -0.97   0.332    -1.753507    .5921572
           ind5 |  -.5276805   .4628401    -1.14   0.254     -1.43483    .3794695
           ind6 |   .1350055   .3689233     0.37   0.714    -.5880708    .8580818
           ind7 |   .0587601   .3845566     0.15   0.879    -.6949571    .8124772
           ind8 |   .2141618    .369199     0.58   0.562    -.5094549    .9377785
           ind9 |   .2898823   .3722746     0.78   0.436    -.4397625    1.019527
          ind10 |  -.4039614    .412911    -0.98   0.328    -1.213252    .4053293
                |
         London |
            L1. |   .0005492   .2950393     0.00   0.999    -.5777171    .5788155
                |
          Wales |
            L1. |   .3020887   .4779756     0.63   0.527    -.6347262    1.238904
                |
       Scotland |
            L1. |   .2890239    .208303     1.39   0.165    -.1192425    .6972904
                |
           NIrl |
            L1. |   .3643896     .64909     0.56   0.575    -.9078034    1.636583
                |
      m_selfemp |
            L1. |  -.7409945    .280838    -2.64   0.008    -1.291427   -.1905622
                |
      f_selfemp |
            L1. |  -.0447116   .2037287    -0.22   0.826    -.4440124    .3545893
                |
   health_limit |
            L1. |   .1124451   .2623457     0.43   0.668     -.401743    .6266332
                |
       bornAway |   .0492594   .2997671     0.16   0.869    -.5382734    .6367922
                |
         nokids |
            L1. |  -.3893907   .1542916    -2.52   0.012    -.6917968   -.0869847
                |
          _cons |  -2.260832   .3888608    -5.81   0.000    -3.022986   -1.498679
---------------------------------------------------------------------------------

. margins, dydx(L.expinc_diff_npl  L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy)

Average marginal effects                          Number of obs   =        751
Model VCE    : Robust

Expression   : Pr(newFirm), predict()
dy/dx w.r.t. : L.expinc_diff_npl L.ln_windfdy L.ln_windfay L.ln_windfcy L.ln_windfhy L.ln_windfgy L.ln_windffy L.ln_windfiy

---------------------------------------------------------------------------------
                |            Delta-method
                |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
expinc_diff_npl |
            L1. |  -.0655288   .0125711    -5.21   0.000    -.0901678   -.0408899
                |
     ln_windfdy |
            L1. |   .0222738   .0073016     3.05   0.002     .0079628    .0365847
                |
     ln_windfay |
            L1. |          0  (omitted)
                |
     ln_windfcy |
            L1. |   .0050336   .0087889     0.57   0.567    -.0121924    .0222595
                |
     ln_windfhy |
            L1. |          0  (omitted)
                |
     ln_windfgy |
            L1. |  -.0103684   .0079925    -1.30   0.195    -.0260334    .0052966
                |
     ln_windffy |
            L1. |          0  (omitted)
                |
     ln_windfiy |
            L1. |   .0053577   .0080151     0.67   0.504    -.0103517    .0210671
---------------------------------------------------------------------------------

. 
. capture log close 
